{
  "morningAdhkar": [
    {
      "id": "morning_001",
      "arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "transliteration": "A'udhu billahi minash-shaytanir-rajeem",
      "repeat": 1,
      "source": "Seeking refuge from Satan",
      "translations": {
        "en": "I seek refuge with Allah from the accursed Satan",
        "ar": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
        "id": "Aku berlindung kepada Allah dari setan yang terkutuk",
        "ur": "میں شیطان مردود سے اللہ کی پناہ مانگتا ہوں",
        "tr": "Kovulmuş şeytandan Allah'a sığınırım",
        "fr": "Je cherche refuge auprès d'Allah contre Satan le lapidé",
        "ru": "Я прибегаю к защите Аллаха от проклятого шайтана",
        "fa": "به خدا پناه می‌برم از شیطان رانده شده",
        "hi": "मैं शैतान मरदूद से अल्लाह की शरण मांगता हूं",
        "ms": "Aku berlindung kepada Allah daripada syaitan yang direjam",
        "sw": "Najikimbilia kwa Allah kutokana na Shetani aliyelaaniwa",
        "bn": "আমি বিতাড়িত শয়তান থেকে আল্লাহর আশ্রয় প্রার্থনা করছি"
      }
    },
    {
      "id": "morning_002",
      "arabic": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "transliteration": "Allahu la ilaha illa Huwa, Al-Hayyul-Qayyum. La ta'khudhuhu sinatun wa la nawm. Lahu ma fis-samawati wa ma fil-'ard. Man dhal-ladhi yashfa'u 'indahu illa bi-idhnihi. Ya'lamu ma bayna aydihim wa ma khalfahum, wa la yuhituna bi shai'im-min 'ilmihi illa bima sha'a. Wasi'a kursiyyuhus-samawati wal-ard. Wa la ya'uduhu hifdhuhuma. Wa Huwal-'Aliyyul-Adheem.",
      "repeat": 1,
      "source": "Ayat al-Kursi, Surah Al-Baqarah (2:255)",
      "translations": {
        "en": "Allah! There is no god but He, the Ever Living, the Sustainer of all existence. Neither slumber overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what is behind them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and He is never weary of preserving them. And He is the Most High, the Most Great.",
        "ar": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
        "id": "Allah, tidak ada tuhan selain Dia. Yang Maha Hidup, Yang terus-menerus mengurus (makhluk-Nya), tidak mengantuk dan tidak tidur. Milik-Nya apa yang ada di langit dan apa yang ada di bumi. Tidak ada yang dapat memberi syafaat di sisi-Nya tanpa izin-Nya. Dia mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka, dan mereka tidak mengetahui sesuatu apa pun dari ilmu-Nya kecuali apa yang dikehendaki-Nya. Kursi-Nya meliputi langit dan bumi. Dan Dia tidak merasa berat memelihara keduanya, dan Dia Maha Tinggi, Maha Besar.",
        "ur": "اللہ وہ ہے جس کے سوا کوئی معبود نہیں، وہ زندہ ہے، سب کا قائم رکھنے والا ہے، اسے نہ اونگھ آتی ہے اور نہ نیند، آسمانوں اور زمین کی ہر چیز اسی کی ہے، کون ہے جو اس کی اجازت کے بغیر اس کے حضور شفاعت کر سکے؟ وہ سب کچھ جانتا ہے جو ان کے سامنے ہے اور جو ان کے پیچھے ہے، اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کر سکتے مگر جو وہ چاہے، اس کی کرسی آسمانوں اور زمین پر وسیع ہے، اور اسے ان دونوں کی حفاظت تھکاتی نہیں، اور وہ بہت بلند، بہت عظیم ہے.",
        "tr": "Allah! O'ndan başka ilah yoktur. Diridir, kayyumdur. Onu ne bir uyuklama ne de uyku tutar. Göklerde ve yerde ne varsa hepsi O'nundur. İzni olmaksızın O'nun katında şefaat edecek kimdir? O, önlerindekini de arkalarındakini de bilir. Onlar O'nun ilminden ancak dilediği kadarını kavrayabilirler. O'nun kürsüsü gökleri ve yeri kuşatmıştır. Onları koruyup gözetmek kendisine ağır gelmez. O, yücedir, büyüktür.",
        "fr": "Allah! Point de divinité à part Lui, le Vivant, Celui qui subsiste par Lui-même 'Al-Qayyoum'. Ni somnolence ni sommeil ne Le saisissent. À Lui appartient tout ce qui est dans les cieux et tout ce qui est sur la terre. Qui peut intercéder auprès de Lui sans Sa permission? Il connaît ce qui est devant eux et ce qui est derrière eux. Et de Sa science, ils n'embrassent que ce qu'Il veut. Son Kursiy (Piédestal) déborde les cieux et la terre, dont la garde ne Lui coûte aucune peine. Et Il est le Très Haut, le Très Grand.",
        "ru": "Аллах — нет божества, кроме Него, Живого, Поддерживающего жизнь. Им не овладевают ни дремота, ни сон. Ему принадлежит то, что на небесах, и то, что на земле. Кто станет заступаться перед Ним без Его дозволения? Он знает их будущее и прошлое. Они постигают из Его знания лишь то, что Он пожелает. Его Престол объемлет небеса и землю, и Ему не в тягость их охрана. Он — Возвышенный, Великий.",
        "fa": "الله، معبودی جز او نیست. او زنده و پاینده است. نه چرت او را می‌گیرد و نه خواب. آنچه در آسمان‌ها و آنچه در زمین است، از آن اوست. کیست که جز با اجازه او در نزد او شفاعت کند؟ او آنچه را که پیش روی آن‌هاست و آنچه را که پشت سر آن‌هاست می‌داند. و آن‌ها چیزی از علم او را در بر نمی‌گیرند مگر آنچه او بخواهد. کرسی او آسمان‌ها و زمین را فرا گرفته است. و حفظ آن دو بر او دشوار نیست. و او بلندمرتبه، بزرگ است.",
        "hi": "अल्लाह, उसके सिवा कोई इबादत के लायक नहीं, वह ज़िंदा है, हर चीज़ का क़ायम रखने वाला है, उसे न ऊंघ आती है और न नींद, आसमानों और ज़मीन की हर चीज़ उसी की है, कौन है जो उसकी इजाज़त के बिना उसके हुज़ूर शफ़ाअत कर सके? वह सब कुछ जानता है जो उनके सामने है और जो उनके पीछे है, और वह उसके इल्म में से किसी चीज़ का इहाता नहीं कर सकते मगर जो वह चाहे, उसकी कुर्सी आसमानों और ज़मीन पर वसीअ है, और उसे इन दोनों की हिफाज़त थकाती नहीं, और वह बहुत बुलंद, बहुत अज़ीम है.",
        "ms": "Allah, tiada Tuhan melainkan Dia, Yang Maha Hidup, Yang kekal abadi menguruskan (sekalian makhlukNya), tidak mengantuk dan tidak tidur. MilikNya segala yang di langit dan di bumi. Tiada sesiapa yang dapat memberi syafaat di sisiNya melainkan dengan izinNya. Dia mengetahui apa yang ada di hadapan mereka dan apa yang di belakang mereka, sedang mereka tidak mengetahui sesuatu pun dari ilmuNya melainkan apa yang dikehendakiNya. KursiNya meliputi langit dan bumi, dan tiada keberatan bagiNya memelihara kedua-duanya. Dan Dialah Yang Maha Tinggi, lagi Maha Besar.",
        "sw": "Allah! Hapana mungu ila Yeye, Aliye Hai, Msimamizi wa viumbe vyote. Hasinzi Wala halali. Ni vyake vyote vilivyomo mbinguni na vilivyomo duniani. Nani huyo awezaye kuombea mbele Yake isipokuwa kwa idhini Yake? Anajua yaliyoko mbele yao na yaliyoko nyuma yao. Wala wao hawawezi kufahamu chochote katika ilimu Yake ila kwa anavyotaka Yeye. Enzi Yake imetanda mbingu na ardhi. Wala Himu yake haimuelemei. Naye ndiye Aliye Juu, Aliye Mkuu.",
        "bn": "আল্লাহ্, তিনি ছাড়া কোন উপাস্য নেই। তিনি চিরঞ্জীব, সর্বসত্তার ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না, নিদ্রাও নয়। আসমান ও যমীনে যা কিছু আছে সব তাঁরই। কে সে, যে তাঁর অনুমতি ছাড়া তাঁর কাছে সুপারিশ করবে? তিনি তাদের সামনের ও পেছনের সবকিছুই জানেন। আর তাঁর জ্ঞান থেকে তারা কিছুই আয়ত্ত করতে পারে না, তবে তিনি যা চান। তাঁর কুরসী আসমান ও যমীনব্যাপী বিস্তৃত। আর এ দুটির রক্ষণাবেক্ষণ তাঁর জন্য বোঝা হয় না। আর তিনিই সুউচ্চ, সুমহান।"
      }
    },
    {
      "id": "morning_003",
      "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ۝",
      "transliteration": "Qul Huwallahu Ahad. Allahus-Samad. Lam yalid wa lam yulad. Wa lam yakullahu kufuwan Ahad.",
      "repeat": 3,
      "source": "Surah Al-Ikhlas (112)",
      "translations": {
        "en": "Say, 'He is Allah, [the] One, Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.'",
        "ar": "قُلْ هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ۝",
        "id": "Katakanlah (Muhammad), 'Dialah Allah, Yang Maha Esa. Allah tempat meminta segala sesuatu. Dia tidak beranak dan tidak pula diperanakkan. Dan tidak ada sesuatu pun yang setara dengan Dia.'",
        "ur": "کہو، 'وہ اللہ ایک ہے، اللہ بے نیاز ہے، نہ اس نے کسی کو جنا اور نہ وہ جنا گیا، اور نہ ہی اس کا کوئی ہمسر ہے۔'",
        "tr": "De ki: O Allah, bir tektir. Allah Samed'dir (Hiçbir şeye ihtiyacı olmayıp her şeyin kendisine muhtaç olduğu). O doğurmamış ve doğmamıştır. Hiçbir şey O'na denk ve benzer değildir.",
        "fr": "Dis: 'Il est Allah, Unique. Allah, Le Seul à être imploré pour toute chose. Il n'a jamais engendré, n'a pas été engendré non plus. Et nul n'est égal à Lui.'",
        "ru": "Скажи: 'Он – Аллах, Единый, Аллах, Самодостаточный. Он не родил и не был рожден, и нет никого равного Ему.'",
        "fa": "بگو: 'او خدای یکتاست. الله، بی‌نیاز است. نزاده و زاده نشده است. و هیچ کس همتای او نبوده است.'",
        "hi": "कहो, 'वह अल्लाह एक है, अल्लाह बेनियाज़ है। न उसने किसी को जना और न वह जना गया, और न ही उसका कोई हमसर है।'",
        "ms": "Katakanlah (wahai Muhammad): 'Dialah Allah, Yang Maha Esa. Allah Yang menjadi tumpuan sekalian makhluk untuk memohon sebarang hajat. Ia tiada beranak dan tiada pula diperanakkan. Dan tidak ada sesiapapun yang setara denganNya.'",
        "sw": "Sema: 'Yeye Mwenyewe ndiye Mwenyezi Mungu peke Yake. Mwenyezi Mungu ambaye kila kitu kinamtegemea Yeye. Hakuzaa wala hakuzaliwa. Wala hana anayefanana naye hata mmoja.'",
        "bn": "বলুন, ‘তিনি আল্লাহ, এক ও অদ্বিতীয়। আল্লাহ কারো মুখাপেক্ষী নন। তিনি কাউকে জন্ম দেননি এবং তাঁকেও জন্ম দেয়া হয়নি। আর তাঁর সমকক্ষ কেউ নেই।’"
      }
    },
    {
      "id": "morning_004",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ۝",
      "transliteration": "Qul a'udhu birabbil-falaq. Min sharri ma khalaq. Wa min sharri ghasiqin idha waqab. Wa min sharrin-naffathati fil-'uqad. Wa min sharri hasidin idha hasad.",
      "repeat": 3,
      "source": "Surah Al-Falaq (113)",
      "translations": {
        "en": "Say, 'I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.'",
        "ar": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ۝",
        "id": "Katakanlah (Muhammad), 'Aku berlindung kepada Tuhan yang menguasai subuh (fajar), dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gulita, dan dari kejahatan wanita-wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila dia dengki.'",
        "ur": "کہو، 'میں صبح کے رب کی پناہ مانگتا ہوں، اس چیز کے شر سے جو اس نے پیدا کی، اور اندھیرے کے شر سے جب وہ چھا جائے، اور گرہوں میں پھونکنے والیوں کے شر سے، اور حسد کرنے والے کے شر سے جب وہ حسد کرے۔'",
        "tr": "De ki: 'Sabahın Rabbine sığınırım, yarattığı şeylerin şerrinden, karanlığı çöktüğü zaman gecenin şerrinden, düğümlere üfüren büyücü kadınların şerrinden, ve haset ettiği zaman hasetçinin şerrinden.'",
        "fr": "Dis: 'Je cherche protection auprès du Seigneur de l'aube naissante, contre le mal des êtres qu'Il a créés, contre le mal de l'obscurité quand elle s'approfondit, contre le mal de celles qui soufflent sur les nœuds, et contre le mal de l'envieux quand il envie.'",
        "ru": "Скажи: 'Я прибегаю к Господу рассвета от зла того, что Он сотворил, от зла мрака, когда он наступает, от зла колдуний, поплевывающих на узлы, от зла завистника, когда он завидует.'",
        "fa": "بگو: 'پناه می‌برم به پروردگار سپیده‌دم، از شر آنچه آفریده، و از شر شب هنگامی که فرا می‌گیرد، و از شر دمندگان در گره‌ها، و از شر حسود هنگامی که حسد می‌ورزد.'",
        "hi": "कहो, 'मैं सुबह के रब की पनाह मांगता हूं, उस चीज़ के शर से जो उसने पैदा की, और अंधेरे के शर से जब वह छा जाए, और गांठों में फूंकने वालियों के शर से, और हसद करने वाले के शर से जब वह हसद करे।'",
        "ms": "Katakanlah (wahai Muhammad): 'Aku berlindung kepada Tuhan yang menciptakan sekalian makhluk, dari kejahatan makhluk-makhlukNya; dan dari kejahatan malam apabila ia gelap gelita; dan dari kejahatan perempuan-perempuan ahli sihir yang menghembus pada simpulan-simpulan ikatan; dan dari kejahatan orang yang dengki apabila ia melakukan dengkinya.'",
        "sw": "Sema: 'Najikinga kwa Mola Mlezi wa pambazuko, na shari ya alivyoviumba, na na shari ya usiku unapoingia, na na shari ya wanaopulizia mafundoni, na na shari ya hasidi anapohusudu.'",
        "bn": "বলুন, ‘আমি আশ্রয় গ্রহণ করছি প্রভাতের রবের, তিনি যা সৃষ্টি করেছেন তার অনিষ্ট হতে; এবং রাত্রির অনিষ্ট হতে যখন তা গভীর হয়; এবং গিঁটে ফুঁকদানকারিণীদের অনিষ্ট হতে; এবং হিংসুকের অনিষ্ট হতে, যখন সে হিংসা করে।"
      }
    },
    {
      "id": "morning_005",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَٰهِ النَّاسِ ۝ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ ۝",
      "transliteration": "Qul a'udhu birabbin-nas. Malikin-nas. Ilahin-nas. Min sharril-waswasil-khannas. Alladhi yuwaswisu fi sudurin-nas. Minal jinnati wan-nas.",
      "repeat": 3,
      "source": "Surah An-Nas (114)",
      "translations": {
        "en": "Say, 'I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer - who whispers in the breasts of mankind - from among the jinn and mankind.'",
        "ar": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَٰهِ النَّاسِ ۝ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ ۝",
        "id": "Katakanlah (Muhammad), 'Aku berlindung kepada Tuhan manusia, Raja manusia, sembahan manusia, dari kejahatan (bisikan) setan yang bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari golongan jin dan manusia.'",
        "ur": "کہو، 'میں انسانوں کے رب کی پناہ مانگتا ہوں، انسانوں کے بادشاہ کی، انسانوں کے معبود کی، چھپ چھپ کر وسوسہ ڈالنے والے کے شر سے، جو انسانوں کے سینوں میں وسوسے ڈالتا ہے، جنوں میں سے ہو یا انسانوں میں سے۔'",
        "tr": "De ki: 'İnsanların Rabbine sığınırım, insanların Malikine (sahibine), insanların İlahına (tapınılacak mabuduna), sinsi vesvesecinin şerrinden, ki o insanların kalplerine vesvese verir, cinlerden ve insanlardan (olan şeytanların şerrinden).' ",
        "fr": "Dis: 'Je cherche protection auprès du Seigneur des hommes, le Roi des hommes, le Dieu des hommes, contre le mal du mauvais conseiller, furtif, qui souffle le mal dans les poitrines des hommes, qu'il soit du nombre des djinns ou des hommes.'",
        "ru": "Скажи: 'Я прибегаю к Господу людей, Царю людей, Богу людей от зла искусителя отступающего, который нашептывает в груди людей, из джиннов и людей.'",
        "fa": "بگو: 'پناه می‌برم به پروردگار مردم، پادشاه مردم، معبود مردم، از شر وسوسه‌گر پنهان شونده، که در سینه‌های مردم وسوسه می‌کند، از جن و انسان.'",
        "hi": "कहो, 'मैं इंसानों के रब की पनाह मांगता हूं, इंसानों के बादशाह की, इंसानों के माबूद की, छिप-छिप कर वसवसा डालने वाले के शर से, जो इंसानों के सीनों में वसवसे डालता है, जिन्नों में से हो या इंसानों में से।'",
        "ms": "Katakanlah (wahai Muhammad): 'Aku berlindung kepada Tuhan sekalian manusia. Yang Menguasai sekalian manusia. Tuhan yang berhak disembah oleh sekalian manusia. Dari kejahatan pembisik dan penghasut yang bersembunyi (apabila disebut nama Allah), Yang membisikkan (hasutan) ke dalam hati manusia, dari golongan jin dan manusia.'",
        "sw": "Sema: 'Najikinga kwa Mola Mlezi wa watu, Mfalme wa watu, Mungu wa watu, na shari ya mgongaji asiyeonekana, ambaye hutilia wasiwasi katika vifua vya watu, awe katika majini au wanadamu.'",
        "bn": "বলুন, ‘আমি আশ্রয় নিচ্ছি মানুষের রবের, মানুষের অধিপতির, মানুষের উপাস্যের, তার অনিষ্ট হতে যে কুমন্ত্রণা দেয় ও আত্মগোপন করে, যে মানুষের অন্তরে কুমন্ত্রণা দেয়, জিন ও মানুষে থেকে।"
      }
    },
    {
      "id": "morning_006",
      "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
      "transliteration": "Asbahna wa asbahal-mulku lillahi walhamdu lillah, la ilaha illallahu wahdahu la shareeka lah, lahul-mulku wa lahul-hamd, wa huwa 'ala kulli shai'in qadeer. Rabbi as'aluka khaira ma fee hadhal-yawmi wa khaira ma ba'dahu, wa a'udhu bika min sharri ma fee hadhal-yawmi wa sharri ma ba'dahu. Rabbi a'udhu bika minal-kasali wa su'il-kibari. Rabbi a'udhu bika min 'adhabin fin-nari wa 'adhabin fil-qabr.",
      "repeat": 1,
      "source": "Sahih Muslim",
      "translations": {
        "en": "We have entered a new day and with it all sovereignty belongs to Allah, and all praise is for Allah. There is no god but Allah, alone, without partner. To Him belongs all sovereignty and all praise, and He is over all things competent. My Lord, I ask You for the good of this day and the good of what comes after it, and I seek refuge in You from the evil of this day and the evil of what comes after it. My Lord, I seek refuge in You from laziness and the evil of old age. My Lord, I seek refuge in You from a torment in the Fire and a torment in the grave.",
        "ar": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
        "id": "Kami telah memasuki waktu pagi dan seluruh kerajaan adalah milik Allah, segala puji bagi Allah. Tidak ada Tuhan yang berhak disembah kecuali Allah semata, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian, dan Dia Mahakuasa atas segala sesuatu. Ya Rabbku, aku memohon kepada-Mu kebaikan hari ini dan kebaikan sesudahnya, dan aku berlindung kepada-Mu dari keburukan hari ini dan keburukan sesudahnya. Ya Rabbku, aku berlindung kepada-Mu dari kemalasan dan keburukan usia tua. Ya Rabbku, aku berlindung kepada-Mu dari azab neraka dan azab kubur.",
        "ur": "ہم نے صبح کی اور اللہ کے لیے تمام بادشاہت ہے اور تمام تعریفیں اللہ کے لیے ہیں۔ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اسی کا ہے بادشاہت اور اسی کا ہے حمد، اور وہ ہر چیز پر قادر ہے۔ اے میرے رب، میں تجھ سے اس دن کی بھلائی اور اس کے بعد کی بھلائی کا سوال کرتا ہوں، اور میں تیری پناہ مانگتا ہوں اس دن کی برائی اور اس کے بعد کی برائی سے۔ اے میرے رب، میں تیری پناہ مانگتا ہوں سستی اور بڑھاپے کی برائی سے۔ اے میرے رب، میں تیری پناہ مانگتا ہوں آگ کے عذاب سے اور قبر کے عذاب سے۔",
        "tr": "Sabaha ulaştık ve mülk Allah'ındır, hamd Allah'adır. Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'nadır ve O her şeye kadirdir. Rabbim, bu günün hayrını ve ondan sonrasının hayrını senden isterim. Bu günün şerrinden ve ondan sonrasının şerrinden sana sığınırım. Rabbim, tembellikten ve ihtiyarlığın kötülüğünden sana sığınırım. Rabbim, cehennem azabından ve kabir azabından sana sığınırım.",
        "fr": "Nous avons atteint le matin, et le royaume appartient à Allah, et la louange est à Allah. Il n'y a de dieu qu'Allah, seul, sans associé. À Lui la royauté et à Lui la louange, et Il est capable de toute chose. Ô mon Seigneur, je Te demande le bien de ce jour et le bien de ce qui vient après, et je cherche refuge auprès de Toi contre le mal de ce jour et le mal de ce qui vient après. Ô mon Seigneur, je cherche refuge auprès de Toi contre la paresse et le mal de la vieillesse. Ô mon Seigneur, je cherche refuge auprès de Toi contre un châtiment dans le Feu et un châtiment dans la tombe.",
        "ru": "Мы встретили утро, и все царство принадлежит Аллаху, и вся хвала Аллаху. Нет божества, кроме Аллаха, Одного, нет у Него сотоварища. Ему принадлежит владычество и Ему хвала, и Он над всякой вещью мощен. Господи, я прошу у Тебя блага этого дня и блага того, что после него, и прибегаю к Тебе от зла этого дня и зла того, что после него. Господи, я прибегаю к Тебе от лени и от зла старости. Господи, я прибегаю к Тебе от мучений в Огне и мучений в могиле.",
        "fa": "صبح کردیم و پادشاهی از آن خداست و ستایش از آن خداست. معبودی جز الله نیست، یکتاست، شریکی برای او نیست. پادشاهی و ستایش از آن اوست و او بر هر چیزی تواناست. پروردگارا، از تو خیر این روز و خیر پس از آن را می‌خواهم، و به تو پناه می‌برم از شر این روز و شر پس از آن. پروردگارا، به تو پناه می‌برم از کسالت و بدی پیری. پروردگارا، به تو پناه می‌برم از عذاب در آتش و عذاب در قبر.",
        "hi": "हमने सुबह की और अल्लाह के लिए तमाम बादशाहत है और तमाम तारीफें अल्लाह के लिए हैं। अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई शरीक नहीं। उसी का है बादशाहत और उसी का है हम्द, और वह हर चीज़ पर कादिर है। ऐ मेरे रब, मैं तुझसे इस दिन की भलाई और उसके बाद की भलाई का सवाल करता हूं, और मैं तेरी पनाह मांगता हूं इस दिन की बुराई और उसके बाद की बुराई से। ऐ मेरे रब, मैं तेरी पनाह मांगता हूं सुस्ती और बुढ़ापे की बुराई से। ऐ मेरे रब, मैं तेरी पनाह मांगता हूं आग के अज़ाब से और क़ब्र के अज़ाब से।",
        "ms": "Kami telah memasuki waktu pagi dan segala kekuasaan milik Allah dan segala puji bagi Allah. Tiada Tuhan yang berhak disembah melainkan Allah yang Esa, tiada sekutu bagi-Nya. Bagi-Nya kekuasaan dan bagi-Nya pujian, dan Dia Maha Berkuasa atas segala sesuatu. Wahai Tuhanku, aku memohon kepada-Mu kebaikan pada hari ini dan kebaikan sesudahnya, dan aku berlindung kepada-Mu dari kejahatan pada hari ini dan kejahatan sesudahnya. Wahai Tuhanku, aku berlindung kepada-Mu dari kemalasan dan keburukan usia tua. Wahai Tuhanku, aku berlindung kepada-Mu dari azab neraka dan azab kubur.",
        "sw": "Tumeingia asubuhi na ufalme wote ni wa Allah, na sifa zote ni za Allah. Hakuna mungu ila Allah, peke Yake, hana mshirika. Ni Wake ufalme na ni Zake sifa zote, na Yeye ni Muweza juu ya kila kitu. Ee Mola wangu, nakuomba wema wa siku hii na wema wa yatakayokuja baada yake, na najikinga Kwako kutokana na shari ya siku hii na shari ya yatakayokuja baada yake. Ee Mola wangu, najikinga Kwako kutokana na uvivu na ubaya wa uzee. Ee Mola wangu, najikinga Kwako kutokana na adhabu ya Moto na adhabu ya kaburini.",
        "bn": "আমরা সকালে উপনীত হয়েছি এবং আল্লাহর জন্যই সমস্ত রাজত্ব, আর সমস্ত প্রশংসা আল্লাহরই। আল্লাহ ব্যতীত কোন ইলাহ নেই, তিনি এক ও শরীকবিহীন। তাঁরই রাজত্ব এবং তাঁরই সকল প্রশংসা; আর তিনি সব কিছুর উপর ক্ষমতাবান। হে আমার রব, আমি আপনার কাছে এই দিনের কল্যাণ এবং এর পরের কল্যাণ কামনা করি; আর আমি আপনার কাছে এই দিনের অকল্যাণ এবং এর পরের অকল্যাণ থেকে আশ্রয় প্রার্থনা করি। হে আমার রব, আমি আপনার কাছে অলসতা ও বার্ধক্যের মন্দ অবস্থা থেকে আশ্রয় প্রার্থনা করি। হে আমার রব, আমি আপনার কাছে জাহান্নামের আযাব ও কবরের আযাব থেকে আশ্রয় প্রার্থনা করি।"
      }
    },
    {
      "id": "morning_007",
      "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
      "transliteration": "Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namutu, wa ilaykan-nushur.",
      "repeat": 1,
      "source": "Jami At-Tirmidhi",
      "translations": {
        "en": "O Allah, by You we enter the morning, and by You we enter the evening, and by You we live, and by You we die, and to You is the resurrection.",
        "ar": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
        "id": "Ya Allah, dengan rahmat dan pertolongan-Mu kami memasuki waktu pagi, dan dengan rahmat dan pertolongan-Mu kami memasuki waktu sore, dengan rahmat-Mu kami hidup, dan dengan kehendak-Mu kami mati, dan kepada-Mu tempat kembali (pada hari kebangkitan).",
        "ur": "اے اللہ، تیری وجہ سے ہم نے صبح کی، اور تیری وجہ سے ہم نے شام کی، اور تیری وجہ سے ہم زندہ رہتے ہیں، اور تیری وجہ سے ہم مرتے ہیں، اور تیری ہی طرف دوبارہ جی اٹھنا ہے۔",
        "tr": "Allah'ım! Senin yardımınla sabaha çıktık, senin yardımınla akşama girdik. Senin yardımınla yaşar, senin yardımınla ölürüz ve dönüş sanadır.",
        "fr": "Ô Allah! C'est par Toi que nous atteignons le matin, et par Toi que nous atteignons le soir. C'est par Toi que nous vivons, et c'est par Toi que nous mourons, et c'est vers Toi que se fait la résurrection.",
        "ru": "О Аллах, благодаря Тебе мы дожили до утра, и благодаря Тебе мы дожили до вечера, и благодаря Тебе мы живем, и благодаря Тебе мы умираем, и к Тебе воскресение.",
        "fa": "پروردگارا، به یاری تو صبح کردیم و به یاری تو شب کردیم و به یاری تو زندگی می‌کنیم و به یاری تو می‌میریم و به سوی تو بازگشت است.",
        "hi": "ऐ अल्लाह, तेरी वजह से हमने सुबह की, और तेरी वजह से हमने शाम की, और तेरी वजह से हम ज़िंदा रहते हैं, और तेरी वजह से हम मरते हैं, और तेरी ही तरफ़ दोबारा जी उठना है।",
        "ms": "Ya Allah, dengan rahmat dan pertolongan-Mu kami memasuki waktu pagi, dan dengan rahmat dan pertolongan-Mu kami memasuki waktu petang, dengan rahmat-Mu kami hidup, dan dengan kehendak-Mu kami mati, dan kepada-Mu tempat kembali (pada hari kebangkitan).",
        "sw": "Ewe Allah, kwa fadhila zako tumefika asubuhi, na kwa fadhila zako tumefika jioni, na kwa fadhila zako tunaishi, na kwa fadhila zako tunakufa, na Kwako ni Kufufuliwa.",
        "bn": "হে আল্লাহ! আপনারই ইচ্ছায় আমরা সকালে উপনীত হয়েছি, আপনারই ইচ্ছায় আমরা সন্ধ্যায় উপনীত হয়েছি, আপনারই ইচ্ছায় আমরা জীবন ধারণ করি এবং আপনারই ইচ্ছায় আমরা মৃত্যুবরণ করি; আর আপনারই দিকে পুনরুত্থান।"
      }
    },
    {
      "id": "morning_008",
      "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "transliteration": "Allahumma anta Rabbi la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, aboo'u laka bi ni'matika 'alayya, wa aboo'u bi dhanbi faghfir li fa innahu la yaghfirudh-dhunuba illa anta.",
      "repeat": 1,
      "source": "Sahih Al-Bukhari",
      "translations": {
        "en": "O Allah, You are my Lord, there is no god but You. You created me and I am Your servant, and I am abiding by Your covenant and Your promise as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your blessings upon me, and I acknowledge my sins, so forgive me, for none forgives sins except You.",
        "ar": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
        "id": "Ya Allah, Engkau adalah Rabbku, tidak ada Tuhan yang berhak disembah kecuali Engkau. Engkau telah menciptakan aku dan aku adalah hamba-Mu. Aku akan setia pada perjanjian-Mu dan janji-Mu semampuku. Aku berlindung kepada-Mu dari keburukan perbuatan (dosa)ku. Aku mengakui nikmat-Mu atasku dan aku mengakui dosa-dosaku, maka ampunilah aku, karena sesungguhnya tidak ada yang mengampuni dosa-dosa kecuali Engkau.",
        "ur": "اے اللہ، تو میرا رب ہے، تیرے سوا کوئی معبود نہیں، تو نے مجھے پیدا کیا اور میں تیرا بندہ ہوں، اور میں اپنی طاقت کے مطابق تیرے عہد اور تیرے وعدے پر قائم ہوں۔ میں تیری پناہ مانگتا ہوں اس برائی سے جو میں نے کی ہے۔ میں تیرے احسانات کو تسلیم کرتا ہوں جو تو نے مجھ پر کیے، اور میں اپنے گناہوں کا اعتراف کرتا ہوں، پس مجھے بخش دے، کیونکہ تیرے سوا کوئی گناہوں کو نہیں بخشتا۔",
        "tr": "Allah'ım! Sen benim Rabbimsin. Senden başka ilah yoktur. Beni sen yarattın. Ben senin kulunum. Gücüm yettiğince sana verdiğim ahde ve va'de sadığım. Yaptıklarımın şerrinden sana sığınırım. Bana verdiğin nimetini itiraf ederim. Günahımı itiraf ederim. Beni bağışla. Şüphesiz günahları senden başkası bağışlamaz.",
        "fr": "Ô Allah! Tu es mon Seigneur, il n'y a de dieu que Toi. Tu m'as créé et je suis Ton serviteur. Je me conforme à Ton engagement et à Ta promesse autant que je le peux. Je cherche refuge auprès de Toi contre le mal de ce que j'ai fait. Je reconnais Ton bienfait sur moi, et je reconnais mon péché. Pardonne-moi, car personne ne pardonne les péchés sauf Toi.",
        "ru": "О Аллах, Ты — мой Господь, нет божества, кроме Тебя. Ты сотворил меня, и я — Твой раб, и я придерживаюсь Твоего завета и обещания, насколько могу. Я прибегаю к Тебе от зла того, что я совершил. Я признаю Твои милости ко мне и признаю свои грехи. Прости же меня, ибо никто не прощает грехов, кроме Тебя.",
        "fa": "پروردگارا، تو پروردگار منی، معبودی جز تو نیست. مرا آفریدی و من بنده تو هستم، و من بر عهد و پیمان تو هستم تا آنجا که توان دارم. به تو پناه می‌برم از شر آنچه انجام داده‌ام. نعمت تو را بر خود اعتراف می‌کنم، و به گناهم اعتراف می‌کنم، پس مرا ببخش، زیرا هیچ کس گناهان را جز تو نمی‌بخشد.",
        "hi": "ऐ अल्लाह, तू मेरा रब है, तेरे सिवा कोई माबूद नहीं, तूने मुझे पैदा किया और मैं तेरा बंदा हूं, और मैं अपनी ताक़त के मुताबिक़ तेरे अहद और तेरे वादे पर क़ाइम हूं। मैं तेरी पनाह मांगता हूं उस बुराई से जो मैंने की है। मैं तेरे एहसानात को तसलीम करता हूं जो तूने मुझ पर किए हैं, और मैं अपने गुनाहों का इक़रार करता हूं, पस मुझे बख्श दे, क्यूंकि तेरे सिवा कोई गुनाहों को नहीं बख्शता।",
        "ms": "Ya Allah, Engkau adalah Tuhanku, tiada Tuhan yang berhak disembah melainkan Engkau. Engkau menciptakanku dan aku adalah hamba-Mu. Aku akan setia pada perjanjian-Mu dan janji-Mu semampuku. Aku berlindung kepada-Mu dari keburukan perbuatanku. Aku mengakui nikmat-Mu atasku dan aku mengakui dosa-dosaku, maka ampunilah aku, kerana sesungguhnya tidak ada yang mengampuni dosa-dosa kecuali Engkau.",
        "sw": "Ewe Allah, Wewe ni Mola wangu, hapana mungu ila Wewe. Umeniumba mimi na mimi ni mtumwa wako, nami niko juu ya ahadi yako na ahadi yako kadiri ya uwezo wangu. Najikinga kwako kutokana na shari ya yale niliyoyatenda. Nakiri neema zako juu yangu, na nakiri dhambi zangu, basi nisamehe, kwani hakuna anayesamehe dhambi ila Wewe.",
        "bn": "হে আল্লাহ! আপনি আমার রব, আপনি ছাড়া কোন উপাস্য নেই। আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার বান্দা। আমি আপনার অঙ্গীকার ও প্রতিশ্রুতির উপর সাধ্যমত অটল আছি। আমি যা করেছি তার অনিষ্ট থেকে আপনার কাছে আশ্রয় প্রার্থনা করি। আমার উপর আপনার নেয়ামত স্বীকার করছি এবং আমার গুনাহ স্বীকার করছি, অতএব আমাকে ক্ষমা করুন, কারণ আপনি ছাড়া আর কেউ গুনাহ ক্ষমা করতে পারে না।"
      }
    },
    {
      "id": "morning_009",
      "arabic": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
      "transliteration": "Allahumma inni asbahtu ush-hiduka wa ush-hidu hamalata 'arshika, wa mala'ikataka, wa jamee'a khalqika, annaka antal-lahu la ilaha illa anta wahdaka la shareeka laka, wa anna Muhammadan 'abduka wa rasooluk.",
      "repeat": 4,
      "source": "Sunan Abi Dawud",
      "translations": {
        "en": "O Allah, verily I have entered the morning and call You, and the bearers of Your Throne, and Your angels, and all Your creation to witness that You are Allah, there is no god but You, Alone, without partner, and that Muhammad is Your slave and Your Messenger.",
        "ar": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
        "id": "Ya Allah, sesungguhnya aku memasuki waktu pagi dan aku mempersaksikan Engkau, dan para pemikul Arsy-Mu, dan para malaikat-Mu, serta seluruh makhluk-Mu, bahwa Engkau adalah Allah, tidak ada Tuhan yang berhak disembah kecuali Engkau semata, tiada sekutu bagi-Mu, dan bahwa Muhammad adalah hamba-Mu dan Rasul-Mu.",
        "ur": "اے اللہ، میں نے صبح کی اور میں تجھے، اور تیرے عرش کے اٹھانے والوں کو، اور تیرے فرشتوں کو، اور تیری تمام مخلوق کو گواہ بناتا ہوں کہ تو اللہ ہے، تیرے سوا کوئی معبود نہیں، تو اکیلا ہے، تیرا کوئی شریک نہیں، اور محمد تیرا بندہ اور تیرا رسول ہے۔",
        "tr": "Allah'ım! Şüphesiz ben sabaha eriştim. Seni şahit tutarım, Arşının taşıyıcılarını, meleklerini ve bütün yarattıklarını da şahit tutarım ki, Sen Allah'sın, Senden başka ilah yoktur, birsin ve ortağın yoktur. Muhammed de senin kulun ve elçindir.",
        "fr": "Ô Allah, en vérité, je suis entré dans le matin et je Te prends à témoin, ainsi que les porteurs de Ton Trône, et Tes anges, et toutes Tes créatures, que Tu es Allah, il n'y a de dieu que Toi, Seul, sans associé, et que Muhammad est Ton serviteur et Ton Messager.",
        "ru": "О Аллах, поистине, я встретил утро и призываю Тебя в свидетели, и призываю в свидетели носителей Твоего Трона, и Твоих ангелов, и все Твои творения, что Ты — Аллах, нет божества, кроме Тебя, Одного, нет у Тебя сотоварища, и что Мухаммад — Твой раб и Твой Посланник.",
        "fa": "پروردگارا، من صبح کردم و تو را و حاملان عرشت را، و فرشتگانت را، و تمامی آفریدگانت را گواه می‌گیرم که تو الله هستی، معبودی جز تو نیست، یگانه هستی، شریکی برایت نیست، و اینکه محمد بنده و فرستاده توست.",
        "hi": "ऐ अल्लाह, मैं सुबह में दाखिल हुआ और मैं तुझको गवाह बनाता हूं, और तेरे अर्श के उठाने वालों को, और तेरे फरिश्तों को, और तेरी तमाम मखलूक़ को गवाह बनाता हूं कि तू अल्लाह है, तेरे सिवा कोई माबूद नहीं, तू अकेला है, तेरा कोई शरीक नहीं, और मोहम्मद तेरा बंदा और तेरा रसूल है।",
        "ms": "Ya Allah, sesungguhnya aku telah memasuki waktu pagi dan aku mempersaksikan Engkau, dan para pemikul Arasy-Mu, dan para malaikat-Mu, serta seluruh makhluk-Mu, bahawa Engkau adalah Allah, tidak ada Tuhan yang berhak disembah kecuali Engkau semata, tiada sekutu bagi-Mu, dan bahawa Muhammad adalah hamba-Mu dan Rasul-Mu.",
        "sw": "Ewe Allah, hakika mimi nimefika asubuhi na ninakushuhudisha Wewe, na ninawashuhudisha wenye kubeba Arshi Yako, na Malaika Wako, na viumbe vyako vyote, kwamba Wewe ni Allah, hapana mungu ila Wewe, Peke Yako, huna mshirika, na kwamba Muhammad ni Mja Wako na Mtume Wako.",
        "bn": "হে আল্লাহ! আমি সকালে উপনীত হয়েছি, আর আমি আপনাকে সাক্ষী রাখছি, আপনার আরশের বাহকদের, আপনার ফেরেশতাদের এবং আপনার সকল সৃষ্টিকে সাক্ষী রাখছি যে, আপনিই আল্লাহ, আপনি ছাড়া কোন উপাস্য নেই, আপনি এক ও শরীকবিহীন। আর মুহাম্মাদ আপনার বান্দা ও রাসূল।"
      }
    },
    {
      "id": "morning_010",
      "arabic": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
      "transliteration": "Allahumma ma asbaha bi min ni'matin aw bi ahadin min khalqika fa minka wahdaka la shareeka laka, falakal-hamdu wa lakash-shukr.",
      "repeat": 1,
      "source": "Sunan Abi Dawud",
      "translations": {
        "en": "O Allah, whatever blessing has come to me or to any of Your creation in the morning, it is from You Alone, You have no partner. So to You be all praise and to You be all thanks.",
        "ar": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
        "id": "Ya Allah, nikmat apa saja yang ada padaku di waktu pagi atau pada salah seorang dari makhluk-Mu, maka itu semua dari-Mu semata, tiada sekutu bagi-Mu. Maka bagi-Mu segala puji dan bagi-Mu segala syukur.",
        "ur": "اے اللہ، جو بھی نعمت مجھے یا تیری مخلوق میں سے کسی کو صبح کے وقت ملی ہے، وہ تیری طرف سے ہے، تو اکیلا ہے، تیرا کوئی شریک نہیں۔ پس تمام تعریف تیرے لیے ہے اور تمام شکر تیرے لیے ہے۔",
        "tr": "Allah'ım! Benimle veya yaratıklarından herhangi biriyle sabaha ulaşan her nimet yalnızca Sendendir. Senin ortağın yoktur. Hamd da sanadır, şükür de sanadır.",
        "fr": "Ô Allah! Toute grâce dont je jouis ce matin ou dont jouit une de Tes créatures, provient de Toi seul, sans associé. À Toi la louange et à Toi le remerciement.",
        "ru": "О Аллах, все милости, что я получил этим утром или получил кто-либо из Твоих творений, — от Тебя одного, нет у Тебя сотоварища. Тебе вся хвала и Тебе вся благодарность.",
        "fa": "پروردگارا، هر نعمتی که در این صبح به من یا به هر یک از آفریدگان تو رسیده است، از جانب توست، یگانه هستی، شریکی برایت نیست. پس ستایش و شکر از آن توست.",
        "hi": "ऐ अल्लाह, जो भी नेमत मुझे या तेरी मखलूक़ में से किसी को सुबह के वक़्त मिली है, वह तेरी तरफ़ से है, तू अकेला है, तेरा कोई शरीक नहीं। पस तमाम तारीफ तेरे लिए है और तमाम शुक्र तेरे लिए है।",
        "ms": "Ya Allah, apa jua nikmat yang ada padaku di waktu pagi atau pada mana-mana makhluk-Mu, maka itu adalah dari-Mu semata, Engkau tiada sekutu. Maka bagi-Mu segala pujian dan bagi-Mu segala syukur.",
        "sw": "Ewe Allah, neema yoyote iliyonipata asubuhi au yeyote katika viumbe vyako, basi ni kutoka Kwako peke Yako, huna mshirika. Basi Sifa zote ni zako na Shukrani zote ni zako.",
        "bn": "হে আল্লাহ! আমার বা আপনার সৃষ্টিকুলের কারো কাছে সকালে যে কোনো নিয়ামত পৌঁছেছে তা শুধু আপনার পক্ষ থেকে। আপনার কোন শরীক নেই। সুতরাং সকল প্রশংসা আপনার এবং সকল কৃতজ্ঞতা আপনার।"
      }
    },
    {
      "id": "morning_011",
      "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ",
      "transliteration": "Allahumma 'afini fi badani, Allahumma 'afini fi sam'i, Allahumma 'afini fi basari, la ilaha illa anta. Allahumma inni a'udhu bika minal-kufri wal-faqri, wa a'udhu bika min 'adhabin-qabri, la ilaha illa anta.",
      "repeat": 3,
      "source": "Sunan Abi Dawud",
      "translations": {
        "en": "O Allah, make me healthy in my body. O Allah, make me healthy in my hearing. O Allah, make me healthy in my sight. There is no god but You. O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the torment of the grave. There is no god but You.",
        "ar": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ",
        "id": "Ya Allah, sehatkanlah badanku. Ya Allah, sehatkanlah pendengaranku. Ya Allah, sehatkanlah penglihatanku. Tidak ada Tuhan yang berhak disembah kecuali Engkau. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kekufuran dan kemiskinan, dan aku berlindung kepada-Mu dari azab kubur. Tidak ada Tuhan yang berhak disembah kecuali Engkau.",
        "ur": "اے اللہ، میرے بدن میں عافیت دے، اے اللہ، میری سماعت میں عافیت دے، اے اللہ، میری بصارت میں عافیت دے، تیرے سوا کوئی معبود نہیں۔ اے اللہ، میں تجھ سے کفر اور فقر سے پناہ مانگتا ہوں، اور میں تجھ سے قبر کے عذاب سے پناہ مانگتا ہوں، تیرے سوا کوئی معبود نہیں۔",
        "tr": "Allah'ım! Bedenime afiyet ver. Allah'ım! Kulağıma afiyet ver. Allah'ım! Gözüme afiyet ver. Senden başka ilah yoktur. Allah'ım! Küfürden ve fakirlikten sana sığınırım. Kabir azabından sana sığınırım. Senden başka ilah yoktur.",
        "fr": "Ô Allah! Accorde-moi la santé dans mon corps. Ô Allah! Accorde-moi la santé dans mon ouïe. Ô Allah! Accorde-moi la santé dans ma vue. Il n'y a de dieu que Toi. Ô Allah! Je cherche refuge auprès de Toi contre l'incroyance et la pauvreté, et je cherche refuge auprès de Toi contre le châtiment de la tombe. Il n'y a de dieu que Toi.",
        "ru": "О Аллах, даруй мне здоровье в моем теле. О Аллах, даруй мне здоровье в моем слухе. О Аллах, даруй мне здоровье в моем зрении. Нет божества, кроме Тебя. О Аллах, поистине, я прибегаю к Тебе от неверия и бедности, и прибегаю к Тебе от мучений могилы. Нет божества, кроме Тебя.",
        "fa": "پروردگارا، در بدنم عافیت ده. پروردگارا، در شنوایی‌ام عافیت ده. پروردگارا، در بینایی‌ام عافیت ده. معبودی جز تو نیست. پروردگارا، به تو پناه می‌برم از کفر و فقر، و به تو پناه می‌برم از عذاب قبر. معبودی جز تو نیست.",
        "hi": "ऐ अल्लाह, मेरे बदन में आफ़ियत दे। ऐ अल्लाह, मेरी समाअत में आफ़ियत दे। ऐ अल्लाह, मेरी बसारत में आफ़ियत दे। तेरे सिवा कोई माबूद नहीं। ऐ अल्लाह, मैं तुझसे कुफ़्र और फ़क़्र से पनाह मांगता हूं, और मैं तुझसे क़ब्र के अज़ाब से पनाह मांगता हूं। तेरे सिवा कोई माबूद नहीं।",
        "ms": "Ya Allah, sihatkanlah badanku. Ya Allah, sihatkanlah pendengaranku. Ya Allah, sihatkanlah penglihatanku. Tiada Tuhan yang berhak disembah melainkan Engkau. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kekufuran dan kefakiran, dan aku berlindung kepada-Mu dari azab kubur. Tiada Tuhan yang berhak disembah melainkan Engkau.",
        "sw": "Ewe Allah, nipe afya katika mwili wangu. Ewe Allah, nipe afya katika usikivu wangu. Ewe Allah, nipe afya katika uoni wangu. Hapana mungu ila Wewe. Ewe Allah, najikinga kwako kutokana na ukafiri na ufukara, na najikinga kwako kutokana na adhabu ya kaburi. Hapana mungu ila Wewe.",
        "bn": "হে আল্লাহ! আমার দেহকে সুস্থ রাখুন। হে আল্লাহ! আমার শ্রবণশক্তিকে সুস্থ রাখুন। হে আল্লাহ! আমার দৃষ্টিশক্তিকে সুস্থ রাখুন। আপনি ছাড়া কোন উপাস্য নেই। হে আল্লাহ! আমি আপনার কাছে কুফরি ও দারিদ্র্য থেকে আশ্রয় প্রার্থনা করি। আর আমি আপনার কাছে কবরের আযাব থেকে আশ্রয় প্রার্থনা করি। আপনি ছাড়া কোন উপাস্য নেই।"
      }
    },
    {
      "id": "morning_012",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
      "transliteration": "Allahumma inni as'alukal-'afwa wal-'afiyah fid-dunya wal-akhirah. Allahumma inni as'alukal-'afwa wal-'afiyah fi deeni wa dunyaya wa ahli wa mali. Allahummas-tur 'awrati wa amin raw'ati. Allahummah-fadhni min bayni yadayya wa min khalfi wa 'an yameeni wa 'an shimali wa min fawqi, wa a'udhu bi'adhamatika an ughtala min tahti.",
      "repeat": 1,
      "source": "Sunan Abi Dawud",
      "translations": {
        "en": "O Allah, I ask You for pardon and well-being in this world and the Hereafter. O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, conceal my faults and calm my fears. O Allah, protect me from before me, and from behind me, and on my right, and on my left, and from above me, and I seek refuge in Your greatness from being unexpectedly seized from below me.",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
        "id": "Ya Allah, sesungguhnya aku memohon kepada-Mu ampunan dan kesehatan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu ampunan dan kesehatan dalam agamaku, duniaku, keluargaku, dan hartaku. Ya Allah, tutuplah auratku dan amankanlah ketakutanku. Ya Allah, jagalah aku dari arah depanku, dari belakangku, dari kananku, dari kiriku, dan dari atasku, dan aku berlindung dengan keagungan-Mu dari diserang dari bawahku.",
        "ur": "اے اللہ، میں تجھ سے دنیا اور آخرت میں معافی اور عافیت کا سوال کرتا ہوں۔ اے اللہ، میں تجھ سے اپنے دین، دنیا، اہل و مال میں معافی اور عافیت کا سوال کرتا ہوں۔ اے اللہ، میری عیبوں کو چھپا دے اور میری گھبراہٹوں کو امن میں بدل دے۔ اے اللہ، مجھے میرے آگے سے، اور میرے پیچھے سے، اور میرے دائیں سے، اور میرے بائیں سے، اور میرے اوپر سے محفوظ رکھ، اور میں تیری عظمت کی پناہ مانگتا ہوں کہ مجھے میرے نیچے سے اچانک پکڑ لیا جائے۔",
        "tr": "Allah'ım! Dünya ve ahirette senden af ve afiyet dilerim. Allah'ım! Dinimde, dünyamda, ailemde ve malımda af ve afiyet dilerim. Allah'ım! Kusurlarımı ört ve korkularımı gider. Allah'ım! Beni önümden, arkamdan, sağımdan, solumdan ve üstümden koru. Altımdan ansızın yakalanmaktan senin büyüklüğüne sığınırım.",
        "fr": "Ô Allah, je Te demande le pardon et le bien-être dans ce monde et dans l'au-delà. Ô Allah, je Te demande le pardon et le bien-être dans ma religion, ma vie d'ici-bas, ma famille et mes biens. Ô Allah, couvre mes défauts et apaise mes peurs. Ô Allah, protège-moi de devant moi, et de derrière moi, et de ma droite, et de ma gauche, et d'en haut, et je cherche refuge auprès de Ta grandeur de me faire assassiner par en bas.",
        "ru": "О Аллах, поистине, я прошу у Тебя прощения и благополучия в этом мире и в мире ином. О Аллах, поистине, я прошу у Тебя прощения и благополучия в моей религии, в моей мирской жизни, в моей семье и в моем имуществе. О Аллах, укрой мои недостатки и успокой мои страхи. О Аллах, защити меня спереди, и сзади, и справа, и слева, и сверху, и я прибегаю к Твоему величию от того, чтобы быть убитым снизу.",
        "fa": "پروردگارا، از تو عفو و عافیت در دنیا و آخرت را می‌خواهم. پروردگارا، از تو عفو و عافیت در دینم، دنیایم، خانواده‌ام و مالم را می‌خواهم. پروردگارا، عیب‌هایم را بپوشان و ترس‌هایم را آرام کن. پروردگارا، مرا از پیش رویم، و از پشتم، و از راستم، و از چپم، و از بالام محافظت فرما، و به عظمت تو پناه می‌برم از اینکه از زیرم غافلگیر شوم.",
        "hi": "ऐ अल्लाह, मैं तुझसे दुनिया और आख़िरत में माफ़ी और आफ़ियत का सवाल करता हूं। ऐ अल्लाह, मैं तुझसे अपने दीन, दुनिया, अह्ल व माल में माफ़ी और आफ़ियत का सवाल करता हूं। ऐ अल्लाह, मेरी ऐबों को छुपा दे और मेरी घबराहटों को अमन में बदल दे। ऐ अल्लाह, मुझे मेरे आगे से, और मेरे पीछे से, और मेरे दाएं से, और मेरे बाएं से, और मेरे ऊपर से महफ़ूज़ रख, और मैं तेरी अज़मत की पनाह मांगता हूं कि मुझे मेरे नीचे से अचानक पकड़ लिया जाए।",
        "ms": "Ya Allah, sesungguhnya aku memohon kepada-Mu keampunan dan kesejahteraan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu keampunan dan kesejahteraan dalam agamaku, duniaku, keluargaku, dan hartaku. Ya Allah, tutuplah keaibanku dan amankanlah ketakutanku. Ya Allah, peliharalah aku dari hadapanku, dari belakangku, dari kananku, dari kiriku, dan dari atasku, dan aku berlindung dengan keagungan-Mu dari diserang dari bawahku.",
        "sw": "Ewe Allah, hakika mimi nakuomba msamaha na afya duniani na Akhera. Ewe Allah, hakika mimi nakuomba msamaha na afya katika dini yangu, na dunia yangu, na familia yangu, na mali yangu. Ewe Allah, sitiri aibu zangu na nitulize khofu zangu. Ewe Allah, nihifadhi mbele yangu, na nyuma yangu, na upande wangu wa kulia, na upande wangu wa kushoto, na juu yangu, na najikinga kwa Ukuu wako nisinyakuliwe kutoka chini yangu.",
        "bn": "হে আল্লাহ! আমি আপনার কাছে দুনিয়া ও আখিরাতে ক্ষমা ও নিরাপত্তা চাই। হে আল্লাহ! আমি আপনার কাছে আমার দ্বীন, দুনিয়া, পরিবার ও সম্পদে ক্ষমা ও নিরাপত্তা চাই। হে আল্লাহ! আমার ত্রুটিগুলো ঢেকে দিন এবং আমার ভয়-ভীতি দূর করে দিন। হে আল্লাহ! আমাকে আমার সম্মুখ হতে, আমার পেছন হতে, আমার ডান দিক হতে, আমার বাম দিক হতে এবং আমার উপর দিক হতে রক্ষা করুন। আর আমি আপনার মহত্ত্বের আশ্রয় প্রার্থনা করি, যেন আমাকে আমার নিচ দিক হতে আকস্মিকভাবে ধরা না হয়।"
      }
    },
    {
      "id": "morning_013",
      "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
      "transliteration": "Allahumma 'Alimal-ghaybi wash-shahadati Fatiras-samawati wal-ardhi Rabba kulli shai'in wa maleekahu, ash-hadu an la ilaha illa anta, a'udhu bika min sharri nafsi wa min sharrish-shaytani wa shirkihi, wa an aqtarifa 'ala nafsi soo'an aw ajurrahu ila Muslimin.",
      "repeat": 1,
      "source": "Jami At-Tirmidhi",
      "translations": {
        "en": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of everything, I bear witness that there is no god but You. I seek refuge in You from the evil of my soul and from the evil of Satan and his polytheism, and from committing any evil against myself or bringing it upon a Muslim.",
        "ar": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
        "id": "Ya Allah, Yang Maha Mengetahui yang gaib dan yang tampak, Pencipta langit dan bumi, Rabb dan Penguasa segala sesuatu. Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Engkau. Aku berlindung kepada-Mu dari keburukan diriku dan dari keburukan setan dan kesyirikannya, dan (aku berlindung dari) berbuat keburukan terhadap diriku atau menyeretnya kepada seorang muslim.",
        "ur": "اے اللہ، غائب اور حاضر کے جاننے والے، آسمانوں اور زمین کے پیدا کرنے والے، ہر چیز کے رب اور بادشاہ، میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں۔ میں تیری پناہ مانگتا ہوں اپنے نفس کے شر سے اور شیطان کے شر اور اس کے شرک سے، اور اس سے کہ میں اپنے نفس پر کوئی برائی کروں یا اسے کسی مسلمان کی طرف کھینچوں۔",
        "tr": "Allah'ım! Gaybı ve görüneni bilen, gökleri ve yeri yaratan, her şeyin Rabbi ve maliki! Senden başka ilah olmadığına şehadet ederim. Nefsimin şerrinden, şeytanın şerrinden ve şirkinden sana sığınırım. Kendime bir kötülük yapmaktan veya bir Müslümana kötülük bulaştırmaktan da sana sığınırım.",
        "fr": "Ô Allah, Toi qui connais l'invisible et le visible, Créateur des cieux et de la terre, Seigneur et Souverain de toute chose, j'atteste qu'il n'y a de dieu que Toi. Je cherche refuge auprès de Toi contre le mal de mon âme et contre le mal de Satan et de son polythéisme, et de commettre un mal envers moi-même ou de l'attirer sur un musulman.",
        "ru": "О Аллах, Знающий сокровенное и явное, Создатель небес и земли, Господь и Владыка всего сущего, я свидетельствую, что нет божества, кроме Тебя. Я прибегаю к Тебе от зла моей души и от зла сатаны и его ширка, и от того, чтобы я причинил зло самому себе или причинил его мусульманину.",
        "fa": "پروردگارا، دانای نهان و آشکار، آفریننده آسمان‌ها و زمین، پروردگار و پادشاه هر چیز، گواهی می‌دهم که معبودی جز تو نیست. به تو پناه می‌برم از شر نفسم و از شر شیطان و شرکش، و از اینکه بر خودم بدی‌ای وارد کنم یا آن را به مسلمانی برسانم.",
        "hi": "ऐ अल्लाह, ग़ायब और हाज़िर के जानने वाले, आसमानों और ज़मीन के पैदा करने वाले, हर चीज़ के रब और बादशाह, मैं गवाही देता हूं कि तेरे सिवा कोई माबूद नहीं। मैं तेरी पनाह मांगता हूं अपने नफ़्स के शर से और शैतान के शर और उसके शिर्क से, और इससे कि मैं अपने नफ़्स पर कोई बुराई करूं या उसे किसी मुसलमान की तरफ़ खींचूं।",
        "ms": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata, Pencipta langit dan bumi, Tuhan dan Pemilik segala sesuatu. Aku bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Engkau. Aku berlindung kepada-Mu dari kejahatan diriku dan dari kejahatan syaitan dan syiriknya, dan (aku berlindung dari) melakukan keburukan terhadap diriku atau menyeretnya kepada seorang muslim.",
        "sw": "Ewe Allah, Mjuzi wa yaliyofichika na yaliyowazi, Muumbaji wa mbingu na ardhi, Mola na Mfalme wa kila kitu, Nashuhudia kwamba hapana mungu ila Wewe. Najikinga kwako kutokana na shari ya nafsi yangu na kutokana na shari ya shetani na shirki yake, na kujidhuru nafsi yangu au kumdhuru Muislamu.",
        "bn": "হে আল্লাহ! হে গায়েব ও প্রকাশ্যের পরিজ্ঞাতা, আকাশমন্ডলী ও পৃথিবীর সৃষ্টিকর্তা, হে প্রতিটি বস্তুর রব ও মালিক! আমি সাক্ষ্য দিচ্ছি যে, আপনি ব্যতীত কোন ইলাহ নেই। আমি আপনার কাছে আশ্রয় চাচ্ছি আমার নফসের অনিষ্ট থেকে এবং শয়তানের অনিষ্ট ও তার শিরক থেকে। আর আমি আমার নিজের উপর কোন মন্দ কাজ করা অথবা কোন মুসলিমের দিকে তা টেনে নিয়ে যাওয়া থেকে আশ্রয় চাচ্ছি।"
      }
    },
    {
      "id": "morning_014",
      "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "transliteration": "Bismillahi alladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i wa Huwas-Samee'ul-'Aleem.",
      "repeat": 3,
      "source": "Sunan Abi Dawud",
      "translations": {
        "en": "In the Name of Allah with Whose Name nothing can cause harm on earth or in the heavens, and He is the All-Hearing, the All-Knowing.",
        "ar": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
        "id": "Dengan nama Allah yang dengan nama-Nya, tidak ada sesuatu pun yang dapat membahayakan baik di bumi maupun di langit, dan Dia Maha Mendengar lagi Maha Mengetahui.",
        "ur": "اللہ کے نام سے، جس کے نام کے ساتھ زمین میں اور نہ آسمان میں کوئی چیز نقصان نہیں پہنچا سکتی، اور وہ خوب سننے والا، خوب جاننے والا ہے۔",
        "tr": "Allah'ın adıyla, O'nun adıyla birlikte ne yerde ne de gökte hiçbir şey zarar veremez. O, her şeyi işiten, her şeyi bilendir.",
        "fr": "Au Nom d'Allah, le Nom duquel rien ne peut nuire sur terre ni au ciel, et Il est l'Audient, l'Omniscient.",
        "ru": "Во имя Аллаха, с именем Которого ничто не причинит вреда ни на земле, ни на небесах, и Он — Всеслышащий, Всезнающий.",
        "fa": "به نام خدایی که با نام او هیچ چیز در زمین و آسمان زیان نمی‌رساند و او شنوای داناست.",
        "hi": "अल्लाह के नाम से, जिसके नाम के साथ ज़मीन में और न आसमान में कोई चीज़ नुक़सान नहीं पहुंचा सकती, और वह खूब सुनने वाला, खूब जानने वाला है।",
        "ms": "Dengan nama Allah yang dengan nama-Nya, tiada sesuatu pun yang dapat memberi mudarat sama ada di bumi atau di langit, dan Dia Maha Mendengar lagi Maha Mengetahui.",
        "sw": "Kwa jina la Allah, ambaye kwa jina lake hakuna chochote kinachoweza kudhuru duniani wala mbinguni, naye ndiye Mwenye kusikia yote, Mjuzi wa yote.",
        "bn": "আল্লাহর নামে, যাঁর নামের সাথে আসমান ও যমীনে কোনো কিছুই ক্ষতি করতে পারে না। তিনি সর্বশ্রোতা, মহাজ্ঞানী।"
      }
    },
    {
      "id": "morning_015",
      "arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
      "transliteration": "Radheetu billahi Rabban, wa bil-Islami deenan, wa bi Muhammadin nabiyyan.",
      "repeat": 3,
      "source": "Sunan Abi Dawud",
      "translations": {
        "en": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad as my Prophet.",
        "ar": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
        "id": "Aku rida Allah sebagai Rabbku, Islam sebagai agamaku, dan Muhammad sebagai Nabiku.",
        "ur": "میں اللہ سے اپنے رب کے طور پر راضی ہوں، اسلام سے اپنے دین کے طور پر، اور محمد سے اپنے نبی کے طور پر۔",
        "tr": "Allah'ı Rab olarak, İslam'ı din olarak, Muhammed'i de nebi olarak kabul ettim ve razı oldum.",
        "fr": "Je suis satisfait d'Allah comme Seigneur, de l'Islam comme religion et de Muhammad comme Prophète.",
        "ru": "Я доволен Аллахом как Господом, Исламом как религией и Мухаммадом как Пророком.",
        "fa": "به الله به عنوان پروردگار، به اسلام به عنوان دین، و به محمد به عنوان پیامبر راضی شدم.",
        "hi": "मैं अल्लाह से अपने रब के तौर पर राज़ी हूं, इस्लाम से अपने दीन के तौर पर, और मुहम्मद से अपने नबी के तौर पर।",
        "ms": "Aku redha Allah sebagai Tuhanku, Islam sebagai agamaku, dan Muhammad sebagai Nabiku.",
        "sw": "Nimeridhika na Allah kama Mola wangu, na Uislamu kama Dini yangu, na Muhammad kama Mtume wangu.",
        "bn": "আমি আল্লাহকে রব হিসেবে, ইসলামকে দ্বীন হিসেবে এবং মুহাম্মাদকে নবী হিসেবে মেনে নিয়েছি।"
      }
    },
    {
      "id": "morning_016",
      "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
      "transliteration": "Ya Hayyu ya Qayyumu, birahmatika astagheethu, aslih li sha'ni kullahu, wa la takilni ila nafsi tarfata 'aynin.",
      "repeat": 3,
      "source": "Sunan An-Nasa'i",
      "translations": {
        "en": "O Ever Living, O Sustainer of all existence, by Your mercy I seek assistance. Correct for me all of my affairs and do not entrust me to myself for the blink of an eye.",
        "ar": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
        "id": "Wahai Dzat Yang Maha Hidup, wahai Dzat Yang terus-menerus mengurus (makhluk-Nya), dengan rahmat-Mu aku memohon pertolongan. Perbaikilah seluruh urusanku dan janganlah Engkau menyerahkan diriku kepadaku walau sekejap mata.",
        "ur": "اے زندہ، اے قائم رکھنے والے، تیری رحمت سے مدد طلب کرتا ہوں، میرے تمام معاملات کو درست کر دے، اور پلک جھپکنے کی مدت کے لیے بھی مجھے میرے نفس کے حوالے نہ کر۔",
        "tr": "Ey Hayy ve Ey Kayyum! Rahmetinle yardımını dilerim. Bütün işlerimi benim için düzelt. Göz açıp kapayıncaya kadar bile beni nefsime bırakma.",
        "fr": "Ô le Vivant, ô Celui qui subsiste par Lui-même, par Ta miséricorde je demande Ton secours. Corrige pour moi toutes mes affaires et ne me laisse pas à moi-même un seul instant.",
        "ru": "О Живой, о Поддерживающий! Твоей милостью я ищу помощи. Исправь для меня все мои дела и не вверяй меня моей душе ни на мгновение ока.",
        "fa": "ای زنده، ای پاینده، به رحمت تو یاری می‌طلبم، همه کارهایم را برایم اصلاح کن، و مرا به حال خود حتی به اندازه یک چشم به هم زدن وامگذار.",
        "hi": "ऐ ज़िंदा, ऐ क़ायम रखने वाले, तेरी रहमत से मदद तलब करता हूं, मेरे तमाम मामलात को दुरुस्त कर दे, और पलक झपकने की मुद्दत के लिए भी मुझे मेरे नफ़्स के हवाले न कर।",
        "ms": "Wahai Yang Maha Hidup, Wahai Yang Maha Mengurus (sekalian makhlukNya), dengan rahmat-Mu aku memohon pertolongan. Perbaikilah seluruh urusanku dan janganlah Engkau menyerahkan diriku kepadaku walau sekelip mata.",
        "sw": "Ewe Hai, Ewe Qayyum, kwa rehema Zako naomba msaada, nirekebishie mambo yangu yote, na usiniache kwa nafsi yangu hata kwa kufumba na kufumbua jicho.",
        "bn": "হে চিরঞ্জীব, হে সর্বসত্তার ধারক! আপনার রহমতের মাধ্যমে আপনার কাছে সাহায্য চাই। আমার সকল বিষয় ঠিক করে দিন এবং এক মুহূর্তের জন্যও আমাকে আমার নফসের ওপর ছেড়ে দিবেন না।"
      }
    },
    {
      "id": "morning_017",
      "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "transliteration": "Asbahna 'ala fitratil-Islam, wa 'ala kalimatil-ikhlas, wa 'ala deeni nabiyyina Muhammadin sallallahu 'alayhi wa sallam, wa 'ala millati abeena Ibraheema haneefan musliman wa ma kana minal-mushrikeen.",
      "repeat": 1,
      "source": "Musnad Ahmad",
      "translations": {
        "en": "We have entered the morning upon the natural disposition of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad (peace and blessings of Allah be upon him), and upon the creed of our father Ibrahim, inclining toward truth, a Muslim, and he was not of the polytheists.",
        "ar": "أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
        "id": "Kami telah memasuki waktu pagi dalam keadaan fitrah Islam, di atas kalimat ikhlas, dan di atas agama Nabi kami Muhammad shallallahu 'alaihi wa sallam, serta di atas agama bapak kami Ibrahim yang hanif dan muslim, dan dia bukanlah termasuk orang-orang musyrik.",
        "ur": "ہم نے صبح کی اسلام کی فطرت پر، اور اخلاص کے کلمے پر، اور ہمارے نبی محمد صلی اللہ علیہ وسلم کے دین پر، اور ہمارے باپ ابراہیم کے ملت پر جو حنیف اور مسلم تھے، اور وہ مشرکین میں سے نہ تھے۔",
        "tr": "İslam fıtratı üzerine, ihlas kelimesi üzerine, peygamberimiz Muhammed sallallahu aleyhi ve sellem'in dini üzerine ve babamız İbrahim'in Hanif ve Müslüman dini üzerine sabaha eriştik. O, müşriklerden değildi.",
        "fr": "Nous sommes entrés dans le matin sur la nature primordiale de l'Islam, sur la parole de la sincérité, sur la religion de notre Prophète Muhammad (que la paix et le salut d'Allah soient sur lui), et sur la voie de notre père Ibrahim, qui était un monothéiste sincère, un musulman, et il n'était pas du nombre des polythéistes.",
        "ru": "Мы встретили утро на природе Ислама, на слове искренности, на религии нашего Пророка Мухаммада (мир ему и благословение Аллаха), и на вероуставе нашего отца Ибрахима, который был праведным и покорным, и не был из числа многобожников.",
        "fa": "صبح کردیم بر فطرت اسلام، و بر کلمه اخلاص، و بر دین پیامبرمان محمد صلی الله علیه و سلم، و بر ملت پدرمان ابراهیم که حنیف و مسلمان بود و از مشرکین نبود.",
        "hi": "हमने सुबह की इस्लाम की फ़ितरत पर, और इख़लास के कलिमे पर, और हमारे नबी मुहम्मद सल्लल्लाहु अलैहि वसल्लम के दीन पर, और हमारे बाप इब्राहीम के मिल्लत पर जो हनीफ़ और मुस्लिम थे, और वह मुशरिकीन में से न थे।",
        "ms": "Kami telah memasuki waktu pagi dalam keadaan fitrah Islam, di atas kalimat ikhlas, dan di atas agama Nabi kami Muhammad SAW, serta di atas agama bapa kami Ibrahim yang hanif dan muslim, dan dia bukanlah termasuk orang-orang musyrik.",
        "sw": "Tumeingia asubuhi juu ya fitra ya Uislamu, na juu ya neno la ikhlasi, na juu ya dini ya Mtume wetu Muhammad S.A.W, na juu ya mila ya baba yetu Ibrahim, aliyekuwa mwongofu Mwislamu, na hakuwa miongoni mwa washirikina.",
        "bn": "আমরা ইসলামের স্বভাবের উপর, ইখলাসের বাণীর উপর, আমাদের নবী মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের দ্বীনের উপর এবং আমাদের পিতা ইবরাহীমের মিল্লাতের উপর সকালে উপনীত হয়েছি, যিনি একনিষ্ঠ মুসলিম ছিলেন এবং মুশরিকদের অন্তর্ভুক্ত ছিলেন না।"
      }
    },
    {
      "id": "morning_018",
      "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
      "transliteration": "Subhanallahi wa bihamdihi.",
      "repeat": 100,
      "source": "Sahih Muslim",
      "translations": {
        "en": "Glorified is Allah and praised be He.",
        "ar": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
        "id": "Maha Suci Allah dengan segala puji-Nya.",
        "ur": "اللہ پاک ہے اور تمام تعریفیں اسی کے لیے ہیں۔",
        "tr": "Allah'ı tesbih ederim ve O'na hamd ederim.",
        "fr": "Gloire à Allah et à Lui la louange.",
        "ru": "Пречист Аллах и хвала Ему.",
        "fa": "پاک است خدا و ستایش از آن اوست.",
        "hi": "अल्लाह पाक है और तमाम तारीफें उसी के लिए हैं।",
        "ms": "Maha Suci Allah dan segala puji bagi-Nya.",
        "sw": "Ametakasika Allah na sifa zote ni zake.",
        "bn": "আল্লাহর পবিত্রতা ঘোষণা করছি এবং তাঁর প্রশংসা করছি।"
      }
    },
    {
      "id": "morning_019",
      "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "transliteration": "La ilaha illallahu wahdahu la shareeka lah, lahul-mulku wa lahul-hamdu wa huwa 'ala kulli shai'in qadeer.",
      "repeat": 10,
      "source": "Sahih Muslim",
      "translations": {
        "en": "There is no god but Allah, alone, without partner. To Him belongs all sovereignty and all praise, and He is over all things competent.",
        "ar": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "id": "Tidak ada Tuhan yang berhak disembah kecuali Allah semata, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian, dan Dia Mahakuasa atas segala sesuatu.",
        "ur": "اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اسی کا ہے بادشاہت اور اسی کا ہے حمد، اور وہ ہر چیز پر قادر ہے۔",
        "tr": "Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'nadır ve O her şeye kadirdir.",
        "fr": "Il n'y a de dieu qu'Allah, seul, sans associé. À Lui la royauté et à Lui la louange, et Il est capable de toute chose.",
        "ru": "Нет божества, кроме Аллаха, Одного, нет у Него сотоварища. Ему принадлежит владычество и Ему хвала, и Он над всякой вещью мощен.",
        "fa": "معبودی جز الله نیست، یکتاست، شریکی برای او نیست. پادشاهی و ستایش از آن اوست و او بر هر چیزی تواناست.",
        "hi": "अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई शरीक नहीं। उसी का है बादशाहत और उसी का है हम्द, और वह हर चीज़ पर क़ादिर है।",
        "ms": "Tiada Tuhan yang berhak disembah melainkan Allah yang Esa, tiada sekutu bagi-Nya. Bagi-Nya kekuasaan dan bagi-Nya pujian, dan Dia Maha Berkuasa atas segala sesuatu.",
        "sw": "Hapana mungu ila Allah, peke Yake, hana mshirika. Ni Wake ufalme na ni Zake sifa zote, na Yeye ni Muweza juu ya kila kitu.",
        "bn": "আল্লাহ ব্যতীত কোন ইলাহ নেই, তিনি এক ও শরীকবিহীন। তাঁরই রাজত্ব এবং তাঁরই সকল প্রশংসা; আর তিনি সব কিছুর উপর ক্ষমতাবান।"
      }
    },
    {
      "id": "morning_020",
      "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
      "transliteration": "Subhanallahi wa bihamdihi 'adada khalqihi wa rida nafsihi wa zinata 'arshihi wa midada kalimatihi.",
      "repeat": 3,
      "source": "Sahih Muslim",
      "translations": {
        "en": "Glorified is Allah and praised be He, to the number of His creation, by His pleasure, by the weight of His Throne, and by the ink of His words.",
        "ar": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
        "id": "Maha Suci Allah dengan segala puji-Nya, sebanyak bilangan ciptaan-Nya, sesuai dengan keridaan Diri-Nya, seberat timbangan Arsy-Nya, dan sebanyak tinta kalimat-kalimat-Nya.",
        "ur": "اللہ پاک ہے اور تمام تعریفیں اسی کے لیے ہیں، اپنی مخلوق کی تعداد کے برابر، اپنی ذات کی رضا کے مطابق، اپنے عرش کے وزن کے برابر، اور اپنے کلمات کی سیاہی کے برابر۔",
        "tr": "Allah'ı tesbih ederim ve O'na hamd ederim. Yarattıkları sayısınca, nefsinin rızası kadar, arşının ağırlığınca ve kelimelerinin adedince.",
        "fr": "Gloire à Allah et à Lui la louange, au nombre de Ses créatures, selon Sa satisfaction, selon le poids de Son Trône, et selon l'encre de Ses paroles.",
        "ru": "Пречист Аллах и хвала Ему, столько, сколько сотворил Он, и столько, сколько угодно Ему, и столько, сколько весит Его Трон, и столько, сколько чернил для Его слов.",
        "fa": "پاک است خدا و ستایش از آن اوست، به تعداد آفریدگانش، به رضای خودش، به وزن عرشش و به مقدار کلماتش.",
        "hi": "अल्लाह पाक है और तमाम तारीफें उसी के लिए हैं, अपनी मखलूक़ की तादाद के बराबर, अपनी ज़ात की रज़ा के मुताबिक़, अपने अर्श के वज़न के बराबर, और अपने कलमात की स्याही के बराबर।",
        "ms": "Maha Suci Allah dan segala puji bagi-Nya, sebanyak bilangan ciptaan-Nya, sesuai dengan kerelaan Diri-Nya, seberat timbangan Arasy-Nya, dan sebanyak tinta kalimat-kalimat-Nya.",
        "sw": "Ametakasika Allah na sifa zote ni zake, kwa idadi ya viumbe vyake, kwa radhi zake, kwa uzito wa Arshi yake, na kwa wino wa maneno yake.",
        "bn": "আমি আল্লাহর পবিত্রতা ঘোষণা করছি এবং তাঁর প্রশংসা করছি, তাঁর সৃষ্টির সংখ্যা পরিমাণ, তাঁর নিজের সন্তুষ্টি পরিমাণ, তাঁর আরশের ওজন পরিমাণ এবং তাঁর বাক্যসমূহের কালি পরিমাণ।"
      }
    },
    {
      "id": "morning_021",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
      "transliteration": "Allahumma inni as'aluka 'ilman nafi'an, wa rizqan tayyiban, wa 'amalan mutaqabbalan.",
      "repeat": 1,
      "source": "Sunan Ibn Majah",
      "translations": {
        "en": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds.",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
        "id": "Ya Allah, sesungguhnya aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik, dan amal yang diterima.",
        "ur": "اے اللہ، میں تجھ سے نفع بخش علم، پاکیزہ رزق، اور مقبول عمل کا سوال کرتا ہوں۔",
        "tr": "Allah'ım! Faydalı ilim, temiz rızık ve kabul olunmuş amel isterim senden.",
        "fr": "Ô Allah, je Te demande une science utile, une bonne subsistance et une œuvre acceptée.",
        "ru": "О Аллах, поистине, я прошу у Тебя полезного знания, благого удела и принятого деяния.",
        "fa": "پروردگارا، از تو علم نافع، روزی پاکیزه و عمل مورد قبول را می‌خواهم.",
        "hi": "ऐ अल्लाह, मैं तुझसे नफा बख्श इल्म, पाकीज़ा रिज़्क़, और मक़बूल अमल का सवाल करता हूं।",
        "ms": "Ya Allah, sesungguhnya aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik, dan amalan yang diterima.",
        "sw": "Ewe Allah, hakika mimi nakuomba elimu yenye manufaa, na riziki njema, na amali inayokubalika.",
        "bn": "হে আল্লাহ! আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমল চাই।"
      }
    },
    {
      "id": "morning_022",
      "arabic": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
      "transliteration": "Astaghfirullaha wa atubu ilayh.",
      "repeat": 100,
      "source": "Sahih Muslim",
      "translations": {
        "en": "I seek forgiveness from Allah and repent to Him.",
        "ar": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
        "id": "Aku memohon ampun kepada Allah dan bertobat kepada-Nya.",
        "ur": "میں اللہ سے مغفرت طلب کرتا ہوں اور اسی کی طرف توبہ کرتا ہوں۔",
        "tr": "Allah'tan bağışlanma diler ve O'na tövbe ederim.",
        "fr": "Je demande pardon à Allah et je me repens à Lui.",
        "ru": "Я прошу прощения у Аллаха и каюсь Ему.",
        "fa": "از خداوند آمرزش می‌طلبم و به سوی او توبه می‌کنم.",
        "hi": "मैं अल्लाह से मग़फ़िरत तलब करता हूं और उसी की तरफ़ तौबा करता हूं।",
        "ms": "Aku memohon keampunan daripada Allah dan aku bertaubat kepada-Nya.",
        "sw": "Naomba msamaha kwa Allah na natubu Kwake.",
        "bn": "আমি আল্লাহর কাছে ক্ষমা প্রার্থনা করছি এবং তাঁর কাছে তওবা করছি।"
      }
    },
    {
      "id": "morning_023",
      "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ",
      "transliteration": "Allahumma salli wa sallim 'ala nabiyyina Muhammad.",
      "repeat": 10,
      "source": "Sunan An-Nasa'i",
      "translations": {
        "en": "O Allah, send blessings and peace upon our Prophet Muhammad.",
        "ar": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ",
        "id": "Ya Allah, limpahkanlah rahmat dan keselamatan kepada Nabi kami Muhammad.",
        "ur": "اے اللہ، ہمارے نبی محمد پر درود و سلام بھیج۔",
        "tr": "Allah'ım! Peygamberimiz Muhammed'e salat ve selam eyle.",
        "fr": "Ô Allah, prie et salue notre Prophète Muhammad.",
        "ru": "О Аллах, ниспошли благословения и мир нашему Пророку Мухаммаду.",
        "fa": "پروردگارا، بر پیامبرمان محمد درود و سلام فرست.",
        "hi": "ऐ अल्लाह, हमारे नबी मुहम्मद पर दुरूद व सलाम भेज।",
        "ms": "Ya Allah, limpahkanlah rahmat dan kesejahteraan ke atas Nabi kami Muhammad.",
        "sw": "Ewe Allah, mswalie na umsalimu Mtume wetu Muhammad.",
        "bn": "হে আল্লাহ! আমাদের নবী মুহাম্মাদের উপর রহমত ও শান্তি বর্ষণ করুন।"
      }
    },
    {
      "id": "morning_024",
      "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
      "transliteration": "A'udhu bikalimatillahit-tammati min sharri ma khalaq.",
      "repeat": 3,
      "source": "Sahih Muslim",
      "translations": {
        "en": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
        "ar": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
        "id": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari kejahatan apa yang Dia ciptakan.",
        "ur": "میں اللہ کے کامل کلمات کی پناہ مانگتا ہوں اس چیز کے شر سے جو اس نے پیدا کی ہے۔",
        "tr": "Allah'ın eksiksiz kelimelerine, yarattığı şeylerin şerrinden sığınırım.",
        "fr": "Je cherche refuge auprès des paroles parfaites d'Allah contre le mal de ce qu'Il a créé.",
        "ru": "Я прибегаю к совершенным словам Аллаха от зла того, что Он создал.",
        "fa": "به کلمات کامل خدا پناه می‌برم از شر آنچه آفریده است.",
        "hi": "मैं अल्लाह के कामिल कलिमात की पनाह मांगता हूं उस चीज़ के शर से जो उसने पैदा की है।",
        "ms": "Aku berlindung dengan kalimah-kalimah Allah yang sempurna dari kejahatan apa yang Dia ciptakan.",
        "sw": "Najikinga kwa maneno kamili ya Allah kutokana na shari ya alivyoviumba.",
        "bn": "আমি আল্লাহর পরিপূর্ণ বাক্যসমূহের মাধ্যমে তাঁর সৃষ্টির অনিষ্ট থেকে আশ্রয় প্রার্থনা করছি।"
      }
    },
    {
      "id": "morning_025",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ",
      "transliteration": "Allahumma inni as'aluka khayra hadhal-yawmi fat-hahu wa nasrahu wa nurahu wa barakatahu wa hudahu, wa a'udhu bika min sharri ma feehi wa sharri ma ba'dahu.",
      "repeat": 1,
      "source": "Sunan Abi Dawud",
      "translations": {
        "en": "O Allah, I ask You for the good of this day, its opening, its victory, its light, its blessings, and its guidance, and I seek refuge in You from the evil of what is in it and the evil of what comes after it.",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ",
        "id": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikan hari ini: pembukaannya, pertolongannya, cahayanya, berkahnya, dan petunjuknya, dan aku berlindung kepada-Mu dari keburukan apa yang ada di dalamnya dan keburukan apa yang datang setelahnya.",
        "ur": "اے اللہ، میں تجھ سے اس دن کی بھلائی کا سوال کرتا ہوں: اس کی فتح، اس کی نصرت، اس کا نور، اس کی برکت، اور اس کی ہدایت، اور میں تیری پناہ مانگتا ہوں اس میں جو برائی ہے اور اس کے بعد کی برائی سے۔",
        "tr": "Allah'ım! Bu günün hayrını, fethini, zaferini, nurunu, bereketini ve hidayetini senden dilerim. Bu gündeki şerden ve ondan sonraki şerden sana sığınırım.",
        "fr": "Ô Allah, je Te demande le bien de ce jour : son ouverture, sa victoire, sa lumière, sa bénédiction et sa guidée, et je cherche refuge auprès de Toi contre le mal de ce qu'il contient et le mal de ce qui vient après lui.",
        "ru": "О Аллах, поистине, я прошу у Тебя блага этого дня: его открытия, его победы, его света, его благословения и его руководства, и я прибегаю к Тебе от зла того, что в нем, и зла того, что после него.",
        "fa": "پروردگارا، از تو خیر این روز را می‌خواهم: گشایشش، یاریش، نورش، برکتش و هدایتش، و به تو پناه می‌برم از شر آنچه در آن است و شر آنچه پس از آن است.",
        "hi": "ऐ अल्लाह, मैं तुझसे इस दिन की भलाई का सवाल करता हूं: उसकी फ़तह, उसकी नुसरत, उसका नूर, उसकी बरकत, और उसकी हिदायत, और मैं तेरी पनाह मांगता हूं उसमें जो बुराई है और उसके बाद की बुराई से।",
        "ms": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikan pada hari ini: pembukaannya, pertolongannya, cahayanya, keberkatannya, dan petunjuknya, dan aku berlindung kepada-Mu dari kejahatan apa yang ada di dalamnya dan kejahatan apa yang datang selepasnya.",
        "sw": "Ewe Allah, hakika mimi nakuomba kheri ya siku hii: ufunguzi wake, na ushindi wake, na nuru yake, na baraka zake, na uongofu wake, na najikinga kwako kutokana na shari iliyomo ndani yake na shari ya yatakayokuja baada yake.",
        "bn": "হে আল্লাহ! আমি আপনার কাছে এই দিনের কল্যাণ চাই: এর বিজয়, এর সাহায্য, এর আলো, এর বরকত এবং এর হেদায়েত। আর আমি আপনার কাছে এর মধ্যে যা মন্দ আছে এবং এর পরের মন্দ থেকে আশ্রয় প্রার্থনা করি।"
      }
    }
  ],
  "eveningAdhkar": [
    {
      "id": "evening_001",
      "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا. رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
      "transliteration": "Amsayna wa amsal-mulku lillahi, wal-hamdu lillahi, la ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu wa huwa 'ala kulli shay'in qadeer. Rabbi as'aluka khayra ma fi hadhihil-laylah wa khayra ma ba'daha, wa a'udhu bika min sharri ma fi hadhihil-laylah wa sharri ma ba'daha. Rabbi a'udhu bika minal-kasali wa su'il-kibari, Rabbi a'udhu bika min 'adhabin fin-nari wa 'adhabin fil-qabr.",
      "repeat": 1,
      "source": "Sahih Muslim",
      "translations": {
        "en": "We have entered the evening, and with us the dominion of Allah has entered the evening. All praise is due to Allah. There is no god but Allah, alone without any partners. To Him belongs the dominion and to Him belongs all praise, and He is over all things competent. My Lord, I ask You for the good of this night and the good of what comes after it. I seek refuge in You from the evil of this night and the evil of what comes after it. My Lord, I seek refuge in You from laziness and the misery of old age. My Lord, I seek refuge in You from the punishment of the Fire and the punishment of the grave.",
        "ar": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا. رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
        "id": "Kami telah memasuki waktu petang, dan pada waktu petang ini kerajaan adalah milik Allah, segala puji bagi Allah. Tidak ada ilah yang berhak disembah kecuali Allah semata, tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala puji, dan Dia Mahakuasa atas segala sesuatu. Ya Rabbku, aku memohon kepada-Mu kebaikan malam ini dan kebaikan setelahnya. Dan aku berlindung kepada-Mu dari keburukan malam ini dan keburukan setelahnya. Ya Rabbku, aku berlindung kepada-Mu dari kemalasan dan keburukan masa tua. Ya Rabbku, aku berlindung kepada-Mu dari azab neraka dan azab kubur.",
        "ur": "ہم نے شام کی، اور اللہ کی بادشاہت نے شام کی۔ تمام تعریفیں اللہ کے لیے ہیں۔ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اسی کی بادشاہت ہے اور اسی کے لیے تمام تعریفیں ہیں، اور وہ ہر چیز پر قادر ہے۔ اے میرے رب، میں تجھ سے اس رات کی بھلائی اور اس کے بعد کی بھلائی مانگتا ہوں۔ اور میں تیری پناہ مانگتا ہوں اس رات کی برائی اور اس کے بعد کی برائی سے۔ اے میرے رب، میں تیری پناہ مانگتا ہوں سستی اور بڑھاپے کی برائی سے۔ اے میرے رب، میں تیری پناہ مانگتا ہوں جہنم کے عذاب سے اور قبر کے عذاب سے۔",
        "tr": "Akşama ulaştık, Allah'ın mülkü de akşama ulaştı. Hamd Allah'adır. Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'nundur ve O her şeye kadirdir. Rabbim, bu gecenin hayrını ve ondan sonraki hayrı senden isterim. Bu gecenin şerrinden ve ondan sonraki şerrinden sana sığınırım. Rabbim, tembellikten ve yaşlılığın kötülüğünden sana sığınırım. Rabbim, cehennem azabından ve kabir azabından sana sığınırım.",
        "fr": "Nous sommes entrés dans la soirée, et avec nous le royaume d'Allah est entré dans la soirée. Toute louange est à Allah. Il n'y a de dieu qu'Allah, seul, sans associé. À Lui appartient le royaume et à Lui appartient toute louange, et Il est capable de toute chose. Mon Seigneur, je Te demande le bien de cette nuit et le bien de ce qui vient après. Je cherche refuge auprès de Toi contre le mal de cette nuit et le mal de ce qui vient après. Mon Seigneur, je cherche refuge auprès de Toi contre la paresse et la misère de la vieillesse. Mon Seigneur, je cherche refuge auprès de Toi contre le châtiment du Feu et le châtiment de la tombe.",
        "ru": "Мы вступили в вечер, и с нами вступила в вечер власть Аллаха. Вся хвала принадлежит Аллаху. Нет бога, кроме Аллаха, единого, у Которого нет сотоварищей. Ему принадлежит власть, и Ему принадлежит вся хвала, и Он над всякой вещью мощен. Господи, я прошу у Тебя блага этой ночи и блага того, что после нее, и я прибегаю к Тебе от зла этой ночи и зла того, что после нее. Господи, я прибегаю к Тебе от лени и от скверного старчества. Господи, я прибегаю к Тебе от мучений в Огне и мучений в могиле.",
        "fa": "ما شامگاهان شدیم و ملکوت الهی نیز شامگاهان شد، و سپاس از آنِ خداست. هیچ معبودی جز الله نیست، یکتاست و شریکی ندارد. فرمانروایی از آنِ اوست و ستایش نیز از آنِ اوست و او بر هر چیزی تواناست. پروردگارا، از تو خیر این شب و خیر پس از آن را میطلبم، و از شر این شب و شر پس از آن به تو پناه میبرم. پروردگارا، از تنبلی و بدی پیری به تو پناه میبرم. پروردگارا، از عذاب آتش و عذاب قبر به تو پناه میبرم.",
        "hi": "हमने शाम की, और अल्लाह की बादशाहत ने शाम की। तमाम तारीफें अल्लाह के लिए हैं। अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई शरीक नहीं। उसी की बादशाहत है और उसी के लिए तमाम तारीफें हैं, और वह हर चीज़ पर कादिर है। ऐ मेरे रब, मैं तुझसे इस रात की भलाई और इसके बाद की भलाई मांगता हूँ। और मैं तेरी पनाह मांगता हूँ इस रात की बुराई और इसके बाद की बुराई से। ऐ मेरे रब, मैं तेरी पनाह मांगता हूँ सुस्ती और बुढ़ापे की बुराई से। ऐ मेरे रब, मैं तेरी पनाह मांगता हूँ जहन्नम के अज़ाब से और कब्र के अज़ाब से।",
        "ms": "Kami telah memasuki waktu petang, dan pada waktu petang ini kerajaan adalah milik Allah, segala puji bagi Allah. Tiada Tuhan yang berhak disembah melainkan Allah semata, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala puji, dan Dia Maha Kuasa atas segala sesuatu. Ya Tuhanku, aku memohon kepada-Mu kebaikan malam ini dan kebaikan selepasnya. Dan aku berlindung kepada-Mu dari keburukan malam ini dan keburukan selepasnya. Ya Tuhanku, aku berlindung kepada-Mu dari kemalasan dan keburukan usia tua. Ya Tuhanku, aku berlindung kepada-Mu dari azab neraka dan azab kubur.",
        "sw": "Tumeingia jioni, na ufalme wa Allah umeingia jioni. Sifa zote ni za Allah. Hakuna mungu ila Allah, peke Yake hana mshirika. Ufalme ni Wake na sifa zote ni Zake, na Yeye ni Muweza juu ya kila kitu. Ee Mola wangu, nakuomba wema wa usiku huu na wema wa baada yake, na najilinda Kwako kutokana na shari ya usiku huu na shari ya baada yake. Ee Mola wangu, najilinda Kwako kutokana na uvivu na ubaya wa uzee. Ee Mola wangu, najilinda Kwako kutokana na adhabu ya Moto na adhabu ya kaburi.",
        "bn": "আমরা সন্ধ্যায় প্রবেশ করেছি, এবং আল্লাহর রাজত্বও সন্ধ্যায় প্রবেশ করেছে। সমস্ত প্রশংসা আল্লাহর জন্য। আল্লাহ ছাড়া কোন ইলাহ নেই, তিনি এক, তাঁর কোন শরীক নেই। তাঁরই জন্য রাজত্ব এবং তাঁরই জন্য সমস্ত প্রশংসা, এবং তিনি সবকিছুর উপর ক্ষমতাবান। হে আমার রব, আমি আপনার কাছে এই রাতের কল্যাণ এবং এর পরের কল্যাণ প্রার্থনা করি। আর আমি আপনার কাছে এই রাতের অকল্যাণ এবং এর পরের অকল্যাণ থেকে আশ্রয় চাই। হে আমার রব, আমি আপনার কাছে অলসতা এবং বার্ধক্যের কষ্ট থেকে আশ্রয় চাই। হে আমার রব, আমি আপনার কাছে জাহান্নামের আযাব এবং কবরের আযাব থেকে আশ্রয় চাই।"
      }
    },
    {
      "id": "evening_002",
      "arabic": "اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ.",
      "transliteration": "Allahumma bika amsayna, wa bika asbahna, wa bika nahya, wa bika namootu, wa ilaykal-maseer.",
      "repeat": 1,
      "source": "Jami' At-Tirmidhi",
      "translations": {
        "en": "O Allah, by Your grace we have entered the evening, and by Your grace we have entered the morning, and by Your grace we live, and by Your grace we die, and to You is the return.",
        "ar": "اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ.",
        "id": "Ya Allah, dengan rahmat-Mu kami memasuki waktu petang, dan dengan rahmat-Mu kami memasuki waktu pagi, dan dengan rahmat-Mu kami hidup, dan dengan rahmat-Mu kami mati, dan kepada-Mulah kami kembali.",
        "ur": "اے اللہ، تیرے فضل سے ہم نے شام کی، اور تیرے فضل سے ہم نے صبح کی، اور تیرے فضل سے ہم جیتے ہیں، اور تیرے فضل سے ہم مرتے ہیں، اور تیری طرف ہی لوٹنا ہے۔",
        "tr": "Allah'ım, seninle akşama erdik, seninle sabaha çıktık, seninle yaşar, seninle ölürüz ve dönüş sanadır.",
        "fr": "Ô Allah, par Toi nous sommes entrés dans la soirée, et par Toi nous sommes entrés dans le matin, et par Toi nous vivons, et par Toi nous mourons, et c'est à Toi que nous retournerons.",
        "ru": "О Аллах, по Твоей милости мы вступили в вечер, и по Твоей милости мы вступили в утро, и по Твоей милости мы живем, и по Твоей милости мы умираем, и к Тебе возвращение.",
        "fa": "بار الها، به لطف تو شامگاهان شدیم و به لطف تو بامدادان شدیم، و به لطف تو زنده ایم و به لطف تو می میریم، و بازگشت به سوی توست.",
        "hi": "ऐ अल्लाह, तेरी ही कृपा से हमने शाम की, और तेरी ही कृपा से हमने सुबह की, और तेरी ही कृपा से हम जीते हैं, और तेरी ही कृपा से हम मरते हैं, और तेरी ही ओर लौटना है।",
        "ms": "Ya Allah, dengan rahmat-Mu kami memasuki waktu petang, dan dengan rahmat-Mu kami memasuki waktu pagi, dan dengan rahmat-Mu kami hidup, dan dengan rahmat-Mu kami mati, dan kepada-Mulah kami kembali.",
        "sw": "Ee Allah, kwa neema Yako tumeingia jioni, na kwa neema Yako tumeingia asubuhi, na kwa neema Yako tunaishi, na kwa neema Yako tunakufa, na Kwako ni marejeo.",
        "bn": "হে আল্লাহ, আপনার অনুগ্রহে আমরা সন্ধ্যায় প্রবেশ করেছি, এবং আপনার অনুগ্রহে আমরা সকালে প্রবেশ করেছি, এবং আপনার অনুগ্রহে আমরা বাঁচি, এবং আপনার অনুগ্রহে আমরা মারা যাই, এবং আপনার দিকেই প্রত্যাবর্তন।"
      }
    },
    {
      "id": "evening_003",
      "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلا أَنْتَ.",
      "transliteration": "Allahumma anta Rabbi la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, aboo'u laka bi ni'matika 'alayya, wa aboo'u bi dhanbi faghfir li fa innahu la yaghfirudh-dhunooba illa anta.",
      "repeat": 1,
      "source": "Sahih Al-Bukhari",
      "translations": {
        "en": "O Allah, You are my Lord, there is no god but You. You created me and I am Your slave, and I am faithful to Your covenant and Your promise as much as I can. I seek refuge with You from the evil of what I have done. I acknowledge Your favor upon me, and I acknowledge my sin. So forgive me, for none forgives sins except You.",
        "ar": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلا أَنْتَ.",
        "id": "Ya Allah, Engkaulah Tuhanku, tidak ada ilah yang berhak disembah kecuali Engkau. Engkau telah menciptakan aku dan aku adalah hamba-Mu. Aku berada di atas perjanjian-Mu dan janji-Mu semampuku. Aku berlindung kepada-Mu dari keburukan yang telah aku perbuat. Aku mengakui nikmat-Mu atasku, dan aku mengakui dosaku. Maka ampunilah aku, karena sesungguhnya tidak ada yang mengampuni dosa-dosa kecuali Engkau.",
        "ur": "اے اللہ، تو میرا رب ہے، تیرے سوا کوئی معبود نہیں۔ تو نے مجھے پیدا کیا اور میں تیرا بندہ ہوں، اور میں اپنی استطاعت کے مطابق تیرے عہد اور تیرے وعدے پر قائم ہوں۔ میں اپنے کیے کی برائی سے تیری پناہ مانگتا ہوں۔ میں اپنے اوپر تیری نعمت کا اقرار کرتا ہوں، اور میں اپنے گناہ کا اقرار کرتا ہوں۔ پس مجھے بخش دے، کیونکہ تیرے سوا کوئی گناہوں کو نہیں بخشتا۔",
        "tr": "Allah'ım! Sen benim Rabbimsin. Senden başka ilah yoktur. Beni Sen yarattın. Ben Senin kulunum. Gücüm yettiği kadar Senin ahdin ve va’din üzereyim. Yaptıklarımın şerrinden Sana sığınırım. Bana olan nimetini itiraf ederim, günahımı da itiraf ederim. Beni bağışla. Şüphesiz günahları Senden başka kimse bağışlamaz.",
        "fr": "Ô Allah, Tu es mon Seigneur, il n'y a de dieu que Toi. Tu m'as créé et je suis Ton serviteur, et je suis fidèle à Ton alliance et à Ta promesse autant que je le peux. Je cherche refuge auprès de Toi contre le mal de ce que j'ai fait. Je reconnais Tes bienfaits envers moi, et je reconnais mon péché. Pardonne-moi donc, car nul ne pardonne les péchés sauf Toi.",
        "ru": "О Аллах, Ты мой Господь, нет бога, кроме Тебя. Ты создал меня, и я Твой раб, и я на Твоем завете и обещании, насколько могу. Я прибегаю к Тебе от зла того, что я сделал. Я признаю Твою милость ко мне, и я признаю свой грех. Так прости меня, ибо никто не прощает грехов, кроме Тебя.",
        "fa": "بار الها، تو پروردگار منی، هیچ معبودی جز تو نیست. تو مرا آفریدی و من بنده تو هستم، و من بر پیمان و وعده تو تا جایی که بتوانم ثابت قدم هستم. از شر آنچه انجام داده‌ام به تو پناه میبرم. به نعمتت بر من اقرار می کنم، و به گناهم اقرار می کنم. پس مرا بیامرز، زیرا کسی جز تو گناهان را نمی آمرزد.",
        "hi": "ऐ अल्लाह, तू मेरा रब है, तेरे सिवा कोई माबूद नहीं। तूने मुझे पैदा किया और मैं तेरा बंदा हूँ, और मैं अपनी ताकत के मुताबिक तेरे अहद और तेरे वादे पर कायम हूँ। मैंने जो कुछ किया है उसकी बुराई से तेरी पनाह माँगता हूँ। मैं अपने ऊपर तेरी नेमत का इकरार करता हूँ, और मैं अपने गुनाह का इकरार करता हूँ। पस मुझे बख़्श दे, क्योंकि तेरे सिवा कोई गुनाहों को नहीं बख़्शता।",
        "ms": "Ya Allah, Engkaulah Tuhanku, tiada Tuhan yang berhak disembah melainkan Engkau. Engkau telah menciptakan aku dan aku adalah hamba-Mu. Aku berada di atas perjanjian-Mu dan janji-Mu semampuku. Aku berlindung kepada-Mu dari keburukan yang telah aku lakukan. Aku mengakui nikmat-Mu ke atasku, dan aku mengakui dosaku. Maka ampunilah aku, kerana sesungguhnya tiada yang mengampuni dosa-dosa melainkan Engkau.",
        "sw": "Ee Allah, Wewe ndiye Mola wangu, hakuna mungu ila Wewe. Umeniumba na mimi ni mja Wako, na niko juu ya ahadi Yako na ahadi Yako kadiri niwezavyo. Najikinga Kwako kutokana na shari ya yale niliyoyafanya. Nakubali neema Zako kwangu, na nakubali dhambi yangu. Basi nisamehe, kwani hakuna anayesamehe dhambi isipokuwa Wewe.",
        "bn": "হে আল্লাহ, আপনি আমার রব, আপনি ছাড়া কোন ইলাহ নেই। আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার বান্দা, আর আমি আপনার অঙ্গীকার ও প্রতিজ্ঞার উপর আছি যতদূর সম্ভব। আমি যা করেছি তার মন্দ থেকে আপনার কাছে আশ্রয় চাই। আমি আপনার আমার উপর অনুগ্রহ স্বীকার করি, এবং আমার গুনাহ স্বীকার করি। অতএব আমাকে ক্ষমা করুন, কারণ আপনি ছাড়া কেউ গুনাহ ক্ষমা করে না।"
      }
    },
    {
      "id": "evening_004",
      "arabic": "اللَّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ وَحْدَكَ لا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.",
      "transliteration": "Allahumma innee amsaytu ush-hiduka, wa ush-hidu hamalata 'arshika, wa mala'ikataka, wa jamee'a khalqika, annaka antal-lahu la ilaha illa anta wahdaka la shareeka laka, wa anna Muhammadan 'abduka wa rasooluk.",
      "repeat": 4,
      "source": "Sunan Abu Dawud",
      "translations": {
        "en": "O Allah, I have entered the evening and I call You to witness, and I call the bearers of Your Throne, and Your angels, and all Your creation to witness that You are Allah, there is no god but You alone, You have no partners, and that Muhammad is Your slave and Your Messenger.",
        "ar": "اللَّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ وَحْدَكَ لا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.",
        "id": "Ya Allah, sungguh aku telah memasuki waktu petang. Aku bersaksi kepada-Mu, dan aku bersaksi kepada para pemikul Arasy-Mu, para malaikat-Mu, dan seluruh makhluk-Mu, bahwasanya Engkau adalah Allah, tidak ada ilah yang berhak disembah kecuali Engkau sendiri, tidak ada sekutu bagi-Mu, dan sesungguhnya Muhammad adalah hamba-Mu dan Rasul-Mu.",
        "ur": "اے اللہ، میں نے شام کی ہے اور میں تجھے گواہ بناتا ہوں، اور تیرے عرش کے اٹھانے والوں کو، اور تیرے فرشتوں کو، اور تیری تمام مخلوق کو گواہ بناتا ہوں کہ تو ہی اللہ ہے، تیرے سوا کوئی معبود نہیں، تو اکیلا ہے، تیرا کوئی شریک نہیں، اور محمد تیرا بندہ اور تیرا رسول ہے۔",
        "tr": "Allah'ım! Akşama ulaştım. Seni, Arşını taşıyanları, meleklerini ve bütün yarattıklarını şahid tutarım ki; Sen Allah'sın, Senden başka ilah yoktur. Sen teksin, ortağın yoktur. Muhammed de Senin kulun ve elçindir.",
        "fr": "Ô Allah, je suis entré dans la soirée et je Te prends à témoin, et je prends à témoin les porteurs de Ton Trône, et Tes anges, et toutes Tes créatures, que Tu es Allah, il n'y a de dieu que Toi seul, Tu n'as pas d'associés, et que Muhammad est Ton serviteur et Ton Messager.",
        "ru": "О Аллах, я вступил в вечер, и я призываю Тебя в свидетели, и я призываю в свидетели носителей Твоего Трона, и Твоих ангелов, и все Твои творения, что Ты Аллах, нет бога, кроме Тебя одного, у Тебя нет сотоварищей, и что Мухаммад – Твой раб и Твой Посланник.",
        "fa": "بار الها، من شامگاهان شدم و تو را گواه میگیرم، و حاملان عرش تو، و فرشتگانت، و تمام خلقتت را گواه میگیرم، که تو همان الله هستی، هیچ معبودی جز تو نیستی، یکتایی و شریکی نداری، و محمد بنده و رسول توست.",
        "hi": "ऐ अल्लाह, मैं शाम में दाखिल हुआ हूँ और मैं तुझे गवाह बनाता हूँ, और तेरे अर्श के उठाने वालों को, और तेरे फरिश्तों को, और तेरी तमाम मखलूक को गवाह बनाता हूँ कि तू ही अल्लाह है, तेरे सिवा कोई माबूद नहीं, तू अकेला है, तेरा कोई शरीक नहीं, और मुहम्मद तेरा बंदा और तेरा रसूल है।",
        "ms": "Ya Allah, sungguh aku telah memasuki waktu petang. Aku bersaksi kepada-Mu, dan aku bersaksi kepada para pemikul Arasy-Mu, para malaikat-Mu, dan seluruh makhluk-Mu, bahawasanya Engkau adalah Allah, tiada Tuhan yang berhak disembah melainkan Engkau sendiri, tiada sekutu bagi-Mu, dan sesungguhnya Muhammad adalah hamba-Mu dan Rasul-Mu.",
        "sw": "Ee Allah, nimeingia jioni na ninaishuhudia Wewe, na ninashuhudia wabebaji wa Arshi Yako, na malaika Wako, na viumbe Vyako vyote, kwamba Wewe ndiye Allah, hakuna mungu ila Wewe peke Yako, huna washirika, na kwamba Muhammad ni mja Wako na Mtume Wako.",
        "bn": "হে আল্লাহ, আমি সন্ধ্যায় প্রবেশ করেছি এবং আমি আপনাকে সাক্ষী রাখছি, এবং আপনার আরশের বাহকদের, আপনার ফেরেশতাদের, এবং আপনার সমস্ত সৃষ্টিকে সাক্ষী রাখছি যে, আপনিই আল্লাহ, আপনি ছাড়া কোন ইলাহ নেই, আপনি একক, আপনার কোন শরীক নেই, এবং মুহাম্মদ আপনার বান্দা ও আপনার রাসূল।"
      }
    },
    {
      "id": "evening_005",
      "arabic": "اللَّهُمَّ مَا أَمْسَى بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
      "transliteration": "Allahumma ma amsa bee min ni'matin aw bi ahadin min khalqika fa minka wahdaka la shareeka laka, falakal-hamdu wa lakash-shukr.",
      "repeat": 1,
      "source": "Sunan Abu Dawud",
      "translations": {
        "en": "O Allah, whatever blessing has come to me or to any of Your creation in the evening, it is from You alone, You have no partners. So all praise is due to You, and all thanks are due to You.",
        "ar": "اللَّهُمَّ مَا أَمْسَى بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
        "id": "Ya Allah, nikmat apa pun yang aku dapati di waktu petang ini, atau yang didapati oleh salah seorang dari makhluk-Mu, maka itu semua dari-Mu semata, tiada sekutu bagi-Mu. Maka bagi-Mu segala puji dan bagi-Mu segala syukur.",
        "ur": "اے اللہ، جو بھی نعمت مجھے یا تیری مخلوق میں سے کسی کو شام میں ملی، وہ صرف تجھ سے ہے، تیرا کوئی شریک نہیں۔ پس تمام تعریفیں تیرے لیے ہیں، اور تمام شکر تیرے لیے ہے۔",
        "tr": "Allah'ım! Benimle veya yaratıklarından herhangi biriyle akşama ulaşan her nimet yalnız sendendir, ortağın yoktur. Hamd da şükür de sanadır.",
        "fr": "Ô Allah, toute bénédiction qui m'est parvenue ou à l'une de Tes créatures dans la soirée, elle vient de Toi seul, Tu n'as pas d'associés. Donc, toute louange est à Toi, et toute gratitude est à Toi.",
        "ru": "О Аллах, какое бы благо ни постигло меня или кого-либо из Твоих творений вечером, это только от Тебя одного, у Тебя нет сотоварищей. Так вся хвала принадлежит Тебе, и вся благодарность принадлежит Тебе.",
        "fa": "بار الها، هر نعمتی که در این شامگاهان به من یا به یکی از آفریدگانت رسیده، تنها از توست و شریکی نداری. پس حمد و شکر از آنِ توست.",
        "hi": "ऐ अल्लाह, जो भी नेमत मुझे या तेरी मखलूक में से किसी को शाम में मिली, वह सिर्फ तुझसे है, तेरा कोई शरीक नहीं। पस तमाम तारीफें तेरे लिए हैं, और तमाम शुक्रिया तेरे लिए है।",
        "ms": "Ya Allah, nikmat apa pun yang aku dapati di waktu petang ini, atau yang didapati oleh salah seorang dari makhluk-Mu, maka itu semua dari-Mu semata, tiada sekutu bagi-Mu. Maka bagi-Mu segala puji dan bagi-Mu segala syukur.",
        "sw": "Ee Allah, neema yoyote iliyonifikia mimi au kiumbe Chako chochote jioni, inatoka Kwako peke Yako, huna washirika. Hivyo sifa zote ni zako, na shukrani zote ni zako.",
        "bn": "হে আল্লাহ, সন্ধ্যাবেলা আমার প্রতি বা আপনার সৃষ্টির কারো প্রতি যে কোন অনুগ্রহ এসেছে, তা আপনার পক্ষ থেকে এককভাবে এসেছে, আপনার কোন শরীক নেই। সুতরাং সমস্ত প্রশংসা আপনার জন্য, এবং সমস্ত কৃতজ্ঞতা আপনার জন্য।"
      }
    },
    {
      "id": "evening_006",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
      "transliteration": "Allahumma innee a'oodhu bika minal-hammi wal-hazani, wa a'oodhu bika minal-'ajzi wal-kasali, wa a'oodhu bika minal-jubni wal-bukhli, wa a'oodhu bika min ghalabatid-dayni wa qahrir-rijaal.",
      "repeat": 1,
      "source": "Sahih Al-Bukhari",
      "translations": {
        "en": "O Allah, I seek refuge with You from anxiety and sorrow, and I seek refuge with You from helplessness and laziness, and I seek refuge with You from cowardice and stinginess, and I seek refuge with You from the burden of debt and from being overpowered by men.",
        "ar": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
        "id": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kegelisahan dan kesedihan, dan aku berlindung kepada-Mu dari kelemahan dan kemalasan, dan aku berlindung kepada-Mu dari sifat pengecut dan kikir, dan aku berlindung kepada-Mu dari belitan hutang dan paksaan orang.",
        "ur": "اے اللہ، میں غم اور رنج سے تیری پناہ مانگتا ہوں، اور میں عاجزی اور سستی سے تیری پناہ مانگتا ہوں، اور میں بزدلی اور بخل سے تیری پناہ مانگتا ہوں، اور میں قرض کے بوجھ اور لوگوں کے تسلط سے تیری پناہ مانگتا ہوں۔",
        "tr": "Allah'ım! Üzüntüden ve kederden sana sığınırım. Acizlikten ve tembellikten sana sığınırım. Korkaklıktan ve cimrilikten sana sığınırım. Borç altında ezilmekten ve insanların baskısından sana sığınırım.",
        "fr": "Ô Allah, je cherche refuge auprès de Toi contre l'anxiété et la tristesse, et je cherche refuge auprès de Toi contre l'impuissance et la paresse, et je cherche refuge auprès de Toi contre la lâcheté et l'avarice, et je cherche refuge auprès de Toi contre le fardeau de la dette et la domination des hommes.",
        "ru": "О Аллах, я прибегаю к Тебе от беспокойства и печали, и я прибегаю к Тебе от бессилия и лени, и я прибегаю к Тебе от трусости и скупости, и я прибегаю к Тебе от бремени долга и от подавления людьми.",
        "fa": "بار الها، من از غم و اندوه به تو پناه میبرم، و از ناتوانی و تنبلی به تو پناه میبرم، و از بزدلی و بخل به تو پناه میبرم، و از سنگینی بدهی و از غلبه مردان به تو پناه میبرم.",
        "hi": "ऐ अल्लाह, मैं तेरी पनाह मांगता हूँ चिंता और दुख से, और मैं तेरी पनाह मांगता हूँ बेबसी और आलस्य से, और मैं तेरी पनाह मांगता हूँ कायरता और कंजूसी से, और मैं तेरी पनाह मांगता हूँ कर्ज के बोझ और लोगों के दमन से।",
        "ms": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kegelisahan dan kesedihan, dan aku berlindung kepada-Mu dari kelemahan dan kemalasan, dan aku berlindung kepada-Mu dari sifat pengecut dan kikir, dan aku berlindung kepada-Mu dari belitan hutang dan paksaan orang.",
        "sw": "Ee Allah, najilinda Kwako kutokana na wasiwasi na huzuni, na najilinda Kwako kutokana na udhaifu na uvivu, na najilinda Kwako kutokana na woga na ubahili, na najilinda Kwako kutokana na mzigo wa deni na kukandamizwa na watu.",
        "bn": "হে আল্লাহ, আমি আপনার কাছে দুশ্চিন্তা ও দুঃখ থেকে আশ্রয় চাই, এবং আমি আপনার কাছে অক্ষমতা ও অলসতা থেকে আশ্রয় চাই, এবং আমি আপনার কাছে ভীরুতা ও কৃপণতা থেকে আশ্রয় চাই, এবং আমি আপনার কাছে ঋণের ভার এবং মানুষের আধিপত্য থেকে আশ্রয় চাই।"
      }
    },
    {
      "id": "evening_007",
      "arabic": "بِسْمِ اللَّهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ.",
      "transliteration": "Bismillahi alladhi la yadurru ma'a ismihi shay'un fil-ardi wa la fis-sama'i wa Huwas-Samee'ul-'Aleem.",
      "repeat": 3,
      "source": "Sunan Abu Dawud and Jami' At-Tirmidhi",
      "translations": {
        "en": "In the Name of Allah with Whose Name nothing on earth or in the heavens can cause harm, and He is the All-Hearing, the All-Knowing.",
        "ar": "بِسْمِ اللَّهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ.",
        "id": "Dengan nama Allah yang dengan nama-Nya tidak ada sesuatu pun di bumi maupun di langit yang dapat membahayakan, dan Dia Maha Mendengar lagi Maha Mengetahui.",
        "ur": "اللہ کے نام سے جس کے نام کے ساتھ زمین میں اور آسمان میں کوئی چیز نقصان نہیں پہنچا سکتی اور وہ سننے والا، جاننے والا ہے۔",
        "tr": "Adı anıldığında yerde ve gökte hiçbir şeyin zarar veremeyeceği Allah’ın adıyla. O, her şeyi işiten, her şeyi bilendir.",
        "fr": "Au Nom d'Allah, avec Son Nom rien sur terre ni dans les cieux ne peut causer de tort, et Il est l'Audient, l'Omniscient.",
        "ru": "Во имя Аллаха, с именем Которого ничто на земле и на небесах не причинит вреда, и Он Всеслышащий, Всезнающий.",
        "fa": "به نام خداوندی که با نام او هیچ چیز در زمین و آسمان زیان نمیرساند و او شنوا و داناست.",
        "hi": "अल्लाह के नाम से, जिसके नाम के साथ ज़मीन में और आसमान में कोई चीज़ नुकसान नहीं पहुँचा सकती, और वह सब कुछ सुनने वाला, सब कुछ जानने वाला है।",
        "ms": "Dengan nama Allah yang dengan nama-Nya tidak ada sesuatu pun di bumi mahupun di langit yang dapat membahayakan, dan Dia Maha Mendengar lagi Maha Mengetahui.",
        "sw": "Kwa jina la Allah ambaye kwa jina Lake hakuna chochote duniani wala mbinguni kinachoweza kudhuru, na Yeye ni Mwenye kusikia yote, Mjuzi wa yote.",
        "bn": "আল্লাহর নামে, যার নামের সাথে আকাশ ও পৃথিবীতে কোন কিছুই ক্ষতি করতে পারে না, এবং তিনিই সর্বশ্রোতা, সর্বজ্ঞ।"
      }
    },
    {
      "id": "evening_008",
      "arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالإِسْلامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا.",
      "transliteration": "Radheetu billahi Rabban, wa bil-Islami deenan, wa bi Muhammadin Nabiyyan.",
      "repeat": 3,
      "source": "Musnad Ahmad",
      "translations": {
        "en": "I am pleased with Allah as my Lord, and with Islam as my religion, and with Muhammad as my Prophet.",
        "ar": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالإِسْلامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا.",
        "id": "Aku rela Allah sebagai Tuhanku, Islam sebagai agamaku, dan Muhammad sebagai Nabiku.",
        "ur": "میں اللہ کو رب، اسلام کو دین، اور محمد کو نبی مان کر راضی ہوا۔",
        "tr": "Allah'ı Rab, İslam'ı din, Muhammed'i de Nebi olarak kabul ettim ve bunlardan razı oldum.",
        "fr": "Je suis satisfait d'Allah comme mon Seigneur, et de l'Islam comme ma religion, et de Muhammad comme mon Prophète.",
        "ru": "Я доволен Аллахом как Господом, и Исламом как религией, и Мухаммадом как Пророком.",
        "fa": "خشنودم به الله به عنوان پروردگار، و به اسلام به عنوان دین، و به محمد به عنوان پیامبر.",
        "hi": "मैं अल्लाह को रब मानकर, इस्लाम को दीन मानकर, और मुहम्मद को नबी मानकर राज़ी हूँ।",
        "ms": "Aku redha Allah sebagai Tuhanku, Islam sebagai agamaku, dan Muhammad sebagai Nabiku.",
        "sw": "Nimeridhika na Allah kama Mola wangu, na Uislamu kama dini yangu, na Muhammad kama Mtume wangu.",
        "bn": "আমি আল্লাহকে রব হিসাবে, ইসলামকে দ্বীন হিসাবে, এবং মুহাম্মাদকে নবী হিসাবে সন্তুষ্ট।"
      }
    },
    {
      "id": "evening_009",
      "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.",
      "transliteration": "Subhanallahi wa bihamdihi.",
      "repeat": 100,
      "source": "Sahih Muslim",
      "translations": {
        "en": "Glorified is Allah and praised is He.",
        "ar": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.",
        "id": "Maha Suci Allah dan dengan segala puji bagi-Nya.",
        "ur": "اللہ پاک ہے اور تمام تعریفیں اسی کے لیے ہیں۔",
        "tr": "Allah'ı hamdiyle tesbih ederim.",
        "fr": "Gloire à Allah et louange à Lui.",
        "ru": "Пречист Аллах и хвала Ему.",
        "fa": "پاک است الله و ستایش از آنِ اوست.",
        "hi": "अल्लाह पाक है और तमाम तारीफें उसी के लिए हैं।",
        "ms": "Maha Suci Allah dan dengan segala puji bagi-Nya.",
        "sw": "Utukufu ni wa Allah na sifa zote ni zake.",
        "bn": "আল্লাহ পবিত্র এবং তাঁর প্রশংসা।"
      }
    },
    {
      "id": "evening_010",
      "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
      "transliteration": "Ya Hayyu Ya Qayyoomu, bi rahmatika astagheethu, aslih li sha'nee kullahu, wa la takilnee ila nafsi tarfata 'ayn.",
      "repeat": 1,
      "source": "Sunan An-Nasa'i",
      "translations": {
        "en": "O Ever-Living, O Sustainer, by Your mercy I seek assistance, rectify all my affairs, and do not leave me to myself even for the blink of an eye.",
        "ar": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
        "id": "Wahai Yang Maha Hidup, wahai Yang Maha Berdiri Sendiri, dengan rahmat-Mu aku memohon pertolongan, perbaikilah segala urusanku, dan janganlah Engkau serahkan diriku kepada diriku sendiri sekejap mata pun.",
        "ur": "اے زندہ، اے قائم رہنے والے، تیری رحمت کے ذریعے میں مدد چاہتا ہوں، میرے تمام معاملات درست کر دے، اور مجھے ایک لمحے کے لیے بھی میرے نفس کے حوالے نہ کر۔",
        "tr": "Ey Hayy ve Kayyum olan Allah'ım! Rahmetinle yardım istiyorum. Bütün işlerimi ıslah et ve beni bir göz açıp kapayıncaya kadar bile olsa nefsimle baş başa bırakma.",
        "fr": "Ô le Vivant, Ô le Subsistant par Soi-même, par Ta miséricorde je demande de l'aide, arrange toutes mes affaires, et ne me laisse pas à moi-même ne serait-ce que le temps d'un clin d'œil.",
        "ru": "О Живой, о Поддерживающий! По Твоей милости я взываю о помощи, исправь все мои дела и не оставляй меня наедине с моей душой даже на мгновение ока.",
        "fa": "ای زنده، ای پایدار، به رحمتت یاری میجویم، تمام امورم را اصلاح کن، و مرا حتی به اندازه یک چشم برهم زدن به خودم وامگذار.",
        "hi": "ऐ ज़िंदा, ऐ कायम रहने वाले, तेरी रहमत के ज़रिए मैं मदद चाहता हूँ, मेरे तमाम मामले दुरुस्त कर दे, और मुझे पलक झपकने की भी देर के लिए मेरे नफ़्स के हवाले न कर।",
        "ms": "Wahai Yang Maha Hidup, wahai Yang Maha Berdiri Sendiri, dengan rahmat-Mu aku memohon pertolongan, perbaikilah segala urusanku, dan janganlah Engkau serahkan diriku kepada diriku sendiri sekelip mata pun.",
        "sw": "Ee Hai, Ee Qayyum, kwa rehema Yako ninaomba msaada, nirekebishie mambo yangu yote, na usiniachie nafsi yangu hata kwa kufumba na kufumbua jicho.",
        "bn": "হে চিরঞ্জীব, হে সর্বসত্ত্বাধারক, আপনার রহমতে আমি সাহায্য প্রার্থনা করি, আমার সমস্ত কাজ সংশোধন করে দিন এবং আমাকে এক মুহূর্তের জন্যও আমার নিজের উপর ছেড়ে দেবেন না।"
      }
    },
    {
      "id": "evening_011",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
      "transliteration": "Allahumma innee a'oodhu bika min sharri kulli dabbatin anta akhidhun bi nasinatiha, inna Rabbi 'ala siratim mustaqeem.",
      "repeat": 1,
      "source": "Sahih Muslim",
      "translations": {
        "en": "O Allah, I seek refuge with You from the evil of every moving creature whose forelock You hold. Indeed, my Lord is on a straight path.",
        "ar": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
        "id": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari keburukan setiap makhluk bergerak yang ubun-ubunnya ada di tangan-Mu. Sesungguhnya Tuhanku berada di atas jalan yang lurus.",
        "ur": "اے اللہ، میں تجھ سے ہر اس جاندار کے شر سے پناہ مانگتا ہوں جس کی پیشانی تو پکڑے ہوئے ہے۔ بے شک میرا رب سیدھے راستے پر ہے۔",
        "tr": "Allah'ım! Alnından tuttuğun her canlının şerrinden sana sığınırım. Şüphesiz Rabbim doğru bir yol üzerindedir.",
        "fr": "Ô Allah, je cherche refuge auprès de Toi contre le mal de toute créature dont Tu tiens le toupet. En vérité, mon Seigneur est sur un chemin droit.",
        "ru": "О Аллах, я прибегаю к Тебе от зла всякого движущегося существа, чью челку Ты держишь. Воистину, мой Господь на прямом пути.",
        "fa": "بار الها، من از شر هر جنبنده ای که تو گیسویش را گرفته ای به تو پناه میبرم. همانا پروردگار من بر راهی راست است.",
        "hi": "ऐ अल्लाह, मैं तेरी पनाह मांगता हूँ हर उस चलने-फिरने वाले प्राणी के शर से जिसकी पेशानी तू पकड़े हुए है। बेशक मेरा रब सीधे रास्ते पर है।",
        "ms": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari keburukan setiap makhluk bergerak yang ubun-ubunnya ada di tangan-Mu. Sesungguhnya Tuhanku berada di atas jalan yang lurus.",
        "sw": "Ee Allah, najilinda Kwako kutokana na shari ya kila kiumbe kinachotembea ambacho Wewe unakishika paji la uso wake. Hakika Mola wangu yuko kwenye njia iliyonyooka.",
        "bn": "হে আল্লাহ, আমি আপনার কাছে প্রতিটি চলমান প্রাণীর অনিষ্ট থেকে আশ্রয় চাই, যার কপাল আপনার হাতে। নিশ্চয়ই আমার রব সরল পথে আছেন।"
      }
    },
    {
      "id": "evening_012",
      "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
      "transliteration": "A'udhu bi kalimatillahit-tammaati min sharri ma khalaqa.",
      "repeat": 3,
      "source": "Sahih Muslim",
      "translations": {
        "en": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
        "ar": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
        "id": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari keburukan apa yang Dia ciptakan.",
        "ur": "میں اللہ کے مکمل کلمات کے ذریعے اس کی پیدا کردہ چیزوں کے شر سے پناہ مانگتا ہوں۔",
        "tr": "Allah'ın tam kelimelerine, yarattığı şeylerin şerrinden sığınırım.",
        "fr": "Je cherche refuge par les paroles parfaites d'Allah contre le mal de ce qu'Il a créé.",
        "ru": "Я прибегаю к совершенным словам Аллаха от зла того, что Он сотворил.",
        "fa": "به کلمات کامل خداوند از شر آنچه آفریده پناه میبرم.",
        "hi": "मैं अल्लाह के संपूर्ण शब्दों के द्वारा उसकी बनाई हुई चीज़ों के शर से पनाह मांगता हूँ।",
        "ms": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari keburukan apa yang Dia ciptakan.",
        "sw": "Najilinda kwa maneno kamili ya Allah kutokana na shari ya alivyoviumba.",
        "bn": "আমি আল্লাহর পরিপূর্ণ বাক্যসমূহের দ্বারা তিনি যা সৃষ্টি করেছেন তার অনিষ্ট থেকে আশ্রয় চাই।"
      }
    },
    {
      "id": "evening_013",
      "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ.",
      "transliteration": "Allahumma salli wa sallim 'ala nabiyyina Muhammad.",
      "repeat": 10,
      "source": "Sahih Muslim",
      "translations": {
        "en": "O Allah, send blessings and peace upon our Prophet Muhammad.",
        "ar": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ.",
        "id": "Ya Allah, limpahkanlah rahmat dan salam kepada Nabi kami Muhammad.",
        "ur": "اے اللہ، ہمارے نبی محمد پر درود و سلام بھیج۔",
        "tr": "Allah'ım! Peygamberimiz Muhammed'e salat ve selam eyle.",
        "fr": "Ô Allah, prie et salue notre Prophète Muhammad.",
        "ru": "О Аллах, благослови и приветствуй нашего Пророка Мухаммада.",
        "fa": "بار الها، بر پیامبر ما محمد درود و سلام فرست.",
        "hi": "ऐ अल्लाह, हमारे नबी मुहम्मद पर दुरूद और सलाम भेज।",
        "ms": "Ya Allah, limpahkanlah selawat dan salam ke atas Nabi kami Muhammad.",
        "sw": "Ee Allah, mrehemu na umpe amani Mtume wetu Muhammad.",
        "bn": "হে আল্লাহ, আমাদের নবী মুহাম্মাদের উপর রহমত ও শান্তি বর্ষণ করুন।"
      }
    },
    {
      "id": "evening_014",
      "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.",
      "transliteration": "Qul Huwallahu Ahad. Allahus-Samad. Lam yalid wa lam yoolad. Wa lam yakullahu kufuwan Ahad.",
      "repeat": 3,
      "source": "Surah Al-Ikhlas",
      "translations": {
        "en": "Say, 'He is Allah, [the] One, Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.'",
        "ar": "قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.",
        "id": "Katakanlah, 'Dia-lah Allah, Yang Maha Esa. Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu. Dia tiada beranak dan tiada pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia.'",
        "ur": "کہہ دیجیے: وہ اللہ ایک ہے، اللہ بے نیاز ہے، نہ اس نے جنا، نہ وہ جنا گیا، اور نہ ہی اس کا کوئی ہمسر ہے۔",
        "tr": "De ki: 'O, Allah'tır, bir tektir. Allah Samed'dir (her şey O'na muhtaç, O hiçbir şeye muhtaç değildir). Doğurmamış ve doğurulmamıştır. Hiçbir şey O'na denk değildir.'",
        "fr": "Dis : 'Il est Allah, Unique. Allah, Le Seul à être imploré pour ce que nous désirons. Il n'a jamais engendré, n'a pas été engendré non plus. Et nul n'est égal à Lui.'",
        "ru": "Скажи: 'Он – Аллах, Единственный, Аллах – Самодостаточный. Он не родил и не был рожден, и нет никого, равного Ему.'",
        "fa": "بگو: 'او الله یکتاست. الله بی‌نیاز است. نزاده و زاده نشده است. و هیچ کس همتای او نبوده است.'",
        "hi": "कहो: 'वह अल्लाह एक है, अल्लाह बे-नियाज़ है। न उसने जना, न वह जना गया, और न ही उसका कोई हमसर है।'",
        "ms": "Katakanlah: 'Dia-lah Allah, Yang Maha Esa. Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu. Dia tiada beranak dan tiada pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia.'",
        "sw": "Sema: 'Yeye ni Allah, Mmoja. Allah, Mwenye kujitegemea. Hakuzaliwa, wala hakuzaliwa, wala hakuna yeyote anayefanana Naye.'",
        "bn": "বলুন: 'তিনি আল্লাহ, এক ও অদ্বিতীয়। আল্লাহ স্বনির্ভর। তিনি কাউকে জন্ম দেননি এবং তাঁকেও জন্ম দেওয়া হয়নি। এবং তাঁর সমকক্ষ কেউ নেই।'"
      }
    },
    {
      "id": "evening_015",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
      "transliteration": "Qul a'oodhu bi Rabbil-falaq. Min sharri ma khalaq. Wa min sharri ghasiqin idha waqab. Wa min sharrin-naffathaati fil-'uqad. Wa min sharri haasidin idha hasad.",
      "repeat": 3,
      "source": "Surah Al-Falaq",
      "translations": {
        "en": "Say, 'I seek refuge in the Lord of daybreak, from the evil of what He has created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.'",
        "ar": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
        "id": "Katakanlah, 'Aku berlindung kepada Tuhan yang menguasai subuh, dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gulita, dan dari kejahatan wanita-wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila ia dengki.'",
        "ur": "کہہ دیجیے: میں صبح کے رب کی پناہ مانگتا ہوں، اس کی مخلوق کے شر سے، اور اندھیری رات کے شر سے جب وہ چھا جائے، اور گرہوں میں پھونکنے والیوں کے شر سے، اور حسد کرنے والے کے شر سے جب وہ حسد کرے۔",
        "tr": "De ki: 'Sabahın Rabbine sığınırım, yarattığı şeylerin şerrinden, karanlığı çöktüğü zaman gecenin şerrinden, düğümlere üfleyenlerin şerrinden ve haset ettiği zaman hasetçinin şerrinden.'",
        "fr": "Dis : 'Je cherche protection auprès du Seigneur de l'aube naissante, contre le mal des êtres qu'Il a créés, contre le mal de l'obscurité quand elle s'approfondit, contre le mal de celles qui soufflent sur les nœuds, et contre le mal de l'envieux quand il envie.'",
        "ru": "Скажи: 'Я прибегаю к Господу рассвета, от зла того, что Он сотворил, и от зла мрака, когда он опускается, и от зла колдуний, дующих на узлы, и от зла завистника, когда он завидует.'",
        "fa": "بگو: 'پناه میبرم به پروردگار سپیده‌دم، از شر آنچه آفریده، و از شر تاریکی هنگامی که درآید، و از شر زنان جادوگر که بر گره‌ها می دمند، و از شر حسود هنگامی که حسد می ورزد.'",
        "hi": "कहो: 'मैं सुबह के रब की पनाह मांगता हूँ, उसकी मखलूक के शर से, और अँधेरी रात के शर से जब वह छा जाए, और गाँठों में फूंकने वालीयों के शर से, और हसद करने वाले के शर से जब वह हसद करे।'",
        "ms": "Katakanlah: 'Aku berlindung kepada Tuhan yang menguasai subuh, dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gulita, dan dari kejahatan wanita-wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila ia dengki.'",
        "sw": "Sema: 'Najikinga kwa Mola wa mapambazuko, kutokana na shari ya alivyoviumba, na kutokana na shari ya giza linapoingia, na kutokana na shari ya wanaopulizia kwenye mafundo, na kutokana na shari ya mwenye husuda anapohusudu.'",
        "bn": "বলুন: 'আমি ফজর এর রবের আশ্রয় চাই, তিনি যা সৃষ্টি করেছেন তার অনিষ্ট থেকে, এবং অন্ধকারের অনিষ্ট থেকে যখন তা গভীর হয়, এবং গাঁটগুলিতে ফুঁক দানকারিনীদের অনিষ্ট থেকে, এবং হিংসুক যখন হিংসা করে তার অনিষ্ট থেকে।'"
      }
    },
    {
      "id": "evening_016",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ.",
      "transliteration": "Qul a'oodhu bi Rabbin-naas. Malikin-naas. Ilaahin-naas. Min sharril-waswasil-khannas. Alladhee yuwaswisu fee sudoorin-naas. Minal-jinnati wan-naas.",
      "repeat": 3,
      "source": "Surah An-Nas",
      "translations": {
        "en": "Say, 'I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer - who whispers into the chests of mankind - from among the jinn and mankind.'",
        "ar": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ.",
        "id": "Katakanlah, 'Aku berlindung kepada Tuhan manusia, Raja manusia, Sembahan manusia, dari kejahatan (bisikan) syaitan yang biasa bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari golongan jin dan manusia.'",
        "ur": "کہہ دیجیے: میں لوگوں کے رب کی پناہ مانگتا ہوں، لوگوں کے بادشاہ کی، لوگوں کے معبود کی، چھپ کر بار بار وسوسہ ڈالنے والے کے شر سے، جو لوگوں کے سینوں میں وسوسہ ڈالتا ہے، جنوں میں سے اور انسانوں میں سے۔",
        "tr": "De ki: 'İnsanların Rabbine sığınırım, insanların Malikine, insanların İlahına, sinsi vesvesecinin şerrinden, ki o, insanların sinelerine vesvese verir, cinlerden ve insanlardan.'",
        "fr": "Dis : 'Je cherche protection auprès du Seigneur des hommes, le Souverain des hommes, la Divinité des hommes, contre le mal du mauvais conseiller, furtif, qui souffle le mal dans les poitrines des hommes, qu'il soit parmi les djinns ou les hommes.'",
        "ru": "Скажи: 'Я прибегаю к Господу людей, Царю людей, Богу людей, от зла наущателя отступающего, который наущает в груди людей, из числа джиннов и людей.'",
        "fa": "بگو: 'پناه میبرم به پروردگار مردم، پادشاه مردم، معبود مردم، از شر وسوسه‌گر پنهان شونده، که در سینه‌های مردم وسوسه می کند، چه از جن و چه از انسان.'",
        "hi": "कहो: 'मैं लोगों के रब की पनाह मांगता हूँ, लोगों के बादशाह की, लोगों के माबूद की, छिप कर बार-बार वसवसा डालने वाले के शर से, जो लोगों के सीनों में वसवसा डालता है, जिन्न और इन्सानों में से।'",
        "ms": "Katakanlah: 'Aku berlindung kepada Tuhan manusia, Raja manusia, Sembahan manusia, dari kejahatan (bisikan) syaitan yang biasa bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari golongan jin dan manusia.'",
        "sw": "Sema: 'Najikinga kwa Mola wa wanadamu, Mfalme wa wanadamu, Mungu wa wanadamu, kutokana na shari ya mpuliziaji mnyama, ambaye anapulizia vifua vya wanadamu, miongoni mwa majini na wanadamu.'",
        "bn": "বলুন: 'আমি মানুষের রবের আশ্রয় চাই, মানুষের বাদশাহর, মানুষের ইলাহের, লুকানো ওয়াসওয়াসাকারীর অনিষ্ট থেকে - যে মানুষের অন্তরে কুমন্ত্রণা দেয় - জিন ও মানুষের মধ্য থেকে।'"
      }
    },
    {
      "id": "evening_017",
      "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لا إِلَهَ إِلا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ.",
      "transliteration": "Allahumma 'alimal-ghaybi wash-shahadah, fatiras-samawati wal-ard, rabba kulli shay'in wa maleekahu, ash-hadu an la ilaha illa anta, a'oodhu bika min sharri nafsee wa min sharrish-shaytani wa shirkihi.",
      "repeat": 1,
      "source": "Jami' At-Tirmidhi",
      "translations": {
        "en": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord of everything and its Sovereign. I bear witness that there is no god but You. I seek refuge in You from the evil of my soul and from the evil of Satan and his polytheism.",
        "ar": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لا إِلَهَ إِلا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ.",
        "id": "Ya Allah, Yang Maha Mengetahui yang gaib dan yang tampak, Pencipta langit dan bumi, Rabb segala sesuatu dan pemiliknya. Aku bersaksi bahwa tiada ilah yang berhak disembah kecuali Engkau. Aku berlindung kepada-Mu dari keburukan diriku dan dari keburukan setan dan kesyirikannya.",
        "ur": "اے اللہ، غیب اور حاضر کو جاننے والے، آسمانوں اور زمین کے پیدا کرنے والے، ہر چیز کے رب اور بادشاہ، میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں۔ میں تیری پناہ مانگتا ہوں اپنے نفس کے شر سے اور شیطان کے شر اور اس کے شرک سے۔",
        "tr": "Allah'ım! Gaybı ve âşikârı bilen, gökleri ve yeri yaratan, her şeyin Rabbi ve sahibi! Şahitlik ederim ki senden başka ilah yoktur. Nefsimin şerrinden, şeytanın şerrinden ve şirkinden sana sığınırım.",
        "fr": "Ô Allah, Connaisseur de l'invisible et du visible, Créateur des cieux et de la terre, Seigneur de toute chose et son Souverain. Je témoigne qu'il n'y a de dieu que Toi. Je cherche refuge auprès de Toi contre le mal de mon âme et contre le mal de Satan et de son polythéisme.",
        "ru": "О Аллах, Знающий сокровенное и явное, Создатель небес и земли, Господь всего и Его Владыка. Я свидетельствую, что нет бога, кроме Тебя. Я прибегаю к Тебе от зла моей души и от зла сатаны и его многобожия.",
        "fa": "بار الها، دانای غیب و شهود، پدیدآورنده آسمانها و زمین، پروردگار هر چیز و صاحب آن، گواهی می دهم که هیچ معبودی جز تو نیست. از شر نفس خود و از شر شیطان و شرکش به تو پناه میبرم.",
        "hi": "ऐ अल्लाह, ग़ैब और हाज़िर को जानने वाले, आसमानों और ज़मीन के पैदा करने वाले, हर चीज़ के रब और मालिक, मैं गवाही देता हूँ कि तेरे सिवा कोई माबूद नहीं। मैं तेरी पनाह माँगता हूँ अपने नफ़्स के शर से और शैतान के शर और उसके शिर्क से।",
        "ms": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata, Pencipta langit dan bumi, Tuhan segala sesuatu dan pemiliknya. Aku bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Engkau. Aku berlindung kepada-Mu dari keburukan diriku dan dari keburukan syaitan dan syiriknya.",
        "sw": "Ee Allah, Mjuzi wa yaliyofichwa na yaliyowazi, Muumba wa mbingu na ardhi, Mola wa kila kitu na Mwenye kumiliki. Nashuhudia kwamba hakuna mungu ila Wewe. Najilinda Kwako kutokana na shari ya nafsi yangu na kutokana na shari ya Shetani na ushirikina wake.",
        "bn": "হে আল্লাহ, দৃশ্য ও অদৃশ্যের জ্ঞাতা, আকাশ ও পৃথিবীর স্রষ্টা, প্রতিটি জিনিসের রব ও মালিক। আমি সাক্ষ্য দিচ্ছি যে, আপনি ছাড়া কোন ইলাহ নেই। আমি আপনার কাছে আমার আত্মার অনিষ্ট থেকে এবং শয়তান ও তার শিরকের অনিষ্ট থেকে আশ্রয় চাই।"
      }
    },
    {
      "id": "evening_018",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
      "transliteration": "Allahumma innee as'alukal-'afiyata fid-dunya wal-akhirah. Allahumma innee as'alukal-'afwa wal-'afiyata fee deenee wa dunyaya wa ahlee wa malee. Allahummas-tur 'awratee wa aamin raw'atee. Allahummah-faznee min bayni yadayya wa min khalfee wa 'an yameenee wa 'an shimalee wa min fawqee, wa a'oodhu bi 'azamatika an ughtala min tahtee.",
      "repeat": 1,
      "source": "Sunan Abu Dawud",
      "translations": {
        "en": "O Allah, I ask You for well-being in this world and the Hereafter. O Allah, I ask You for forgiveness and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, conceal my flaws and calm my fears. O Allah, protect me from before me and from behind me, from my right and from my left, and from above me, and I seek refuge in Your greatness from being unexpectedly harmed from beneath me.",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
        "id": "Ya Allah, sesungguhnya aku memohon kepada-Mu keselamatan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu ampunan dan keselamatan dalam agamaku, duniaku, keluargaku, dan hartaku. Ya Allah, tutuplah aibku dan tenangkanlah rasa takutku. Ya Allah, jagalah aku dari arah depanku, dari belakangku, dari kananku, dari kiriku, dan dari atasku, dan aku berlindung dengan keagungan-Mu dari ditenggelamkan dari bawahku.",
        "ur": "اے اللہ، میں تجھ سے دنیا اور آخرت میں عافیت مانگتا ہوں۔ اے اللہ، میں تجھ سے اپنے دین، دنیا، اہل و عیال اور مال میں معافی اور عافیت مانگتا ہوں۔ اے اللہ، میری عیبوں کو چھپا دے اور میرے خوف کو دور کر دے۔ اے اللہ، مجھے میرے سامنے سے، میرے پیچھے سے، میرے دائیں سے، میرے بائیں سے، اور میرے اوپر سے محفوظ رکھ، اور میں تیری عظمت کی پناہ مانگتا ہوں کہ مجھے میرے نیچے سے اچک لیا جائے۔",
        "tr": "Allah'ım! Dünya ve ahirette afiyet diliyorum. Allah'ım! Dinim, dünyam, ailem ve malım hakkında af ve afiyet diliyorum. Allah'ım! Ayıplarımı ört, korkularımı gider. Allah'ım! Önümden, arkamdan, sağımdan, solumdan ve üstümden beni koru. Alttan ansızın gelen felaketlerden senin azametine sığınırım.",
        "fr": "Ô Allah, je Te demande le bien-être dans ce monde et dans l'Au-delà. Ô Allah, je Te demande le pardon et le bien-être dans ma religion, mes affaires mondaines, ma famille et mes biens. Ô Allah, cache mes défauts et apaise mes peurs. Ô Allah, protège-moi de devant moi et de derrière moi, de ma droite et de ma gauche, et d'au-dessus de moi, et je cherche refuge par Ta grandeur contre le fait d'être attaqué par en-dessous de moi.",
        "ru": "О Аллах, я прошу Тебя о благополучии в этом мире и в Последней жизни. О Аллах, я прошу Тебя о прощении и благополучии в моей религии, моих мирских делах, моей семье и моем имуществе. О Аллах, скрой мои недостатки и успокой мои страхи. О Аллах, защити меня спереди, сзади, справа, слева и сверху, и я прибегаю к Твоему величию от того, чтобы меня поглотили снизу.",
        "fa": "بار الها، من از تو عافیت در دنیا و آخرت را میطلبم. بار الها، من از تو عفو و عافیت در دین و دنیایم و خانواده‌ام و مالم را میطلبم. بار الها، عیوبم را بپوشان و ترس‌هایم را آرام کن. بار الها، مرا از پیش رویم و از پشت سرم و از سمت راستم و از سمت چپم و از بالای سرم محافظت کن، و به عظمتت پناه میبرم از اینکه از زیر پایم غافلگیر شوم.",
        "hi": "ऐ अल्लाह, मैं तुझसे दुनिया और आख़िरत में आफ़ियत माँगता हूँ। ऐ अल्लाह, मैं तुझसे अपने दीन, दुनिया, परिवार और माल में माफ़ी और आफ़ियत माँगता हूँ। ऐ अल्लाह, मेरी ख़ामियों को छुपा दे और मेरे डर को दूर कर दे। ऐ अल्लाह, मुझे मेरे सामने से, मेरे पीछे से, मेरे दाएँ से, मेरे बाएँ से, और मेरे ऊपर से महफ़ूज़ रख, और मैं तेरी अज़मत की पनाह माँगता हूँ कि मुझे मेरे नीचे से अचानक नुकसान पहुँचे।",
        "ms": "Ya Allah, sesungguhnya aku memohon kepada-Mu kesejahteraan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu keampunan dan kesejahteraan dalam agamaku, duniaku, keluargaku, dan hartaku. Ya Allah, tutuplah aibku dan tenangkanlah ketakutanku. Ya Allah, jagalah aku dari hadapanku, dari belakangku, dari kananku, dari kiriku, dan dari atasku, dan aku berlindung dengan keagungan-Mu dari ditenggelamkan dari bawahku.",
        "sw": "Ee Allah, nakuomba salama katika dunia na Akhera. Ee Allah, nakuomba msamaha na salama katika dini yangu, dunia yangu, familia yangu, na mali yangu. Ee Allah, sitiri aibu zangu na utulize hofu zangu. Ee Allah, nilinde kutoka mbele yangu na kutoka nyuma yangu, na kutoka kulia kwangu na kutoka kushoto kwangu na kutoka juu yangu, na najilinda kwa ukuu Wako nisije nikagongwa kutoka chini yangu.",
        "bn": "হে আল্লাহ, আমি আপনার কাছে দুনিয়া ও আখিরাতে সুস্থতা চাই। হে আল্লাহ, আমি আপনার কাছে আমার দ্বীন, দুনিয়া, পরিবার এবং আমার সম্পদের মধ্যে ক্ষমা ও সুস্থতা চাই। হে আল্লাহ, আমার ত্রুটিগুলি ঢেকে দিন এবং আমার ভয় দূর করুন। হে আল্লাহ, আমাকে আমার সম্মুখ থেকে, আমার পিছন থেকে, আমার ডান দিক থেকে, আমার বাম দিক থেকে এবং আমার উপর থেকে রক্ষা করুন, এবং আমি আপনার মহানত্বের আশ্রয় চাই যেন আমি আমার নিচ থেকে অপ্রত্যাশিতভাবে ক্ষতিগ্রস্ত না হই।"
      }
    },
    {
      "id": "evening_019",
      "arabic": "أَمْسَيْنَا عَلَى فِطْرَةِ الْإِسْلامِ، وَعَلَى كَلِمَةِ الإِخْلاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ.",
      "transliteration": "Amsayna 'ala fitratil-Islam, wa 'ala kalimatil-ikhlaas, wa 'ala deeni nabiyyina Muhammad sallallahu 'alayhi wa sallam, wa 'ala millati abeena Ibraheema haneefan musliman wa ma kana minal-mushrikeen.",
      "repeat": 1,
      "source": "Musnad Ahmad",
      "translations": {
        "en": "We have entered the evening upon the natural disposition of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad (peace and blessings be upon him), and upon the creed of our father Abraham, inclining to truth, a Muslim, and he was not of the polytheists.",
        "ar": "أَمْسَيْنَا عَلَى فِطْرَةِ الْإِسْلامِ، وَعَلَى كَلِمَةِ الإِخْلاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ.",
        "id": "Kami telah memasuki waktu petang di atas fitrah Islam, di atas kalimat ikhlas, dan di atas agama Nabi kami Muhammad shallallahu 'alaihi wa sallam, serta di atas agama bapak kami Ibrahim yang lurus lagi muslim, dan dia bukanlah termasuk orang-orang musyrik.",
        "ur": "ہم نے شام کی فطرت اسلام پر، اور کلمہ اخلاص پر، اور ہمارے نبی محمد صلی اللہ علیہ وسلم کے دین پر، اور ہمارے باپ ابراہیم کے ملت پر جو خالص مسلمان تھے اور مشرکین میں سے نہ تھے۔",
        "tr": "İslam fıtratı üzerine, ihlas kelimesi üzerine, peygamberimiz Muhammed’in dinî üzerine ve babamız İbrahim’in hanif (hakka yönelen) ve Müslüman olan milletî üzere akşama erdik, o müşriklerden değildi.",
        "fr": "Nous sommes entrés dans la soirée sur la nature primordiale de l'Islam, et sur la parole de sincérité, et sur la religion de notre Prophète Muhammad (que la paix et les bénédictions d'Allah soient sur lui), et sur la voie de notre père Abraham, monothéiste, soumis, et il n'était pas du nombre des associateurs.",
        "ru": "Мы вступили в вечер, пребывая на естественном предрасположении Ислама, и на слове искренности, и на религии нашего Пророка Мухаммада (мир ему и благословение Аллаха), и на религии нашего отца Ибрахима, единобожника, покорного, и он не был из многобожников.",
        "fa": "شامگاهان شدیم بر فطرت اسلام، و بر کلمه اخلاص، و بر دین پیامبرمان محمد صلی الله علیه و سلم، و بر ملت پدرمان ابراهیم که یکتاپرست و مسلمان بود و از مشرکان نبود.",
        "hi": "हमने शाम की इस्लाम की फितरत पर, और इख़लास के कलमे पर, और हमारे नबी मुहम्मद सल्लल्लाहु अलैहि वसल्लम के दीन पर, और हमारे बाप इब्राहीम की मिल्लत पर जो हकीकी मुस्लिम थे और मुशरिकों में से नहीं थे।",
        "ms": "Kami telah memasuki waktu petang di atas fitrah Islam, di atas kalimah ikhlas, dan di atas agama Nabi kami Muhammad ﷺ, serta di atas agama bapa kami Ibrahim yang lurus lagi Muslim, dan dia bukanlah termasuk orang-orang musyrik.",
        "sw": "Tumeingia jioni kwa fitra ya Uislamu, na kwa neno la ikhlasi, na kwa dini ya Mtume wetu Muhammad (rehema na amani za Allah ziwe juu yake), na kwa mila ya baba yetu Ibrahim, aliyekuwa mwongofu Mwislamu na hakuwa miongoni mwa washirikina.",
        "bn": "আমরা সন্ধ্যায় প্রবেশ করেছি ইসলামের ফিতরাতের উপর, এবং ইখলাসের কালিমার উপর, এবং আমাদের নবী মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের দ্বীনের উপর, এবং আমাদের পিতা ইব্রাহিমের মিল্লাতের উপর, যিনি একনিষ্ঠ মুসলিম ছিলেন এবং মুশরিকদের অন্তর্ভুক্ত ছিলেন না।"
      }
    },
    {
      "id": "evening_020",
      "arabic": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ.",
      "transliteration": "Astaghfirullah wa atoobu ilayh.",
      "repeat": 100,
      "source": "Sahih Muslim",
      "translations": {
        "en": "I seek the forgiveness of Allah and repent to Him.",
        "ar": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ.",
        "id": "Aku memohon ampun kepada Allah dan bertaubat kepada-Nya.",
        "ur": "میں اللہ سے مغفرت طلب کرتا ہوں اور اس کی طرف توبہ کرتا ہوں۔",
        "tr": "Allah’tan bağışlanma diler ve O’na tevbe ederim.",
        "fr": "Je demande pardon à Allah et je me repens à Lui.",
        "ru": "Я прошу прощения у Аллаха и каюсь Ему.",
        "fa": "از خداوند آمرزش میطلبم و به سوی او باز میگردم.",
        "hi": "मैं अल्लाह से माफी मांगता हूँ और उसकी ओर तौबा करता हूँ।",
        "ms": "Aku memohon ampun kepada Allah dan bertaubat kepada-Nya.",
        "sw": "Naomba msamaha kwa Allah na ninatubu Kwake.",
        "bn": "আমি আল্লাহর কাছে ক্ষমা চাই এবং তাঁর কাছে তওবা করি।"
      }
    },
    {
      "id": "evening_021",
      "arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "transliteration": "A'udhu billahi minash-shaytanir-rajeem",
      "repeat": 1,
      "source": "Seeking refuge from Satan",
      "translations": {
        "en": "I seek refuge with Allah from the accursed Satan",
        "ar": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
        "id": "Aku berlindung kepada Allah dari setan yang terkutuk",
        "ur": "میں شیطان مردود سے اللہ کی پناہ مانگتا ہوں",
        "tr": "Kovulmuş şeytandan Allah'a sığınırım",
        "fr": "Je cherche refuge auprès d'Allah contre Satan le lapidé",
        "ru": "Я прибегаю к защите Аллаха от проклятого шайтана",
        "fa": "به خدا پناه می‌برم از شیطان رانده شده",
        "hi": "मैं शैतान मरदूद से अल्लाह की शरण मांगता हूं",
        "ms": "Aku berlindung kepada Allah daripada syaitan yang direjam",
        "sw": "Najikimbilia kwa Allah kutokana na Shetani aliyelaaniwa",
        "bn": "আমি বিতাড়িত শয়তান থেকে আল্লাহর আশ্রয় প্রার্থনা করছি"
      }
    },
    {
      "id": "evening_022",
      "arabic": "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.",
      "transliteration": "Aamanar-rasoolu bimaa unzila ilayhi mir-rabbihee wal-mu'minoon; kullun aamana billaahi wa malaa'ikatihee wa kutubihee wa rusulihee laa nufarriqu bayna ahadim-mir-rusulihee wa qaaloo sami'naa wa ata'naa ghufraanaka rabbanaa wa ilaykal-maseer. Laa yukallifullaahu nafsan illaa wus'ahaa; lahaa maa kasabat wa 'alayhaa mak-tasabat; rabbanaa laa tu'aakhithnaaa in naseenaaa aw akhta'naa; rabbanaa wa laa tahmil 'alaynaaa isran kamaa hamaltahoo 'alal-ladheena min qablinaa; rabbanaa wa laa tuhammilnaa maa laa taaqata lanaa bihee; wa'fu 'annaa waghfir lanaa warhamnaa; anta mawlaanaa fansurnaa 'alal-qawmil-kaafireen.",
      "repeat": 1,
      "source": "Surah Al-Baqarah (2:285-286)",
      "translations": {
        "en": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], 'We make no distinction between any of His messengers.' And they say, 'We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.' Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what it has gained, and it will bear [the consequence of] what it has earned. 'Our Lord, do not impose upon us blame if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.'",
        "ar": "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.",
        "id": "Rasul telah beriman kepada apa yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang yang beriman. Semuanya beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya dan rasul-rasul-Nya. (Mereka mengatakan): 'Kami tidak membeda-bedakan antara seorang pun dari rasul-rasul-Nya', dan mereka mengatakan: 'Kami dengar dan kami taat.' (Mereka berdoa): 'Ampunilah kami ya Tuhan kami dan kepada Engkaulah tempat kembali.' Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Ia mendapat pahala (dari kebajikan) yang diusahakannya dan ia mendapat siksa (dari kejahatan) yang dikerjakannya. (Mereka berdoa): 'Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami tersalah. Ya Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada orang-orang yang sebelum kami. Ya Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tak sanggup kami memikulnya. Beri ma'aflah kami; ampunilah kami; dan rahmatilah kami. Engkaulah Penolong kami, maka tolonglah kami terhadap kaum yang kafir.'",
        "ur": "رسول نے اس پر ایمان لایا جو اس کے رب کی طرف سے اس پر نازل کیا گیا، اور مومنوں نے بھی۔ سب اللہ پر، اس کے فرشتوں پر، اس کی کتابوں پر، اور اس کے رسولوں پر ایمان لائے، (کہتے ہیں) 'ہم اس کے رسولوں میں سے کسی ایک کے درمیان فرق نہیں کرتے।' اور انہوں نے کہا: 'ہم نے سنا اور اطاعت کی۔ اے ہمارے رب، تیری مغفرت چاہتے ہیں، اور تیری ہی طرف لوٹنا ہے۔' اللہ کسی جان کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا۔ اس کے لیے وہ ہے جو اس نے کمایا اور اس پر وہ ہے جو اس نے کمايا۔ 'اے ہمارے رب، اگر ہم بھول جائیں یا غلطی کریں تو ہمیں پکڑ نہ۔ اے ہمارے رب، اور ہم پر ایسا بوجھ نہ ڈال جیسا تو نے ہم سے پہلے والوں پر ڈالا تھا۔ اے ہمارے رب، اور ہم پر وہ بوجھ نہ ڈال جس کی ہمیں طاقت نہیں۔ اور ہمیں معاف کر دے؛ اور ہمیں بخش دے؛ اور ہم پر رحم فرما۔ تو ہی ہمارا مددگار ہے، پس کافر قوم پر ہمیں فتح عطا فرما۔",
        "tr": "Peygamber, Rabbinden kendisine indirilene iman etti, müminler de. Hepsi Allah'a, meleklerine, kitaplarına ve peygamberlerine iman ettiler. 'O'nun peygamberlerinden hiçbirini ayırt etmeyiz' dediler. Ve 'İşittik ve itaat ettik. Rabbimiz! Bağışlamanı dileriz, dönüş sanadır' dediler. Allah, hiçbir nefse gücünün yetmeyeceği yükü yüklemez. Herkesin kazandığı (iyilik) lehine, işlediği (kötülük) aleyhinedir. 'Rabbimiz! Unutur veya yanılırsak bizi sorumlu tutma. Rabbimiz! Bizden öncekilere yüklediğin gibi bize de ağır yük yükleme. Rabbimiz! Gücümüzün yetmediği şeyi bize yükleme. Bizi affet, bizi bağışla, bize acı. Sen bizim Mevla'mızsın. Kâfirler topluluğuna karşı bize yardım et.'",
        "fr": "Le Messager a cru en ce qui lui a été révélé de son Seigneur, et les croyants aussi : tous ont cru en Allah, en Ses Anges, à Ses Livres et en Ses Messagers; (ils disent) : 'Nous ne faisons aucune distinction entre Ses Messagers.' Et ils ont dit : 'Nous avons entendu et nous avons obéi. Pardonne-nous, Seigneur. C'est à Toi que sera le retour.' Allah n'impose à aucune âme une charge supérieure à sa capacité. Elle reçoit ce qu'elle a gagné et elle subit ce qu'elle a commis. Seigneur, ne nous châtie pas s'il nous arrive d'oublier ou de commettre une erreur. Seigneur ! Ne nous charge pas d'un fardeau lourd comme Tu as chargé ceux qui vécurent avant nous. Seigneur ! Ne nous impose pas ce que nous ne pouvons supporter. Efface nos fautes, pardonne-nous et fais-nous miséricorde. Tu es notre Maître, accorde-nous donc la victoire sur les peuples mécréants.",
        "ru": "Посланник уверовал в то, что ниспослано ему от его Господа, и верующие. Все уверовали в Аллаха, Его ангелов, Его Писания и Его посланников. (Они говорят): 'Мы не делаем различия между кем-либо из Его посланников.' И они говорят: 'Мы слышали и повиновались. Твоего прощения, Господь наш, и к Тебе возвращение.' Аллах не возлагает на душу ничего, кроме того, что ей по силам. Ей будет то, что она приобрела, и на ней будет то, что она совершила. 'Господь наш, не наказывай нас, если мы забыли или ошиблись. Господь наш, и не возлагай на нас бремя, подобное тому, которое Ты возложил на тех, кто был до нас. Господь наш, и не обременяй нас тем, что нам не под силу. И помилуй нас; и прости нас; и смилуйся над нами. Ты наш покровитель, так даруй нам победу над неверующими людьми.'",
        "fa": "پیامبر به آنچه از پروردگارش بر او نازل شده ایمان آورده است، و مؤمنان نیز. همه به الله، و فرشتگانش، و کتاب‌هایش، و پیامبرانش ایمان آورده‌اند، (می‌گویند): 'ما میان هیچ یک از پیامبرانش تفاوتی قائل نمی‌شویم.' و گفتند: 'شنیدیم و اطاعت کردیم. پروردگارا، آمرزش تو را میخواهیم، و بازگشت به سوی توست.' الله هیچ نفسی را جز به اندازه‌ی توانش مکلف نمیکند. هر چه کسب کرده به نفع اوست، و هر چه کسب کرده به ضرر اوست. 'پروردگارا، اگر فراموش کردیم یا اشتباه کردیم، ما را مؤاخذه نکن. پروردگارا، و باری سنگین بر دوش ما مگذار چنان که بر دوش پیشینیان ما گذاشتی. پروردگارا، و آنچه را که طاقتش را نداریم بر ما تحمیل نکن. و از ما درگذر؛ و ما را بیامرز؛ و بر ما رحم کن. تو مولای مایی، پس ما را بر قوم کافر یاری ده.'",
        "hi": "पैगंबर ने उस पर ईमान लाया जो उसके रब की तरफ़ से उस पर नाज़िल किया गया, और मोमिनों ने भी। सब अल्लाह पर, उसके फरिश्तों पर, उसकी किताबों पर, और उसके रसूलों पर ईमान लाए, (कहते हैं) 'हम उसके रसूलों में से किसी एक के दरमियान फ़र्क़ नहीं करते।' और उन्होंने कहा: 'हमने सुना और इताअत की। ऐ हमारे रब, तेरी मग़फ़िरत चाहते हैं, और तेरी ही तरफ़ लौटना है।' अल्लाह किसी जान को उसकी ताक़त से ज़्यादा तकलीफ़ नहीं देता। उसके लिए वह है जो उसने कमाया और उस पर वह है जो उसने कमाया। 'ऐ हमारे रब, अगर हम भूल जाएँ या ग़लती करें तो हमें पकड़ न। ऐ हमारे रब, और हम पर ऐसा बोझ न डाल जैसा तूने हमसे पहले वालों पर डाला था। ऐ हमारे रब, और हम पर वह बोझ न डाल जिसकी हमें ताक़त नहीं। और हमें माफ़ कर दे; और हमें बख़्श दे; और हम पर रहम फ़रमा। तू ही हमारा मददगार है, पस काफ़िर क़ौम पर हमें फ़तह अता फ़रमा।",
        "ms": "Rasulullah telah beriman kepada apa yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang yang beriman. Semuanya beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya dan rasul-rasul-Nya. (Mereka mengatakan): 'Kami tidak membeda-bedakan antara seorang pun dari rasul-rasul-Nya', dan mereka mengatakan: 'Kami dengar dan kami taat.' (Mereka berdoa): 'Ampunilah kami ya Tuhan kami dan kepada Engkaulah tempat kembali.' Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Ia mendapat pahala (dari kebajikan) yang diusahakannya dan ia mendapat siksa (dari kejahatan) yang dikerjakannya. (Mereka berdoa): 'Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami tersalah. Ya Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada orang-orang yang sebelum kami. Ya Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tak sanggup kami memikulnya. Beri ma'aflah kami; ampunilah kami; dan rahmatilah kami. Engkaulah Penolong kami, maka tolonglah kami terhadap kaum yang kafir.'",
        "sw": "Mtume ameamini yaliyoteremshwa kwake kutoka kwa Mola wake, na Waumini pia. Wote wameamini kwa Allah na Malaika Wake na Vitabu Vyake na Mitume Wake, (wakisea): 'Hatufanyi tofauti kati ya yeyote kati ya Mitume Wake.' Na wamesema: 'Tumesikia na tumetii. Tunakuomba msamaha, Mola wetu, na Kwako ndiyo marejeo.' Allah haibebeshi nafsi yoyote isipokuwa (kwa yale yaliyo ndani ya) uwezo wake. Itapata (matokeo ya) yale iliyoyachuma, na itabeba (matokeo ya) yale iliyoyafanya. 'Mola wetu, usitutie katika adhabu ikiwa tumesahau au tumekosea. Mola wetu, wala usituwekee mzigo mzito kama ulivyoweka juu ya wale waliokuwa kabla yetu. Mola wetu, wala usitubebezeshe yale tusiyoweza kuyabeba. Na tusamehe; na utusamehe; na uturehemu. Wewe ndiye Mlinzi wetu, basi utupe ushindi juu ya watu makafiri.'",
        "bn": "রাসূল তাঁর রবের পক্ষ থেকে তাঁর প্রতি যা অবতীর্ণ হয়েছে তাতে ঈমান এনেছেন এবং মুমিনগণও। তাদের প্রত্যেকেই আল্লাহ, তাঁর ফেরেশতাগণ, তাঁর কিতাবসমূহ এবং তাঁর রাসূলগণের প্রতি ঈমান এনেছে। (তারা বলে:) 'আমরা তাঁর রাসূলগণের মধ্যে কারো মধ্যে পার্থক্য করি না।' এবং তারা বলে: 'আমরা শুনলাম এবং মানলাম। হে আমাদের রব, আমরা আপনার ক্ষমা চাই, এবং আপনার দিকেই প্রত্যাবর্তন।' আল্লাহ কাউকে তার সামর্থ্যের অতিরিক্ত ভার চাপান না। সে যা অর্জন করেছে তার ফল তার জন্য, এবং সে যা অর্জন করেছে তার ফল তার উপর। 'হে আমাদের রব, যদি আমরা ভুলে যাই বা ভুল করি তবে আমাদের পাকড়াও করবেন না। হে আমাদের রব, এবং আমাদের উপর এমন বোঝা চাপাবেন না যেমন আমাদের পূর্ববর্তীদের উপর চাপিয়েছিলেন। হে আমাদের রব, এবং আমাদের উপর এমন কিছু চাপাবেন না যা বহন করার ক্ষমতা আমাদের নেই। আর আমাদের ক্ষমা করুন; এবং আমাদের মাফ করুন; এবং আমাদের প্রতি দয়া করুন। আপনি আমাদের অভিভাবক, সুতরাং কাফের সম্প্রদায়ের উপর আমাদের বিজয় দান করুন।'"
      }
    },
    {
      "id": "evening_023",
      "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
      "transliteration": "La ilaha illallahu wahdahu la shareeka lahu, lahul-mulku wa lahul-hamdu, yuhyee wa yumeetu, wa huwa 'ala kulli shay'in qadeer.",
      "repeat": 10,
      "source": "Jami' At-Tirmidhi",
      "translations": {
        "en": "There is no god but Allah, alone without any partners. To Him belongs the dominion and to Him belongs all praise. He gives life and causes death, and He is over all things competent.",
        "ar": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
        "id": "Tidak ada ilah yang berhak disembah kecuali Allah semata, tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala puji. Dia menghidupkan dan mematikan, dan Dia Mahakuasa atas segala sesuatu.",
        "ur": "اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اسی کی بادشاہت ہے اور اسی کے لیے تمام تعریفیں ہیں۔ وہ زندگی دیتا ہے اور موت دیتا ہے، اور وہ ہر چیز پر قادر ہے۔",
        "tr": "Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'nundur. Diriltir ve öldürür. O her şeye kadirdir.",
        "fr": "Il n'y a de dieu qu'Allah, seul sans associé. À Lui appartient la royauté et à Lui appartient la louange. Il donne la vie et fait mourir, et Il est capable de toute chose.",
        "ru": "Нет бога, кроме Аллаха, единого, у Которого нет сотоварищей. Ему принадлежит власть и Ему принадлежит вся хвала. Он оживляет и умерщвляет, и Он над всякой вещью мощен.",
        "fa": "هیچ معبودی جز الله نیست، یکتاست و شریکی ندارد. فرمانروایی از آنِ اوست و ستایش نیز از آنِ اوست. زنده می کند و می میراند، و او بر هر چیزی تواناست.",
        "hi": "अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई शरीक नहीं। उसी की बादशाहत है और उसी के लिए तमाम तारीफें हैं। वह ज़िंदा करता है और मारता है, और वह हर चीज़ पर कादिर है।",
        "ms": "Tiada Tuhan yang berhak disembah melainkan Allah semata, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala puji. Dia menghidupkan dan mematikan, dan Dia Maha Kuasa atas segala sesuatu.",
        "sw": "Hakuna mungu ila Allah, peke Yake hana mshirika. Ufalme ni Wake na sifa zote ni Zake. Anahuisha na anafisha, na Yeye ni Muweza juu ya kila kitu.",
        "bn": "আল্লাহ ছাড়া কোন ইলাহ নেই, তিনি এক, তাঁর কোন শরীক নেই। তাঁরই জন্য রাজত্ব এবং তাঁরই জন্য সমস্ত প্রশংসা। তিনি জীবন দেন এবং মৃত্যু দেন, এবং তিনি সবকিছুর উপর ক্ষমতাবান।"
      }
    },
    {
      "id": "evening_024",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ فَتْحَهَا وَنَصْرَهَا وَنُورَهَا وَبَرَكَتَهَا وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا وَشَرِّ مَا بَعْدَهَا.",
      "transliteration": "Allahumma innee as'aluka khayra hadhihil-laylati fat-haha wa nasraha wa nooraha wa barakataha wa hudaha, wa a'oodhu bika min sharri ma feeha wa sharri ma ba'daha.",
      "repeat": 1,
      "source": "Sunan Abu Dawud",
      "translations": {
        "en": "O Allah, I ask You for the good of this night, its conquest, its victory, its light, its blessings, and its guidance, and I seek refuge in You from the evil of what is in it and the evil of what comes after it.",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ فَتْحَهَا وَنَصْرَهَا وَنُورَهَا وَبَرَكَتَهَا وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا وَشَرِّ مَا بَعْدَهَا.",
        "id": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikan malam ini, pembukaannya, pertolongannya, cahayanya, berkahnya, dan petunjuknya, dan aku berlindung kepada-Mu dari keburukan apa yang ada di dalamnya dan keburukan apa yang datang setelahnya.",
        "ur": "اے اللہ، میں تجھ سے اس رات کی بھلائی، اس کی فتح، اس کی مدد، اس کی روشنی، اس کی برکت اور اس کی ہدایت مانگتا ہوں، اور میں تیری پناہ مانگتا ہوں اس میں جو برائی ہے اور اس کے بعد جو برائی ہے۔",
        "tr": "Allah'ım! Bu gecenin hayrını, fethini, zaferini, nurunu, bereketini ve hidayetini senden dilerim. Bu gecedeki ve ondan sonraki şerlerden sana sığınırım.",
        "fr": "Ô Allah, je Te demande le bien de cette nuit, sa conquête, sa victoire, sa lumière, sa bénédiction et sa guidance, et je cherche refuge auprès de Toi contre le mal de ce qu'elle contient et le mal de ce qui vient après elle.",
        "ru": "О Аллах, я прошу Тебя о благе этой ночи, ее завоевания, ее победы, ее света, ее благословений и ее руководства, и я прибегаю к Тебе от зла того, что в ней, и зла того, что после нее.",
        "fa": "بار الها، من از تو خیر این شب را میطلبم، گشایشش را و یاری‌اش را و نورش را و برکتش را و هدایتش را، و از شر آنچه در آن است و شر آنچه پس از آن است به تو پناه میبرم.",
        "hi": "ऐ अल्लाह, मैं तुझसे इस रात की भलाई, उसकी जीत, उसकी रोशनी, उसकी बरकत और उसकी हिदायत मांगता हूँ, और मैं तेरी पनाह मांगता हूँ इसमें जो बुराई है और इसके बाद जो बुराई है।",
        "ms": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikan malam ini, pembukaannya, pertolongannya, cahayanya, keberkatannya, dan petunjuknya, dan aku berlindung kepada-Mu dari keburukan apa yang ada di dalamnya dan keburukan apa yang datang selepasnya.",
        "sw": "Ee Allah, nakuomba wema wa usiku huu, ushindi wake, nuru yake, baraka zake, na uongozi wake, na najilinda Kwako kutokana na shari ya kilichomo ndani yake na shari ya kilichoko baada yake.",
        "bn": "হে আল্লাহ, আমি আপনার কাছে এই রাতের কল্যাণ, এর বিজয়, এর আলো, এর বরকত এবং এর হেদায়েত চাই, এবং আমি আপনার কাছে এর মধ্যে যা মন্দ আছে এবং এর পরে যা মন্দ আছে তা থেকে আশ্রয় চাই।"
      }
    },
    {
      "id": "evening_025",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
      "transliteration": "Allahumma inni as'aluka al-‘afiyata fid-dunya wal-akhirah",
      "repeat": 1,
      "source": "Sahih Muslim",
      "translations": {
        "en": "O Allah, I ask You for well-being in this world and the Hereafter.",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
        "id": "Ya Allah, aku memohon kepada-Mu keselamatan di dunia dan akhirat.",
        "ur": "اے اللہ! میں تجھ سے دنیا اور آخرت میں عافیت کا سوال کرتا ہوں۔",
        "tr": "Allah’ım! Senden dünya ve ahirette afiyet dilerim.",
        "fr": "Ô Allah, je Te demande le bien-être dans ce monde et dans l'au-delà.",
        "ru": "О Аллах, я прошу у Тебя благополучия в этом мире и в вечности.",
        "fa": "بارالها، از تو سلامتی در دنیا و آخرت می‌خواهم.",
        "hi": "ऐ अल्लाह, मैं तुझसे दुनिया और आख़िरत में भलाई माँगता हूँ।",
        "ms": "Ya Allah, aku memohon kepada-Mu kesejahteraan di dunia dan akhirat.",
        "sw": "Ee Allah, naomba afya njema duniani na Akhera.",
        "bn": "হে আল্লাহ, আমি তোমার কাছে দুনিয়া ও আখিরাতে কল্যাণ চাই।"
      }
    }
  ]
}