[
  {
    "id": "morning_1",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
    "transliteration": "Aṣbaḥnā wa aṣbaḥal-mulku lillāh, wal-ḥamdu lillāh, lā ilāha illallāhu waḥdahu lā sharīka lah, lahul-mulku wa lahul-ḥamdu wa huwa ʿalā kulli shayʾin qadīr, rabbi asʾaluka khayra mā fī hādhal-yawmi wa khayra mā baʿdah, wa aʿūdhu bika min sharri mā fī hādhal-yawmi wa sharri mā baʿdah, rabbi aʿūdhu bika minal-kasali wa sūʾil-kibar, rabbi aʿūdhu bika min ʿadhābin fin-nāri wa ʿadhābin fil-qabr",
    "source": "Muslim 2723",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "We have reached the morning and at this very time all sovereignty belongs to Allah. All praise is for Allah. None has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this day and the good of what follows it and I seek refuge in You from the evil of this day and the evil of what follows it. My Lord, I seek refuge in You from laziness and senility. My Lord, I seek refuge in You from torment in the Fire and torment in the grave."
      },
      "ar": {
        "meaning": "أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شر ما في هذا اليوم وشر ما بعده، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر"
      },
      "id": {
        "meaning": "Kami telah memasuki waktu pagi dan kerajaan hanya milik Allah, segala puji bagi Allah. Tidak ada ilah yang berhak disembah kecuali Allah semata, tiada sekutu bagi-Nya. Milik-Nya kerajaan dan segala puji. Dia-lah yang berkuasa atas segala sesuatu. Wahai Rabbku, aku mohon kepada-Mu kebaikan di hari ini dan kebaikan sesudahnya. Aku berlindung kepada-Mu dari kejahatan hari ini dan kejahatan sesudahnya. Wahai Rabbku, aku berlindung kepada-Mu dari kemalasan dan kejelekan di hari tua. Wahai Rabbku, aku berlindung kepada-Mu dari siksaan di neraka dan siksaan di kubur."
      },
      "ur": {
        "meaning": "ہم نے صبح کی اور اللہ کے لیے بادشاہت نے صبح کی، اور تمام تعریفیں اللہ کے لیے ہیں، اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے اور اسی کے لیے حمد ہے اور وہ ہر چیز پر قادر ہے۔ اے میرے رب! میں تجھ سے اس دن کی بھلائی اور اس کے بعد کی بھلائی مانگتا ہوں، اور میں تیری پناہ چاہتا ہوں اس دن کی برائی سے اور اس کے بعد کی برائی سے۔ اے میرے رب! میں تیری پناہ چاہتا ہوں سستی اور بڑھاپے کی برائی سے۔ اے میرے رب! میں تیری پناہ چاہتا ہوں جہنم کے عذاب سے اور قبر کے عذاب سے۔"
      },
      "tr": {
        "meaning": "Sabaha erdik ve mülk Allah'ındır. Hamd Allah'a mahsustur. Allah'tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk O'nundur, hamd O'na mahsustur. O her şeye kadirdir. Rabbim! Senden bu günün hayrını ve sonrasının hayrını istiyorum. Bu günün şerrinden ve sonrasının şerrinden sana sığınırım. Rabbim! Tembellikten ve kötü yaşlılıktan sana sığınırım. Rabbim! Cehennem azabından ve kabir azabından sana sığınırım."
      },
      "fr": {
        "meaning": "Nous voici au matin et la royauté appartient à Allah. Louange à Allah. Il n'y a de divinité qu'Allah, Seul, sans associé. À Lui la royauté, à Lui la louange et Il est Capable de toute chose. Seigneur, je Te demande le bien de ce jour et le bien de ce qui vient après et je cherche refuge auprès de Toi contre le mal de ce jour et le mal de ce qui vient après. Seigneur, je cherche refuge auprès de Toi contre la paresse et les maux de la vieillesse. Seigneur, je cherche refuge auprès de Toi contre le châtiment de l'Enfer et le châtiment de la tombe."
      },
      "ru": {
        "meaning": "Мы встретили утро, и вся власть принадлежит Аллаху. Вся хвала Аллаху. Нет божества, кроме Аллаха Единого, у Которого нет сотоварища. Ему принадлежит власть и Ему хвала, и Он над каждой вещью мощен. Господь мой, я прошу у Тебя блага этого дня и блага того, что после него, и прибегаю к Твоей защите от зла этого дня и зла того, что после него. Господь мой, я прибегаю к Твоей защите от лени и дурной старости. Господь мой, я прибегаю к Твоей защите от мучений в Огне и мучений в могиле."
      },
      "fa": {
        "meaning": "صبح کردیم و پادشاهی از آن خداست، و حمد مخصوص خداست. معبودی جز الله نیست، یگانه است و شریکی ندارد. پادشاهی از آن اوست و حمد مخصوص اوست و او بر هر چیزی تواناست. پروردگارا! از تو خیر این روز و خیر بعد از آن را می‌خواهم، و از شر این روز و شر بعد از آن به تو پناه می‌برم. پروردگارا! از تنبلی و بدی پیری به تو پناه می‌برم. پروردگارا! از عذاب آتش و عذاب قبر به تو پناه می‌برم."
      },
      "hi": {
        "meaning": "हमने सुबह की और अल्लाह के लिए बादशाहत ने सुबह की, और सारी प्रशंसा अल्लाह के लिए है। अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई साझी नहीं। उसी के लिए बादशाहत है और उसी के लिए प्रशंसा है और वह हर चीज़ पर सामर्थ्यवान है। ऐ मेरे रब! मैं तुझसे इस दिन की भलाई और इसके बाद की भलाई माँगता हूँ, और मैं तेरी शरण चाहता हूँ इस दिन की बुराई से और इसके बाद की बुराई से। ऐ मेरे रब! मैं तेरी शरण चाहता हूँ आलस्य और बुढ़ापे की बुराई से। ऐ मेरे रब! मैं तेरी शरण चाहता हूँ जहन्नम के अज़ाब से और क़ब्र के अज़ाब से।"
      },
      "ms": {
        "meaning": "Kami telah memasuki waktu pagi dan kerajaan adalah milik Allah, segala puji bagi Allah. Tiada Tuhan melainkan Allah Yang Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala puji dan Dia Maha Kuasa atas segala sesuatu. Wahai Tuhanku, aku memohon kepada-Mu kebaikan hari ini dan kebaikan selepasnya, dan aku berlindung dengan-Mu daripada kejahatan hari ini dan kejahatan selepasnya. Wahai Tuhanku, aku berlindung dengan-Mu daripada kemalasan dan keburukan usia tua. Wahai Tuhanku, aku berlindung dengan-Mu daripada azab neraka dan azab kubur."
      },
      "sw": {
        "meaning": "Tumefika asubuhi na ufalme ni wa Mwenyezi Mungu, na sifa zote ni za Mwenyezi Mungu. Hakuna mungu ila Mwenyezi Mungu peke yake, hana mshirika. Ufalme ni wake na sifa ni zake, na Yeye ni Mwenye uwezo juu ya kila kitu. Mola wangu, nakuomba mema ya siku hii na mema ya baada yake, na nakukimbilia wewe kutoka mabaya ya siku hii na mabaya ya baada yake. Mola wangu, nakukimbilia wewe kutoka uvivu na uovu wa uzee. Mola wangu, nakukimbilia wewe kutoka adhabu ya motoni na adhabu ya kaburini."
      },
      "bn": {
        "meaning": "আমরা সকালে উপনীত হয়েছি এবং সমস্ত রাজত্ব আল্লাহর জন্য। সমস্ত প্রশংসা আল্লাহর জন্য। আল্লাহ ছাড়া কোন মাবুদ নেই, তিনি একক, তাঁর কোন শরীক নেই। রাজত্ব তাঁরই, প্রশংসা তাঁরই জন্য এবং তিনি সবকিছুর উপর ক্ষমতাবান। হে আমার রব! আমি আপনার কাছে এই দিনের কল্যাণ এবং এর পরের কল্যাণ চাই, এবং আমি আপনার কাছে আশ্রয় চাই এই দিনের অনিষ্ট এবং এর পরের অনিষ্ট থেকে। হে আমার রব! আমি আপনার কাছে আশ্রয় চাই অলসতা এবং বার্ধক্যের মন্দ থেকে। হে আমার রব! আমি আপনার কাছে আশ্রয় চাই জাহান্নামের আযাব এবং কবরের আযাব থেকে।"
      }
    }
  },
  {
    "id": "morning_2",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
    "transliteration": "Allāhumma bika aṣbaḥnā, wa bika amsaynā, wa bika naḥyā, wa bika namūtu, wa ilaykan-nushūr",
    "source": "Tirmidhi 3391",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, by Your leave we have reached the morning and by Your leave we have reached the evening, by Your leave we live and die and unto You is our resurrection."
      },
      "ar": {
        "meaning": "اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور"
      },
      "id": {
        "meaning": "Ya Allah, dengan rahmat-Mu kami memasuki waktu pagi, dengan rahmat-Mu kami memasuki waktu petang. Dengan rahmat-Mu kami hidup, dengan rahmat-Mu kami mati dan kepada-Mu kebangkitan (kami)."
      },
      "ur": {
        "meaning": "اے اللہ! تیری مدد سے ہم نے صبح کی، اور تیری مدد سے ہم نے شام کی، اور تیری مدد سے ہم جیتے ہیں، اور تیری مدد سے ہم مرتے ہیں، اور تیری طرف اٹھایا جانا ہے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senin sayende sabaha erdik, Senin sayende akşama ereriz. Senin sayende yaşarız, Senin sayende ölürüz. Dönüş Sanadır."
      },
      "fr": {
        "meaning": "Ô Allah, c'est par Toi que nous nous retrouvons au matin et c'est par Toi que nous nous retrouvons au soir. C'est par Toi que nous vivons et c'est par Toi que nous mourons et c'est vers Toi que se fera la résurrection."
      },
      "ru": {
        "meaning": "О Аллах, с Тобой мы встречаем утро, и с Тобой мы встречаем вечер, с Тобой мы живём и с Тобой мы умираем, и к Тебе предстоит воскрешение."
      },
      "fa": {
        "meaning": "خدایا! به یاری تو صبح کردیم و به یاری تو شام می‌کنیم، و به یاری تو زنده هستیم و به یاری تو می‌میریم، و به سوی تو است رستاخیز."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! तेरे सहारे हमने सुबह की, और तेरे सहारे हमने शाम की, और तेरे सहारे हम जीते हैं, और तेरे सहारे हम मरते हैं, और तेरी ओर उठाया जाना है।"
      },
      "ms": {
        "meaning": "Ya Allah, dengan keizinan-Mu kami memasuki waktu pagi, dan dengan keizinan-Mu kami memasuki waktu petang. Dengan keizinan-Mu kami hidup, dengan keizinan-Mu kami mati dan kepada-Mu kebangkitan kami."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, kwa neema yako tumefika asubuhi, na kwa neema yako tunafika jioni, na kwa neema yako tunaishi, na kwa neema yako tunakufa, na kwako wewe ni kufufuka."
      },
      "bn": {
        "meaning": "হে আল্লাহ! আপনার অনুগ্রহে আমরা সকালে উপনীত হয়েছি, আপনার অনুগ্রহে আমরা সন্ধ্যায় উপনীত হই। আপনার অনুগ্রহে আমরা জীবিত থাকি, আপনার অনুগ্রহে আমরা মৃত্যুবরণ করি এবং আপনার দিকেই পুনরুত্থান।"
      }
    }
  },
  {
    "id": "morning_3",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "transliteration": "Allāhumma anta rabbī lā ilāha illā ant, khalaqtanī wa anā ʿabduk, wa anā ʿalā ʿahdika wa waʿdika mā-staṭaʿt, aʿūdhu bika min sharri mā ṣanaʿt, abūʾu laka biniʿmatika ʿalayy, wa abūʾu laka bidhanbī, faghfir lī, fa-innahu lā yaghfirudh-dhunūba illā ant",
    "source": "Bukhari 6306",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, You are my Lord, none has the right to be worshipped except You. You created me and I am Your servant and I abide to Your covenant and promise as best I can. I seek refuge in You from the evil of which I have committed. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You."
      },
      "ar": {
        "meaning": "اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت"
      },
      "id": {
        "meaning": "Ya Allah, Engkau adalah Rabbku, tidak ada ilah yang berhak disembah kecuali Engkau. Engkau telah menciptakanku dan aku adalah hamba-Mu. Aku akan setia pada perjanjian-Mu dan janji-Mu semampuku. Aku berlindung kepada-Mu dari keburukan perbuatanku. Aku mengakui nikmat-Mu kepadaku dan aku mengakui dosaku. Maka ampunilah aku. Sesungguhnya tidak ada yang dapat mengampuni dosa kecuali Engkau."
      },
      "ur": {
        "meaning": "اے اللہ! تو میرا رب ہے، تیرے سوا کوئی معبود نہیں، تو نے مجھے پیدا کیا اور میں تیرا بندہ ہوں، اور میں تیرے عہد اور وعدے پر ہوں جہاں تک میری طاقت ہے، میں تیری پناہ چاہتا ہوں اس برائی سے جو میں نے کی، میں تیری نعمت کا اقرار کرتا ہوں جو تو نے مجھ پر کی، اور میں اپنے گناہ کا اقرار کرتا ہوں، پس تو مجھے معاف کر دے، کیونکہ تیرے سوا کوئی گناہوں کو معاف نہیں کر سکتا۔"
      },
      "tr": {
        "meaning": "Allah'ım! Sen benim Rabbimsin. Senden başka ilah yoktur. Beni Sen yarattın, ben Senin kulunum. Gücüm yettiğince Sana verdiğim söz ve ahid üzereyim. Yaptıklarımın kötülüğünden Sana sığınırım. Üzerimdeki nimetini itiraf ederim. Günahımı da itiraf ederim. Beni bağışla. Çünkü günahları ancak Sen bağışlarsın."
      },
      "fr": {
        "meaning": "Ô Allah, Tu es mon Seigneur, il n'y a de divinité que Toi. Tu m'as créé et je suis Ton serviteur, je me conforme autant que je peux à mon engagement et à ma promesse vis-à-vis de Toi. Je cherche refuge auprès de Toi contre le mal que j'ai commis. Je reconnais Tes bienfaits à mon égard et je reconnais mes péchés. Pardonne-moi donc, car nul autre que Toi ne pardonne les péchés."
      },
      "ru": {
        "meaning": "О Аллах, Ты — мой Господь, нет божества, кроме Тебя. Ты создал меня, и я — Твой раб, и я буду верен завету с Тобой и обещанию, данному Тебе, насколько смогу. Я прибегаю к Твоей защите от зла того, что я совершил. Я признаю милость, оказанную Тобой мне, и признаю грех свой, прости же меня, ибо, поистине, никто не прощает грехов, кроме Тебя."
      },
      "fa": {
        "meaning": "خدایا! تو پروردگار منی، معبودی جز تو نیست. تو مرا آفریدی و من بنده تو هستم، و تا آنجا که توانایی دارم بر عهد و پیمانت استوارم. از شر آنچه انجام داده‌ام به تو پناه می‌برم. به نعمتت بر خود اعتراف می‌کنم و به گناهم اقرار دارم، پس مرا ببخش که جز تو کسی گناهان را نمی‌بخشد."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! तू मेरा रब है, तेरे सिवा कोई माबूद नहीं, तूने मुझे पैदा किया और मैं तेरा बन्दा हूँ, और मैं तेरे अहद और वादे पर हूँ जहाँ तक मेरी ताक़त है। मैं तेरी पनाह चाहता हूँ उस बुराई से जो मैंने की। मैं तेरी नेमत का इक़रार करता हूँ जो तूने मुझ पर की, और मैं अपने गुनाह का इक़रार करता हूँ, पस तू मुझे माफ़ कर दे, क्योंकि तेरे सिवा कोई गुनाहों को माफ़ नहीं कर सकता।"
      },
      "ms": {
        "meaning": "Ya Allah, Engkau adalah Tuhanku, tiada Tuhan melainkan Engkau. Engkau telah menciptakan aku dan aku adalah hamba-Mu. Aku berada di atas perjanjian dan janji-Mu sekadar kemampuanku. Aku berlindung dengan-Mu daripada kejahatan apa yang telah aku lakukan. Aku mengakui nikmat-Mu ke atasku dan aku mengakui dosaku, maka ampunilah aku. Sesungguhnya tiada yang mengampuni dosa-dosa melainkan Engkau."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, Wewe ndiwe Mola wangu, hakuna mungu ila Wewe. Wewe umeniumba na mimi ni mtumwa wako, na mimi niko katika ahadi yako na ahadi yako kadiri ninavyoweza. Ninakukimbilia Wewe kutoka uovu wa nilichofanya. Ninakiri neema zako juu yangu, na ninakiri dhambi yangu, basi unisamehe, kwani hakika hakuna anayesamehe dhambi ila Wewe."
      },
      "bn": {
        "meaning": "হে আল্লাহ! আপনি আমার রব, আপনি ছাড়া কোন মাবুদ নেই। আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার বান্দা। আমি আমার সাধ্যমত আপনার সাথে কৃত অঙ্গীকার ও প্রতিশ্রুতির উপর আছি। আমি যা করেছি তার অনিষ্ট থেকে আপনার কাছে আশ্রয় চাই। আমি আমার উপর আপনার নেয়ামত স্বীকার করছি এবং আমার পাপ স্বীকার করছি। অতএব আমাকে ক্ষমা করে দিন। নিশ্চয় আপনি ছাড়া কেউ পাপ ক্ষমা করতে পারে না।"
      }
    }
  },
  {
    "id": "morning_4",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
    "transliteration": "Allāhumma innī aṣbaḥtu ushhiduka, wa ushhidu ḥamalata ʿarshika, wa malāʾikataka, wa jamīʿa khalqika, annaka antallāhu lā ilāha illā anta waḥdaka lā sharīka lak, wa anna Muḥammadan ʿabduka wa rasūluk",
    "source": "Abu Dawud 5069",
    "repeat": 4,
    "translations": {
      "en": {
        "meaning": "O Allah, verily I have reached the morning and call on You, the bearers of Your throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner and that Muhammad is Your servant and messenger."
      },
      "ar": {
        "meaning": "اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك، وأن محمدا عبدك ورسولك"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memasuki waktu pagi, aku mempersaksikan Engkau, para malaikat pembawa 'Arsy-Mu, para malaikat-Mu dan seluruh makhluk-Mu, bahwa Engkau adalah Allah, tidak ada ilah yang berhak disembah kecuali Engkau semata, tiada sekutu bagi-Mu dan sesungguhnya Muhammad adalah hamba-Mu dan rasul-Mu."
      },
      "ur": {
        "meaning": "اے اللہ! میں نے صبح کی، میں تجھے گواہ بناتا ہوں، اور تیرے عرش کے اٹھانے والوں کو، اور تیرے فرشتوں کو، اور تیری تمام مخلوق کو گواہ بناتا ہوں، کہ تو ہی اللہ ہے، تیرے سوا کوئی معبود نہیں، تو اکیلا ہے، تیرا کوئی شریک نہیں، اور محمد (ﷺ) تیرے بندے اور رسول ہیں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Ben sabaha erdim. Seni, Arş'ını taşıyan meleklerini, bütün meleklerini ve yaratıklarını şahit tutarak derim ki: Şüphesiz Sen Allah'sın. Senden başka ilah yoktur. Sen teksin, ortağın yoktur. Muhammed de Senin kulun ve elçindir."
      },
      "fr": {
        "meaning": "Ô Allah, me voici au matin et je Te prends à témoin, ainsi que les porteurs de Ton Trône, Tes anges et toute Ta création, que c'est Toi Allah, il n'y a de divinité que Toi Seul, sans associé, et que Muhammad est Ton serviteur et Ton messager."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я встретил утро, призывая Тебя в свидетели, а также носителей Твоего трона, Твоих ангелов и все Твои творения, что Ты — Аллах, нет божества, кроме Тебя одного, нет у Тебя сотоварища, и что Мухаммад — Твой раб и Твой посланник."
      },
      "fa": {
        "meaning": "خدایا! من صبح کردم، تو را و حاملان عرشت را و فرشتگانت را و همه آفریدگانت را گواه می‌گیرم که تو خدایی، معبودی جز تو نیست، یگانه‌ای و شریکی نداری، و محمد بنده و فرستاده توست."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैंने सुबह की, मैं तुझे गवाह बनाता हूँ, और तेरे अर्श के उठाने वालों को, और तेरे फ़रिश्तों को, और तेरी तमाम मख़्लूक़ को गवाह बनाता हूँ, कि तू ही अल्लाह है, तेरे सिवा कोई माबूद नहीं, तू अकेला है, तेरा कोई शरीक नहीं, और मुहम्मद (ﷺ) तेरे बन्दे और रसूल हैं।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memasuki waktu pagi dengan menjadikan Engkau, para malaikat pembawa Arasy-Mu, para malaikat-Mu dan seluruh makhluk-Mu sebagai saksi, bahawa sesungguhnya Engkau adalah Allah, tiada Tuhan melainkan Engkau Yang Esa, tiada sekutu bagi-Mu, dan sesungguhnya Muhammad adalah hamba-Mu dan rasul-Mu."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, hakika nimefika asubuhi na ninakushuhudia Wewe, na wabebaji wa kiti chako cha enzi, na malaika wako, na viumbe vyako vyote, kwamba Wewe ndiwe Mwenyezi Mungu, hakuna mungu ila Wewe peke yako, huna mshirika, na kwamba Muhammad ni mtumwa wako na mtume wako."
      },
      "bn": {
        "meaning": "হে আল্লাহ! আমি সকালে উপনীত হয়েছি, আমি আপনাকে সাক্ষী মানছি এবং আপনার আরশ বহনকারীদের, আপনার ফেরেশতাদের এবং আপনার সমস্ত সৃষ্টিকে সাক্ষী মানছি যে, নিশ্চয় আপনিই আল্লাহ, আপনি ছাড়া কোন মাবুদ নেই, আপনি একক, আপনার কোন শরীক নেই এবং মুহাম্মাদ (ﷺ) আপনার বান্দা ও রাসূল।"
      }
    }
  },
  {
    "id": "morning_5",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
    "transliteration": "Allāhumma mā aṣbaḥa bī min niʿmatin aw bi-aḥadin min khalqika, faminka waḥdaka lā sharīka lak, falakal-ḥamdu wa lakash-shukr",
    "source": "Abu Dawud 5073",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, what blessing I or any of Your creation have risen upon, is from You alone, without partner, so for You is all praise and unto You all thanks."
      },
      "ar": {
        "meaning": "اللهم ما أصبح بي من نعمة أو بأحد من خلقك، فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر"
      },
      "id": {
        "meaning": "Ya Allah, nikmat apa pun yang ada padaku atau pada salah seorang dari makhluk-Mu di pagi ini, maka itu hanya dari-Mu semata, tiada sekutu bagi-Mu. Bagi-Mu segala puji dan bagi-Mu segala syukur."
      },
      "ur": {
        "meaning": "اے اللہ! جو نعمت بھی میرے پاس یا تیری مخلوق میں سے کسی کے پاس صبح کو موجود ہے، وہ صرف تیری طرف سے ہے، تو اکیلا ہے، تیرا کوئی شریک نہیں، پس تیرے لیے تمام تعریف ہے اور تیرے لیے شکر ہے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Bende veya yaratıklarından herhangi birinde bu sabah bulunan her nimet ancak Sendendir. Senin ortağın yoktur. Hamd Sana, şükür Sana mahsustur."
      },
      "fr": {
        "meaning": "Ô Allah, toute grâce dont je me réveille ce matin ou dont jouit l'une de Tes créatures provient de Toi Seul, sans associé. À Toi la louange et à Toi le remerciement."
      },
      "ru": {
        "meaning": "О Аллах, какое бы благо ни оказалось утром у меня или у кого-либо из Твоих созданий, оно исходит только от Тебя одного, и нет у Тебя сотоварища, поэтому хвала Тебе и благодарность Тебе!"
      },
      "fa": {
        "meaning": "خدایا! هر نعمتی که در این صبح بر من یا بر یکی از آفریدگانت است، تنها از جانب توست، شریکی نداری، پس حمد و شکر از آن توست."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! जो नेमत भी मेरे पास या तेरी मख़्लूक़ में से किसी के पास सुबह को मौजूद है, वह सिर्फ़ तेरी तरफ़ से है, तू अकेला है, तेरा कोई शरीक नहीं, पस तेरे लिए तमाम तारीफ़ है और तेरे लिए शुक्र है।"
      },
      "ms": {
        "meaning": "Ya Allah, apa jua nikmat yang ada padaku atau pada seorang daripada makhluk-Mu pada pagi ini, maka ia adalah daripada-Mu semata-mata, tiada sekutu bagi-Mu. Maka bagi-Mu segala pujian dan bagi-Mu kesyukuran."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, neema yoyote niliyoamka nayo mimi au yoyote kati ya viumbe vyako, inatoka kwako Wewe peke yako, huna mshirika, basi sifa zote ni zako na shukrani zote ni zako."
      },
      "bn": {
        "meaning": "হে আল্লাহ! এই সকালে আমার বা আপনার কোন সৃষ্টির উপর যে নেয়ামত রয়েছে, তা শুধুমাত্র আপনার পক্ষ থেকে, আপনার কোন শরীক নেই। অতএব সমস্ত প্রশংসা আপনার জন্য এবং সমস্ত কৃতজ্ঞতা আপনার জন্য।"
      }
    }
  },
  {
    "id": "morning_6",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
    "transliteration": "Allāhumma ʿāfinī fī badanī, Allāhumma ʿāfinī fī samʿī, Allāhumma ʿāfinī fī baṣarī, lā ilāha illā ant",
    "source": "Abu Dawud 5090",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "O Allah, grant me health in my body. O Allah, grant me health in my hearing. O Allah, grant me health in my sight. None has the right to be worshipped except You."
      },
      "ar": {
        "meaning": "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت"
      },
      "id": {
        "meaning": "Ya Allah, berilah aku kesehatan pada tubuhku. Ya Allah, berilah aku kesehatan pada pendengaranku. Ya Allah, berilah aku kesehatan pada penglihatanku. Tidak ada ilah yang berhak disembah kecuali Engkau."
      },
      "ur": {
        "meaning": "اے اللہ! مجھے میرے بدن میں عافیت دے، اے اللہ! مجھے میری سماعت میں عافیت دے، اے اللہ! مجھے میری بصارت میں عافیت دے، تیرے سوا کوئی معبود نہیں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Bedenimde bana afiyet ver. Allah'ım! Kulağımda bana afiyet ver. Allah'ım! Gözümde bana afiyet ver. Senden başka ilah yoktur."
      },
      "fr": {
        "meaning": "Ô Allah, accorde-moi la santé dans mon corps. Ô Allah, accorde-moi la santé dans mon ouïe. Ô Allah, accorde-moi la santé dans ma vue. Il n'y a de divinité que Toi."
      },
      "ru": {
        "meaning": "О Аллах, избавь меня от недугов в моём теле. О Аллах, избавь меня от недугов в моём слухе. О Аллах, избавь меня от недугов в моём зрении. Нет божества, кроме Тебя."
      },
      "fa": {
        "meaning": "خدایا! در بدنم به من عافیت بده. خدایا! در شنواییم به من عافیت بده. خدایا! در بیناییم به من عافیت بده. معبودی جز تو نیست."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मुझे मेरे बदन में आफ़ियत दे। ऐ अल्लाह! मुझे मेरी समाअत में आफ़ियत दे। ऐ अल्लाह! मुझे मेरी बसारत में आफ़ियत दे। तेरे सिवा कोई माबूद नहीं।"
      },
      "ms": {
        "meaning": "Ya Allah, kurniakanlah kesejahteraan kepadaku pada badanku. Ya Allah, kurniakanlah kesejahteraan kepadaku pada pendengaranku. Ya Allah, kurniakanlah kesejahteraan kepadaku pada penglihatanku. Tiada Tuhan melainkan Engkau."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, nipe afya katika mwili wangu. Ee Mwenyezi Mungu, nipe afya katika kusikia kwangu. Ee Mwenyezi Mungu, nipe afya katika kuona kwangu. Hakuna mungu ila Wewe."
      },
      "bn": {
        "meaning": "হে আল্লাহ! আমার দেহে আমাকে নিরাপত্তা দান করুন। হে আল্লাহ! আমার শ্রবণশক্তিতে আমাকে নিরাপত্তা দান করুন। হে আল্লাহ! আমার দৃষ্টিশক্তিতে আমাকে নিরাপত্তা দান করুন। আপনি ছাড়া কোন মাবুদ নেই।"
      }
    }
  },
  {
    "id": "morning_7",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ",
    "transliteration": "Allāhumma innī aʿūdhu bika minal-kufri, wal-faqri, wa aʿūdhu bika min ʿadhābil-qabri, lā ilāha illā ant",
    "source": "Abu Dawud 5090",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the punishment of the grave. None has the right to be worshipped except You."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ بك من الكفر، والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kekufuran dan kefakiran. Aku berlindung kepada-Mu dari siksa kubur. Tidak ada ilah yang berhak disembah kecuali Engkau."
      },
      "ur": {
        "meaning": "اے اللہ! میں تیری پناہ چاہتا ہوں کفر سے اور فقر سے، اور میں تیری پناہ چاہتا ہوں قبر کے عذاب سے، تیرے سوا کوئی معبود نہیں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Küfürden ve fakirlikten Sana sığınırım. Kabir azabından da Sana sığınırım. Senden başka ilah yoktur."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Toi contre la mécréance et la pauvreté, et je cherche refuge auprès de Toi contre le châtiment de la tombe. Il n'y a de divinité que Toi."
      },
      "ru": {
        "meaning": "О Аллах, я прибегаю к Твоей защите от неверия и бедности, и я прибегаю к Твоей защите от мучений в могиле. Нет божества, кроме Тебя."
      },
      "fa": {
        "meaning": "خدایا! من از کفر و فقر به تو پناه می‌برم، و از عذاب قبر به تو پناه می‌برم. معبودی جز تو نیست."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तेरी पनाह चाहता हूँ कुफ़्र से और फ़क़्र से, और मैं तेरी पनाह चाहता हूँ क़ब्र के अज़ाब से। तेरे सिवा कोई माबूद नहीं।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung dengan-Mu daripada kekufuran dan kefakiran, dan aku berlindung dengan-Mu daripada azab kubur. Tiada Tuhan melainkan Engkau."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, hakika nakukimbilia Wewe kutoka ukufuru, na umaskini, na nakukimbilia Wewe kutoka adhabu ya kaburi. Hakuna mungu ila Wewe."
      },
      "bn": {
        "meaning": "হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাই কুফর ও দারিদ্র্য থেকে, এবং আমি আপনার কাছে আশ্রয় চাই কবরের আযাব থেকে। আপনি ছাড়া কোন মাবুদ নেই।"
      }
    }
  },
  {
    "id": "morning_8",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "transliteration": "Ḥasbiyallāhu lā ilāha illā huwa ʿalayhi tawakkaltu wa huwa rabbul-ʿarshil-ʿaẓīm",
    "source": "Abu Dawud 5081",
    "repeat": 7,
    "translations": {
      "en": {
        "meaning": "Allah is sufficient for me. None has the right to be worshipped except Him. I have placed my trust in Him and He is the Lord of the Mighty Throne."
      },
      "ar": {
        "meaning": "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم"
      },
      "id": {
        "meaning": "Allah cukup bagiku. Tidak ada ilah yang berhak disembah kecuali Dia. Kepada-Nya aku bertawakal dan Dia adalah Rabb yang memiliki 'Arsy yang agung."
      },
      "ur": {
        "meaning": "اللہ میرے لیے کافی ہے، اس کے سوا کوئی معبود نہیں، میں نے اسی پر بھروسہ کیا اور وہ عرش عظیم کا رب ہے۔"
      },
      "tr": {
        "meaning": "Allah bana yeter. O'ndan başka ilah yoktur. Ben O'na tevekkül ettim. O, büyük Arş'ın Rabbidir."
      },
      "fr": {
        "meaning": "Allah me suffit. Il n'y a de divinité que Lui. C'est en Lui que je place ma confiance et Il est le Seigneur du Trône immense."
      },
      "ru": {
        "meaning": "Достаточно мне Аллаха. Нет божества, кроме Него. На Него я уповаю, и Он — Господь великого трона."
      },
      "fa": {
        "meaning": "خدا مرا بس است. معبودی جز او نیست. بر او توکل کردم و او پروردگار عرش بزرگ است."
      },
      "hi": {
        "meaning": "अल्लाह मेरे लिए काफ़ी है, उसके सिवा कोई माबूद नहीं, मैंने उसी पर भरोसा किया और वह अर्श अज़ीम का रब है।"
      },
      "ms": {
        "meaning": "Allah cukup bagiku. Tiada Tuhan melainkan Dia. Kepada-Nya aku berserah dan Dialah Tuhan yang memiliki Arasy yang agung."
      },
      "sw": {
        "meaning": "Mwenyezi Mungu ananitosha. Hakuna mungu ila Yeye. Nimemtegemea Yeye na Yeye ndiye Mola wa Kiti cha Enzi kikuu."
      },
      "bn": {
        "meaning": "আল্লাহ আমার জন্য যথেষ্ট। তিনি ছাড়া কোন মাবুদ নেই। আমি তাঁর উপরই ভরসা করেছি এবং তিনি মহান আরশের রব।"
      }
    }
  },
  {
    "id": "morning_9",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
    "transliteration": "Allāhumma innī asʾalukal-ʿafwa wal-ʿāfiyata fid-dunyā wal-ākhirati, Allāhumma innī asʾalukal-ʿafwa wal-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhummastur ʿawrātī wa āmin rawʿātī, Allāhummaḥfaẓnī min bayni yadayya wa min khalfī wa ʿan yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu biʿaẓamatika an ughtāla min taḥtī",
    "source": "Abu Dawud 5074",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I seek refuge with You lest I be swallowed up by the earth."
      },
      "ar": {
        "meaning": "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu ampunan dan afiat di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu ampunan dan afiat dalam agamaku, duniaku, keluargaku dan hartaku. Ya Allah, tutupilah auratku (aib dan sesuatu yang tidak layak dilihat orang) dan tenteramkanlah aku dari rasa takut. Ya Allah, peliharalah aku dari depan, belakang, kanan, kiri dan dari atasku. Aku berlindung dengan kebesaran-Mu, agar aku tidak disambar dari bawahku."
      },
      "ur": {
        "meaning": "اے اللہ! میں تجھ سے دنیا اور آخرت میں معافی اور عافیت مانگتا ہوں، اے اللہ! میں تجھ سے اپنے دین، دنیا، اہل اور مال میں معافی اور عافیت مانگتا ہوں، اے اللہ! میری پردہ پوشی فرما اور مجھے امن عطا فرما، اے اللہ! میری حفاظت فرما میرے آگے سے، میرے پیچھے سے، میری دائیں طرف سے، میری بائیں طرف سے اور میرے اوپر سے، اور میں تیری عظمت کی پناہ چاہتا ہوں کہ میں اپنے نیچے سے ہلاک کیا جاؤں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden dünya ve ahirette af ve afiyet dilerim. Allah'ım! Dinim, dünyam, ailem ve malım hususunda Senden af ve afiyet dilerim. Allah'ım! Ayıplarımı ört, korkularımdan beni emin kıl. Allah'ım! Beni önümden, arkamdan, sağımdan, solumdan ve üstümden koru. Altımdan yok edilmekten azametine sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande le pardon et la préservation dans ce monde et dans l'au-delà. Ô Allah, je Te demande le pardon et la préservation dans ma religion, ma vie mondaine, ma famille et mes biens. Ô Allah, cache mes défauts et mets-moi à l'abri de mes craintes. Ô Allah, protège-moi par devant, par derrière, par ma droite, par ma gauche et au-dessus de moi. Je cherche refuge en Ta grandeur contre le fait d'être englouti par en-dessous."
      },
      "ru": {
        "meaning": "О Аллах, я прошу у Тебя прощения и благополучия в этом мире и в мире вечном. О Аллах, я прошу у Тебя прощения и благополучия в моей религии, в моих мирских делах, в моей семье и в моём имуществе. О Аллах, скрой мои недостатки и успокой мои страхи. О Аллах, защити меня спереди и сзади, справа и слева, и сверху. Я прибегаю к Твоему величию от того, чтобы быть поглощённым снизу."
      },
      "fa": {
        "meaning": "خدایا! از تو عفو و عافیت را در دنیا و آخرت می‌خواهم. خدایا! از تو عفو و عافیت را در دین و دنیا و خانواده و مالم می‌خواهم. خدایا! عیب‌هایم را بپوشان و مرا از ترس‌هایم ایمن گردان. خدایا! مرا از پیش رو و از پشت سر و از سمت راست و از سمت چپ و از بالای سرم حفظ کن، و به عظمت تو پناه می‌برم از اینکه از زیر پایم هلاک شوم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तुझसे दुनिया और आख़िरत में माफ़ी और आफ़ियत माँगता हूँ। ऐ अल्लाह! मैं तुझसे अपने दीन, दुनिया, अहल और माल में माफ़ी और आफ़ियत माँगता हूँ। ऐ अल्लाह! मेरी पर्दापोशी फ़रमा और मुझे अमन अता फ़रमा। ऐ अल्लाह! मेरी हिफ़ाज़त फ़रमा मेरे आगे से, मेरे पीछे से, मेरी दाईं तरफ़ से, मेरी बाईं तरफ़ से और मेरे ऊपर से, और मैं तेरी अज़मत की पनाह चाहता हूँ कि मैं अपने नीचे से हलाक किया जाऊँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu kemaafan dan kesejahteraan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu kemaafan dan kesejahteraan dalam agamaku, duniaku, keluargaku dan hartaku. Ya Allah, tutupilah kekuranganku dan tenangkanlah ketakutanku. Ya Allah, peliharalah aku dari hadapan, dari belakang, dari kanan, dari kiri dan dari atas. Aku berlindung dengan keagungan-Mu agar aku tidak dibinasakan dari bawah."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, hakika nakuomba msamaha na afya katika dunia na akhera. Ee Mwenyezi Mungu, hakika nakuomba msamaha na afya katika dini yangu, dunia yangu, familia yangu na mali yangu. Ee Mwenyezi Mungu, ficha mapungufu yangu na uniondolee hofu zangu. Ee Mwenyezi Mungu, nihifadhi kutoka mbele yangu, nyuma yangu, kulia kwangu, kushoto kwangu na juu yangu. Ninakimbilia ukuu wako nisije nikateketezwa kutoka chini yangu."
      },
      "bn": {
        "meaning": "হে আল্লাহ! আমি আপনার কাছে দুনিয়া ও আখিরাতে ক্ষমা ও নিরাপত্তা চাই। হে আল্লাহ! আমি আপনার কাছে আমার দীন, দুনিয়া, পরিবার ও সম্পদে ক্ষমা ও নিরাপত্তা চাই। হে আল্লাহ! আমার দোষ-ত্রুটি ঢেকে দিন এবং আমার ভয়-ভীতি দূর করে দিন। হে আল্লাহ! আমাকে রক্ষা করুন আমার সামনে থেকে, পেছন থেকে, ডান দিক থেকে, বাম দিক থেকে এবং উপর থেকে। আমি আপনার মহত্ত্বের আশ্রয় চাই যেন আমি নিচ থেকে ধ্বংস না হই।"
      }
    }
  },
  {
    "id": "morning_10",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
    "transliteration": "Allāhumma ʿālimal-ghaybi wash-shahādati, fāṭiras-samāwāti wal-arḍi, rabba kulli shayʾin wa malīkah, ashhadu an lā ilāha illā ant, aʿūdhu bika min sharri nafsī, wa min sharrish-shayṭāni wa shirkihi, wa an aqtarifa ʿalā nafsī sūʾan, aw ajurrahu ilā muslim",
    "source": "Tirmidhi 3392",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, Knower of the unseen and the witnessed, Creator of the heavens and the earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I seek refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim."
      },
      "ar": {
        "meaning": "اللهم عالم الغيب والشهادة، فاطر السماوات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي، ومن شر الشيطان وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم"
      },
      "id": {
        "meaning": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata, Pencipta langit dan bumi, Rabb segala sesuatu dan Yang Merajainya. Aku bersaksi bahwa tidak ada ilah yang berhak disembah kecuali Engkau. Aku berlindung kepada-Mu dari kejahatan diriku, dari kejahatan setan dan tipudayanya, dan agar aku tidak melakukan kejahatan terhadap diriku atau menimpakan kejahatan kepada seorang muslim."
      },
      "ur": {
        "meaning": "اے اللہ! غیب اور حاضر کے جاننے والے، آسمانوں اور زمین کے پیدا کرنے والے، ہر چیز کے رب اور مالک، میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں، میں تیری پناہ چاہتا ہوں اپنے نفس کی برائی سے، اور شیطان کی برائی اور اس کے شرک سے، اور اس بات سے کہ میں اپنے اوپر کوئی برائی کروں یا کسی مسلمان کی طرف اسے کھینچوں۔"
      },
      "tr": {
        "meaning": "Gaybı ve açığı bilen, göklerin ve yerin yaratıcısı, her şeyin Rabbi ve Maliki olan Allah'ım! Senden başka ilah olmadığına şehadet ederim. Nefsimin şerrinden, şeytanın şerrinden ve onun şirk tuzağından Sana sığınırım. Kendime bir kötülük etmekten veya bir Müslümana kötülük sürüklemekten de Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, Connaisseur de l'invisible et du visible, Créateur des cieux et de la terre, Seigneur et Souverain de toute chose. J'atteste qu'il n'y a de divinité que Toi. Je cherche refuge auprès de Toi contre le mal de mon âme, contre le mal du diable et son polythéisme, et contre le fait de me faire du mal à moi-même ou d'en faire à un musulman."
      },
      "ru": {
        "meaning": "О Аллах, Знающий сокровенное и явное, Творец небес и земли, Господь и Владыка всякой вещи! Свидетельствую, что нет божества, кроме Тебя. Я прибегаю к Твоей защите от зла моей души, от зла и многобожия шайтана, и от причинения зла самому себе или нанесения его какому-либо мусульманину."
      },
      "fa": {
        "meaning": "خدایا! ای دانای غیب و شهادت، ای آفریننده آسمان‌ها و زمین، ای پروردگار و مالک همه چیز، گواهی می‌دهم که معبودی جز تو نیست. از شر نفسم و از شر شیطان و دام شرکش به تو پناه می‌برم، و از اینکه بر خود بدی روا دارم یا آن را به سوی مسلمانی بکشانم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! ग़ैब और हाज़िर के जानने वाले, आसमानों और ज़मीन के पैदा करने वाले, हर चीज़ के रब और मालिक, मैं गवाही देता हूँ कि तेरे सिवा कोई माबूद नहीं। मैं तेरी पनाह चाहता हूँ अपने नफ़्स की बुराई से, और शैतान की बुराई और उसके शिर्क से, और इस बात से कि मैं अपने ऊपर कोई बुराई करूँ या किसी मुसलमान की तरफ़ उसे खींचूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, Yang Mengetahui perkara ghaib dan yang nyata, Pencipta langit dan bumi, Tuhan dan Raja segala sesuatu. Aku bersaksi bahawa tiada Tuhan melainkan Engkau. Aku berlindung dengan-Mu daripada kejahatan diriku, daripada kejahatan syaitan dan perangkap syiriknya, dan daripada melakukan kejahatan ke atas diriku atau menyeretnya kepada seorang muslim."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, Mjuzi wa siri na dhaahiri, Muumba wa mbingu na ardhi, Mola na Mfalme wa kila kitu, nashuhudia kwamba hakuna mungu ila Wewe. Nakukimbilia Wewe kutoka uovu wa nafsi yangu, na kutoka uovu wa shetani na ushirikina wake, na kutokana na kufanya uovu juu ya nafsi yangu, au kuuvuta kwa Muislamu."
      },
      "bn": {
        "meaning": "হে আল্লাহ! গায়েব ও উপস্থিত জ্ঞানের অধিকারী, আসমান ও যমীনের স্রষ্টা, সব কিছুর রব ও মালিক। আমি সাক্ষ্য দিচ্ছি যে, আপনি ছাড়া কোন মাবুদ নেই। আমি আমার নফসের অনিষ্ট থেকে, শয়তানের অনিষ্ট ও তার শিরকের ফাঁদ থেকে আপনার আশ্রয় চাই এবং আমার নিজের উপর কোন অনিষ্ট করা অথবা কোন মুসলিমের দিকে তা টেনে আনা থেকে আপনার আশ্রয় চাই।"
      }
    }
  },
  {
    "id": "morning_11",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "transliteration": "Bismillāhil-ladhī lā yaḍurru maʿasmihi shayʾun fil-arḍi wa lā fis-samāʾi wa huwas-samīʿul-ʿalīm",
    "source": "Abu Dawud 5088",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing."
      },
      "ar": {
        "meaning": "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم"
      },
      "id": {
        "meaning": "Dengan nama Allah yang bila disebut nama-Nya, tidak ada sesuatu pun di bumi dan di langit yang membahayakan. Dialah Yang Maha Mendengar lagi Maha Mengetahui."
      },
      "ur": {
        "meaning": "اللہ کے نام سے جس کے نام کے ساتھ زمین اور آسمان میں کوئی چیز نقصان نہیں پہنچا سکتی اور وہ سننے والا جاننے والا ہے۔"
      },
      "tr": {
        "meaning": "Adıyla beraber yerde ve gökte hiçbir şeyin zarar veremeyeceği Allah'ın adıyla. O, hakkıyla işitendir, hakkıyla bilendir."
      },
      "fr": {
        "meaning": "Au nom d'Allah, avec Son nom rien ne peut nuire sur terre ni dans le ciel et Il est l'Audient, l'Omniscient."
      },
      "ru": {
        "meaning": "С именем Аллаха, с именем Которого ничто не причинит вреда ни на земле, ни на небе, Он — Слышащий, Знающий."
      },
      "fa": {
        "meaning": "به نام خداوندی که با نام او هیچ چیزی در زمین و آسمان زیان نمی‌رساند و او شنوای داناست."
      },
      "hi": {
        "meaning": "अल्लाह के नाम से जिसके नाम के साथ ज़मीन और आसमान में कोई चीज़ नुक़सान नहीं पहुँचा सकती और वह सुनने वाला जानने वाला है।"
      },
      "ms": {
        "meaning": "Dengan nama Allah yang dengan nama-Nya, tidak ada sesuatu pun di bumi mahupun di langit yang boleh memberi mudarat. Dialah Yang Maha Mendengar lagi Maha Mengetahui."
      },
      "sw": {
        "meaning": "Kwa jina la Mwenyezi Mungu ambaye kwa jina lake hakuna kitu kinachoweza kudhuru duniani wala mbinguni, naye ni Mwenye kusikia, Mwenye kujua."
      },
      "bn": {
        "meaning": "আল্লাহর নামে, যার নামের সাথে আসমান ও যমীনে কোন কিছুই ক্ষতি করতে পারে না। তিনি সর্বশ্রোতা, সর্বজ্ঞ।"
      }
    }
  },
  {
    "id": "morning_12",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
    "transliteration": "Raḍītu billāhi rabban, wa bil-islāmi dīnan, wa bi-Muḥammadin ṣallallāhu ʿalayhi wa sallama nabiyyā",
    "source": "Abu Dawud 5072",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "I am pleased with Allah as Lord, and Islam as religion and Muhammad (peace be upon him) as Prophet."
      },
      "ar": {
        "meaning": "رضيت بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبيا"
      },
      "id": {
        "meaning": "Aku ridha Allah sebagai Rabb, Islam sebagai agama dan Muhammad shallallahu 'alaihi wa sallam sebagai nabi."
      },
      "ur": {
        "meaning": "میں اللہ کو رب، اسلام کو دین اور محمد صلی اللہ علیہ وسلم کو نبی مان کر راضی ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ı Rab, İslam'ı din, Muhammed'i (sallallahu aleyhi ve sellem) peygamber olarak kabul ettim, razı oldum."
      },
      "fr": {
        "meaning": "J'agrée Allah comme Seigneur, l'Islam comme religion et Muhammad (paix et bénédiction sur lui) comme prophète."
      },
      "ru": {
        "meaning": "Я доволен Аллахом как Господом, исламом как религией и Мухаммадом (да благословит его Аллах и приветствует) как пророком."
      },
      "fa": {
        "meaning": "راضی شدم به اینکه الله پروردگار من، اسلام دین من و محمد صلی الله علیه و سلم پیامبر من باشد."
      },
      "hi": {
        "meaning": "मैं अल्लाह को रब, इस्लाम को दीन और मुहम्मद सल्लल्लाहु अलैहि व सल्लम को नबी मान कर राज़ी हूँ।"
      },
      "ms": {
        "meaning": "Aku reda Allah sebagai Tuhan, Islam sebagai agama dan Muhammad ﷺ sebagai nabi."
      },
      "sw": {
        "meaning": "Nimeridhika na Mwenyezi Mungu kuwa Mola, na Uislamu kuwa dini, na Muhammad (rehma na amani ziwe juu yake) kuwa nabii."
      },
      "bn": {
        "meaning": "আমি আল্লাহকে রব হিসেবে, ইসলামকে দীন হিসেবে এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে নবী হিসেবে মেনে নিয়ে সন্তুষ্ট।"
      }
    }
  },
  {
    "id": "morning_13",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
    "transliteration": "Yā ḥayyu yā qayyūmu biraḥmatika astaghīth, aṣliḥ lī shaʾnī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn",
    "source": "Hisnul Muslim #121",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye."
      },
      "ar": {
        "meaning": "يا حي يا قيوم برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين"
      },
      "id": {
        "meaning": "Wahai Yang Maha Hidup, wahai Yang Maha Berdiri Sendiri (tidak butuh segala sesuatu), dengan rahmat-Mu aku minta pertolongan, perbaikilah segala urusanku dan jangan diserahkan kepadaku walau sekejap mata pun."
      },
      "ur": {
        "meaning": "اے ہمیشہ زندہ، اے قائم رہنے والے، تیری رحمت سے میں مدد چاہتا ہوں، میرے تمام معاملات درست کر دے، اور مجھے ایک لمحہ کے لیے بھی میرے نفس کے حوالے نہ کر۔"
      },
      "tr": {
        "meaning": "Ey Hayy, ey Kayyûm! Rahmetinle senden yardım dilerim. Bütün işlerimi ıslah et. Beni göz açıp kapayıncaya kadar bile nefsime bırakma."
      },
      "fr": {
        "meaning": "Ô Vivant, ô Subsistant, j'implore secours auprès de Ta miséricorde. Améliore ma situation toute entière et ne m'abandonne pas à mon sort ne serait-ce le temps d'un clin d'œil."
      },
      "ru": {
        "meaning": "О Живой, о Поддерживающий жизнь! К милости Твоей я взываю о помощи. Приведи в порядок все мои дела и не предоставляй меня самому себе даже на мгновение ока."
      },
      "fa": {
        "meaning": "ای زنده جاوید، ای برپا دارنده (هستی)، به رحمتت پناه می‌جویم، همه کارهایم را اصلاح فرما و مرا حتی به اندازه چشم بر هم زدنی به خودم وامگذار."
      },
      "hi": {
        "meaning": "ऐ हमेशा ज़िन्दा, ऐ क़ायम रहने वाले, तेरी रहमत से मैं मदद चाहता हूँ, मेरे तमाम मामलात दुरुस्त कर दे, और मुझे एक लम्हे के लिए भी मेरे नफ़्स के हवाले न कर।"
      },
      "ms": {
        "meaning": "Wahai Tuhan Yang Maha Hidup, wahai Tuhan Yang Maha Berdiri Sendiri dengan rahmat-Mu aku memohon pertolongan, perbaikilah segala urusanku dan jangan Engkau serahkan aku kepada diriku sendiri walau sekejap mata."
      },
      "sw": {
        "meaning": "Ee Hai (Mwenye uhai), Ee Qayyum (Msimamizi wa viumbe vyote), kwa rehema yako naomba msaada, nitengenezee mambo yangu yote, wala usiniache kwa nafsi yangu hata kwa muda wa kupepesa jicho."
      },
      "bn": {
        "meaning": "হে চিরঞ্জীব, হে সবকিছুর ধারক! আপনার রহমতের উসিলায় আমি সাহায্য প্রার্থনা করছি। আমার সকল বিষয় সংশোধন করে দিন এবং আমাকে এক পলকের জন্যও আমার নিজের উপর ছেড়ে দিবেন না।"
      }
    }
  },
  {
    "id": "morning_14",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "transliteration": "Lā ilāha illallāhu waḥdahu lā sharīka lah, lahul-mulku wa lahul-ḥamdu wa huwa ʿalā kulli shayʾin qadīr",
    "source": "Bukhari 3293",
    "repeat": 100,
    "translations": {
      "en": {
        "meaning": "None has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise and He is over all things omnipotent."
      },
      "ar": {
        "meaning": "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير"
      },
      "id": {
        "meaning": "Tidak ada ilah yang berhak disembah kecuali Allah semata, tidak ada sekutu bagi-Nya. Milik-Nya kerajaan dan segala puji. Dia Mahakuasa atas segala sesuatu."
      },
      "ur": {
        "meaning": "اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کی بادشاہت ہے اور اسی کے لیے تمام تعریف ہے اور وہ ہر چیز پر قادر ہے۔"
      },
      "tr": {
        "meaning": "Allah'tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk O'nundur, hamd O'na mahsustur. O her şeye kadirdir."
      },
      "fr": {
        "meaning": "Il n'y a d'autre divinité qu'Allah Unique, sans associé. À Lui la royauté, à Lui la louange et Il est capable de toute chose."
      },
      "ru": {
        "meaning": "Нет божества, кроме Аллаха одного, нет у Него сотоварища. Ему принадлежит власть и Ему хвала, Он всё может."
      },
      "fa": {
        "meaning": "معبودی جز خدای یگانه نیست، شریکی ندارد، پادشاهی از آن اوست و ستایش مخصوص اوست و او بر همه چیز تواناست."
      },
      "hi": {
        "meaning": "अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई शरीक नहीं, उसी की बादशाहत है और उसी के लिए तमाम तारीफ़ है और वह हर चीज़ पर क़ादिर है।"
      },
      "ms": {
        "meaning": "Tiada Tuhan yang disembah melainkan Allah Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan, bagi-Nya segala puji dan Dia Maha Kuasa atas segala sesuatu."
      },
      "sw": {
        "meaning": "Hakuna mungu ila Mwenyezi Mungu peke yake, hana mshirika. Ufalme ni wake na sifa zote ni zake, naye ni Mwenye uwezo juu ya kila kitu."
      },
      "bn": {
        "meaning": "আল্লাহ ছাড়া কোন মাবুদ নেই, তিনি একক, তাঁর কোন শরীক নেই। রাজত্ব তাঁরই এবং সমস্ত প্রশংসা তাঁরই জন্য। তিনি সকল কিছুর উপর ক্ষমতাবান।"
      }
    }
  },
  {
    "id": "morning_15",
    "category_id": "daily_essentials",
    "subcategory_id": "morning",
    "tag": "morning_adhkar",
    "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "transliteration": "Subḥānallāhi wa biḥamdih",
    "source": "Muslim 2692",
    "repeat": 100,
    "translations": {
      "en": {
        "meaning": "How perfect Allah is and I praise Him."
      },
      "ar": {
        "meaning": "سبحان الله وبحمده"
      },
      "id": {
        "meaning": "Maha Suci Allah dan segala puji bagi-Nya."
      },
      "ur": {
        "meaning": "اللہ پاک ہے اس کی تعریف کے ساتھ۔"
      },
      "tr": {
        "meaning": "Allah'ı tenzih eder ve O'na hamdederim."
      },
      "fr": {
        "meaning": "Gloire et pureté à Allah et louange à Lui."
      },
      "ru": {
        "meaning": "Пречист Аллах и хвала Ему."
      },
      "fa": {
        "meaning": "منزه است خداوند و ستایش مخصوص اوست."
      },
      "hi": {
        "meaning": "अल्लाह पाक है उसकी तारीफ़ के साथ।"
      },
      "ms": {
        "meaning": "Maha Suci Allah dan dengan puji-Nya."
      },
      "sw": {
        "meaning": "Mwenyezi Mungu ametakasika na sifa zote ni zake."
      },
      "bn": {
        "meaning": "আল্লাহ পবিত্র এবং সমস্ত প্রশংসা তাঁরই।"
      }
    }
  }
]