[
  {
    "id": "seeker_1",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ وَحُبَّ عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّكَ",
    "transliteration": "Allāhumma innī asʾaluka ḥubbaka, wa ḥubba man yuḥibbuka, wa ḥubba ʿamalin yuqarribunī ilā ḥubbik",
    "source": "Tirmidhi 3490 (Seeking Allah's love)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for Your love, and the love of those who love You, and the love of deeds that bring me closer to Your love."
      },
      "ar": {
        "meaning": "اللهم إني أسألك حبك وحب من يحبك وحب عمل يقربني إلى حبك"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu cinta-Mu, dan cinta orang yang mencintai-Mu, serta cinta amal yang mendekatkanku kepada cinta-Mu."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے تیری محبت، اور ان کی محبت جو تجھ سے محبت کرتے ہیں، اور ایسے عمل کی محبت مانگتا ہوں جو مجھے تیری محبت کے قریب کرے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden sevgini, seni sevenlerin sevgisini ve sevgine ulaştıracak amellerin sevgisini dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande Ton amour, et l'amour de celui qui T'aime, et l'amour des œuvres qui me rapprochent de Ton amour."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя Твоей любви, и любви того, кто любит Тебя, и любви дела, которое приблизит меня к Твоей любви."
      },
      "fa": {
        "meaning": "بارالها، از تو محبتت را، و محبت کسی که تو را دوست دارد، و محبت عملی که مرا به محبت تو نزدیک کند، مسئلت دارم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे तेरी मोहब्बत, और उनसे मोहब्बत जो तुझसे मोहब्बत करते हैं, और ऐसे अमल की मोहब्बत मांगता हूँ जो मुझे तेरी मोहब्बत के करीब करे।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu cinta-Mu, dan cinta orang yang mencintai-Mu, serta cinta amal yang mendekatkanku kepada cinta-Mu."
      },
      "sw": {
        "meaning": "Ee Allah, hakika nakuomba mapenzi Yako, na mapenzi ya wale wanaokupenda, na mapenzi ya vitendo vinavyonileta karibu na mapenzi Yako."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে আপনার ভালোবাসা চাই, এবং যারা আপনাকে ভালোবাসেন তাদের ভালোবাসা চাই, এবং এমন আমলের ভালোবাসা চাই যা আমাকে আপনার ভালোবাসার কাছাকাছি নিয়ে যায়।"
      }
    }
  },
  {
    "id": "seeker_2",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ",
    "transliteration": "Allāhumma muṣarrifal-qulūb, ṣarrif qulūbanā ʿalā ṭāʿatik",
    "source": "Muslim 2654 (Steadfastness of heart)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, Turner of the hearts, turn our hearts to Your obedience."
      },
      "ar": {
        "meaning": "اللهم مصرف القلوب صرف قلوبنا على طاعتك"
      },
      "id": {
        "meaning": "Ya Allah, Dzat yang membolak-balikkan hati, palingkanlah hati kami untuk taat kepada-Mu."
      },
      "ur": {
        "meaning": "اے اللہ، دلوں کو پھیرنے والے، ہمارے دلوں کو اپنی اطاعت کی طرف پھیر دے۔"
      },
      "tr": {
        "meaning": "Ey kalpleri çeviren Allah'ım, kalplerimizi Sana itaate çevir."
      },
      "fr": {
        "meaning": "Ô Allah, Toi qui tournes les cœurs, tourne nos cœurs vers Ton obéissance."
      },
      "ru": {
        "meaning": "О Аллах, Изменяющий сердца, поверни наши сердца к Твоему повиновению."
      },
      "fa": {
        "meaning": "بارالها، ای گرداننده دل‌ها، دل‌های ما را بر طاعت خود بگردان."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, दिलों को पलटने वाले, हमारे दिलों को अपनी इताअत की तरफ मोड़ दे।"
      },
      "ms": {
        "meaning": "Ya Allah, Tuhan yang membolak-balikkan hati, palingkanlah hati kami untuk taat kepada-Mu."
      },
      "sw": {
        "meaning": "Ee Allah, Mpindua mioyo, pindua mioyo yetu kwenye utiifu Wako."
      },
      "bn": {
        "meaning": "হে আল্লাহ, হে অন্তরসমূহের পরিবর্তনকারী, আমাদের অন্তরসমূহকে আপনার আনুগত্যের দিকে ফিরিয়ে দিন।"
      }
    }
  },
  {
    "id": "seeker_3",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لاَ يَخْشَعُ وَمِنْ دُعَاءٍ لاَ يُسْمَعُ وَمِنْ نَفْسٍ لاَ تَشْبَعُ وَمِنْ عِلْمٍ لاَ يَنْفَعُ",
    "transliteration": "Allāhumma innī aʿūdhu bika min qalbin lā yakhshaʿ, wa min duʿāʾin lā yusmaʿ, wa min nafsin lā tashbaʿ, wa min ʿilmin lā yanfaʿ",
    "source": "Tirmidhi 3482 (Seeking refuge from unbeneficial things for spiritual growth)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in You from a heart that does not humble itself, from a supplication that is not heard, from a soul that is never satisfied, and from knowledge that does not benefit."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ بك من قلب لا يخشع ومن دعاء لا يسمع ومن نفس لا تشبع ومن علم لا ينفع"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari hati yang tidak khusyuk, dari doa yang tidak didengar, dari nafsu yang tidak pernah kenyang, dan dari ilmu yang tidak bermanfaat."
      },
      "ur": {
        "meaning": "اے اللہ، میں تیری پناہ چاہتا ہوں ایسے دل سے جو خشوع نہ کرے، اور ایسی دعا سے جو سنی نہ جائے، اور ایسے نفس سے جو سیر نہ ہو، اور ایسے علم سے جو نفع نہ دے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Huşu duymayan kalpten, işitilmeyen duadan, doymayan nefisten ve fayda vermeyen ilimden Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Toi contre un cœur qui ne s'humilie pas, contre une invocation qui n'est pas exaucée, contre une âme insatiable, et contre une science inutile."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прибегаю к Тебе от не смиренного сердца, и от мольбы, которая не слышится, и от ненасытной души, и от бесполезного знания."
      },
      "fa": {
        "meaning": "بارالها، من به تو پناه می‌برم از قلبی که خشوع نمی‌کند، و از دعایی که شنیده نمی‌شود، و از نفسی که سیر نمی‌شود، و از دانشی که سود نمی‌دهد."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तेरी पनाह चाहता हूँ ऐसे दिल से जो ख़शूअ न करे, और ऐसी दुआ से जो सुनी न जाए, और ऐसे नफ्स से जो सेर न हो, और ऐसे इल्म से जो नफ़ा न दे।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari hati yang tidak khusyuk, dari doa yang tidak didengar, dari nafsu yang tidak pernah kenyang, dan dari ilmu yang tidak bermanfaat."
      },
      "sw": {
        "meaning": "Ee Allah, hakika najikinga Kwako kutokana na moyo usionyenyea, na kutokana na dua isiyosikika, na kutokana na nafsi isiyoshiba, na kutokana na elimu isiyonufaisha."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই এমন অন্তর থেকে যা বিনয়ী হয় না, এমন দোয়া থেকে যা শোনা যায় না, এমন মন থেকে যা তৃপ্ত হয় না এবং এমন জ্ঞান থেকে যা উপকার দেয় না।"
      }
    }
  },
  {
    "id": "seeker_4",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ اجْعَلْ الْقُرْآنَ رَبِيعَ قَلْبِي وَنُورَ صَدْرِي وَجِلاَءَ حُزْنِي وَذَهَابَ هَمِّي",
    "transliteration": "Allāhummajʿalil-Qurʾāna rabīʿa qalbī, wa nūra ṣadrī, wa jilāʾa ḥuznī, wa dhahāba hammī",
    "source": "Musnad Ahmad 1/391 (Love of Quran, removing worries)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, make the Qur’an the spring of my heart, the light of my chest, the dispeller of my sadness and the remover of my worry."
      },
      "ar": {
        "meaning": "اللهم اجعل القرآن ربيع قلبي ونور صدري وجلاء حزني وذهاب همي"
      },
      "id": {
        "meaning": "Ya Allah, jadikanlah Al-Qur'an sebagai penyejuk hatiku, cahaya dadaku, penghilang kesedihanku, dan pelenyap kegundahanku."
      },
      "ur": {
        "meaning": "اے اللہ، قرآن کو میرے دل کی بہار، میرے سینے کا نور، میرے غم کا ہٹانے والا اور میری پریشانی کا دور کرنے والا بنا دے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Kur'an'ı kalbimin baharı, göğsümün nuru, üzüntümün gidericisi ve kederimin yok edicisi kıl."
      },
      "fr": {
        "meaning": "Ô Allah, fais du Coran le printemps de mon cœur, la lumière de ma poitrine, le dissipateur de ma tristesse et celui qui dissipe mon souci."
      },
      "ru": {
        "meaning": "О Аллах, сделай Коран весной моего сердца, светом моей груди, рассеивателем моей печали и устранителем моей тревоги."
      },
      "fa": {
        "meaning": "بارالها، قرآن را بهار دلم، و نور سینه‌ام، و برطرف کننده غم و اندوهم قرار ده."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, क़ुरआन को मेरे दिल की बहार, मेरे सीने का नूर, मेरे ग़म का हटाने वाला और मेरी परेशानी को दूर करने वाला बना दे।"
      },
      "ms": {
        "meaning": "Ya Allah, jadikanlah Al-Quran sebagai penyejuk hatiku, cahaya dadaku, penghilang kesedihanku, dan pelenyap kegundahanku."
      },
      "sw": {
        "meaning": "Ee Allah, lifanye Qur'ani liwe chemchemi ya moyo wangu, nuru ya kifua changu, kiondoa huzuni yangu, na kuondoa wasiwasi wangu."
      },
      "bn": {
        "meaning": "হে আল্লাহ, কুরআনকে আমার হৃদয়ের বসন্ত, আমার বক্ষের আলো, আমার দুঃখের অপসারণকারী এবং আমার উদ্বেগের দূরকারী বানিয়ে দিন।"
      }
    }
  },
  {
    "id": "seeker_5",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
    "transliteration": "Allāhumma innī asʾalukal-hudā wat-tuqā wal-ʿafāfa wal-ghinā",
    "source": "Muslim 2721 (Asking for guidance and piety)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for guidance, piety, abstinence (from unlawful things), and self-sufficiency."
      },
      "ar": {
        "meaning": "اللهم إني أسألك الهدى والتقى والعفاف والغنى"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, sifat iffah (menjaga diri dari yang haram), dan kekayaan jiwa (kecukupan)."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے ہدایت، تقویٰ، عفت اور غنا (خود کفالت) کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden hidayet, takva, iffet ve gönül zenginliği (ihtiyaçsızlık) dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande la guidée, la piété, la chasteté et la suffisance."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя руководства, богобоязненности, целомудрия и достаточности."
      },
      "fa": {
        "meaning": "بارالها، از تو هدایت و پرهیزگاری و عفت و بی‌نیازی مسئلت دارم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे हिदायत, तक़वा, इफ्फ़त (नाजायज़ चीज़ों से बचना) और गु़ना (आत्म-निर्भरता) का सवाल करता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, sifat iffah (menjaga diri dari yang haram), dan kekayaan jiwa (kecukupan)."
      },
      "sw": {
        "meaning": "Ee Allah, nakuomba uongofu, na uchamungu, na kujizuia (kutoka haramu), na utoshelevu."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে হেদায়েত, তাকওয়া, পবিত্রতা এবং সচ্ছলতা চাই।"
      }
    }
  },
  {
    "id": "seeker_6",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
    "transliteration": "Yā Muqallibal-qulūb, thabbit qalbī ʿalā dīnik",
    "source": "Tirmidhi 2140 (Steadfastness on religion)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Turner of the hearts, keep my heart firm upon Your religion."
      },
      "ar": {
        "meaning": "يا مقلب القلوب ثبت قلبي على دينك"
      },
      "id": {
        "meaning": "Wahai Dzat yang membolak-balikkan hati, tetapkanlah hatiku di atas agama-Mu."
      },
      "ur": {
        "meaning": "اے دلوں کو پلٹنے والے، میرے دل کو اپنے دین پر ثابت رکھ۔"
      },
      "tr": {
        "meaning": "Ey kalpleri çeviren! Kalbimi dinin üzere sabit kıl."
      },
      "fr": {
        "meaning": "Ô Toi qui tournes les cœurs, affermis mon cœur sur Ta religion."
      },
      "ru": {
        "meaning": "О Изменяющий сердца, укрепи мое сердце в Твоей религии."
      },
      "fa": {
        "meaning": "ای گرداننده دل‌ها، دل مرا بر دینت ثابت بدار."
      },
      "hi": {
        "meaning": "ऐ दिलों को पलटने वाले, मेरे दिल को अपने दीन पर क़ायम रख।"
      },
      "ms": {
        "meaning": "Wahai Dzat yang membolak-balikkan hati, tetapkanlah hatiku di atas agama-Mu."
      },
      "sw": {
        "meaning": "Ewe Mpindua mioyo, uifanye thabiti moyo wangu juu ya dini Yako."
      },
      "bn": {
        "meaning": "হে অন্তরসমূহ পরিবর্তনকারী, আমার অন্তরকে আপনার দ্বীনের উপর সুদৃঢ় রাখুন।"
      }
    }
  },
  {
    "id": "seeker_7",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
    "transliteration": "Allāhumma innī asʾalukal-jannah, wa aʿūdhu bika minan-nār",
    "source": "Abu Dawud 793, Ibn Majah 928 (Seeking Paradise and protection from Hellfire)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for Paradise and I seek refuge in You from the Fire."
      },
      "ar": {
        "meaning": "اللهم إني أسألك الجنة وأعوذ بك من النار"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu surga dan aku berlindung kepada-Mu dari neraka."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے جنت کا سوال کرتا ہوں اور جہنم کی آگ سے تیری پناہ چاہتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden Cenneti isterim ve Cehennemden Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande le Paradis et je cherche refuge auprès de Toi contre l'Enfer."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя Рая и прибегаю к Тебе от Огня."
      },
      "fa": {
        "meaning": "بارالها، از تو بهشت را می‌خواهم و از آتش به تو پناه می‌برم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे जन्नत का सवाल करता हूँ और जहन्नम की आग से तेरी पनाह चाहता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu syurga dan aku berlindung kepada-Mu dari neraka."
      },
      "sw": {
        "meaning": "Ee Allah, nakuomba Pepo na najikinga Kwako kutokana na Moto."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে জান্নাত চাই এবং জাহান্নামের আগুন থেকে আপনার আশ্রয় চাই।"
      }
    }
  },
  {
    "id": "seeker_8",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلًا مُتَقَبَّلًا",
    "transliteration": "Allāhumma innī asʾaluka ʿilman nāfiʿan, wa rizqan ṭayyiban, wa ʿamalan mutaqabbalā",
    "source": "Ibn Majah 925 (Seeking beneficial knowledge, good provision, and accepted deeds)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds."
      },
      "ar": {
        "meaning": "اللهم إني أسألك علما نافعا ورزقا طيبا وعملا متقبلا"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik, dan amal yang diterima."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے نفع بخش علم، پاکیزہ رزق، اور مقبول عمل کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden faydalı ilim, helal ve hoş rızık ve kabul edilmiş amel dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande une science utile, une bonne subsistance et une œuvre acceptée."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя полезного знания, благого удела и принятых деяний."
      },
      "fa": {
        "meaning": "بارالها، از تو دانش سودمند، روزی پاک، و عمل مورد قبول را می‌خواهم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे नफा देने वाला इल्म, पाकीज़ा रिज़्क़, और मक़बूल अमल का सवाल करता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik, dan amal yang diterima."
      },
      "sw": {
        "meaning": "Ee Allah, nakuomba elimu yenye manufaa, na riziki nzuri, na amali iliyokubaliwa."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুল হওয়া আমল চাই।"
      }
    }
  },
  {
    "id": "seeker_9",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
    "transliteration": "Allāhumma innī asʾalukal-ʿafwa wal-ʿāfiyah fid-dunyā wal-ākhirah",
    "source": "Tirmidhi 3514 (Seeking forgiveness and well-being in this world and the Hereafter)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for forgiveness and well-being in this world and the Hereafter."
      },
      "ar": {
        "meaning": "اللهم إني أسألك العفو والعافية في الدنيا والآخرة"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu ampunan dan keselamatan di dunia dan akhirat."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے دنیا اور آخرت میں معافی اور عافیت کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden dünyada ve ahirette af ve afiyet dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande le pardon et le bien-être dans ce monde et dans l'au-delà."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя прощения и благополучия в этом мире и в Последней жизни."
      },
      "fa": {
        "meaning": "بارالها، از تو عفو و عافیت در دنیا و آخرت را مسئلت دارم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे दुनिया और आखिरत में माफ़ी और आफ़ियत का सवाल करता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu keampunan dan keselamatan di dunia dan akhirat."
      },
      "sw": {
        "meaning": "Ee Allah, nakuomba msamaha na afya njema katika dunia na Akhera."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে দুনিয়া ও আখিরাতে ক্ষমা ও নিরাপত্তা চাই।"
      }
    }
  },
  {
    "id": "seeker_10",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "transliteration": "Allāhumma aʿinnī ʿalā dhikrika wa shukrika wa ḥusni ʿibādatik",
    "source": "Abu Dawud 1522, An-Nasa'i 1303 (Seeking help for remembrance, gratitude, and good worship)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, help me to remember You, and to thank You, and to worship You in the best manner."
      },
      "ar": {
        "meaning": "اللهم أعني على ذكرك وشكرك وحسن عبادتك"
      },
      "id": {
        "meaning": "Ya Allah, bantulah aku untuk senantiasa mengingat-Mu, mensyukuri nikmat-Mu, dan beribadah kepada-Mu dengan sebaik-baiknya."
      },
      "ur": {
        "meaning": "اے اللہ، مجھے اپنے ذکر پر، اپنے شکر پر، اور اپنی بہترین عبادت پر مدد فرما۔"
      },
      "tr": {
        "meaning": "Allah'ım! Seni zikretme, sana şükretme ve sana güzelce ibadet etme konusunda bana yardım et."
      },
      "fr": {
        "meaning": "Ô Allah, aide-moi à Te rappeler, à Te remercier et à T'adorer de la meilleure manière."
      },
      "ru": {
        "meaning": "О Аллах, помоги мне поминать Тебя, и благодарить Тебя, и наилучшим образом поклоняться Тебе."
      },
      "fa": {
        "meaning": "بارالها، مرا بر ذکرت، و شکرت، و نیکو عبادت کردنت یاری ده."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मुझे अपने ज़िक्र पर, अपने शुक्र पर, और अपनी बेहतरीन इबादत पर मदद फ़रमा।"
      },
      "ms": {
        "meaning": "Ya Allah, bantulah aku untuk senantiasa mengingat-Mu, mensyukuri nikmat-Mu, dan beribadah kepada-Mu dengan sebaik-baiknya."
      },
      "sw": {
        "meaning": "Ee Allah, nisaidie kukukumbuka, na kukushukuru, na kukuabudu kwa njia bora."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আপনার স্মরণে, আপনার কৃতজ্ঞতায় এবং আপনার সুন্দর ইবাদতে আমাকে সাহায্য করুন।"
      }
    }
  },
  {
    "id": "seeker_11",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ نَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ",
    "transliteration": "Allāhumma naqqi qalbī minal-khaṭāyā kamā naqqayta ath-thawbal-abyaḍa minad-danas",
    "source": "Bukhari 6368, Muslim 598 (Purification of the heart from sins)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, purify my heart from sins as You have purified the white garment from impurity."
      },
      "ar": {
        "meaning": "اللهم نق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس"
      },
      "id": {
        "meaning": "Ya Allah, sucikanlah hatiku dari kesalahan-kesalahan sebagaimana Engkau menyucikan pakaian putih dari kotoran."
      },
      "ur": {
        "meaning": "اے اللہ، میرے دل کو گناہوں سے ایسے پاک کر دے جیسے تو نے سفید کپڑے کو میل سے پاک کیا۔"
      },
      "tr": {
        "meaning": "Allah'ım! Kalbimi hatalardan, beyaz elbiseyi kirden temizlediğin gibi temizle."
      },
      "fr": {
        "meaning": "Ô Allah, purifie mon cœur des péchés comme Tu as purifié le vêtement blanc de la saleté."
      },
      "ru": {
        "meaning": "О Аллах, очисти мое сердце от грехов, как Ты очистил белую одежду от скверны."
      },
      "fa": {
        "meaning": "بارالها، قلب مرا از گناهان پاک گردان، همانگونه که لباس سفید را از آلودگی پاک ساختی."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मेरे दिल को गुनाहों से ऐसे पाक कर दे जैसे तूने सफ़ेद कपड़े को मैल से पाक किया।"
      },
      "ms": {
        "meaning": "Ya Allah, sucikanlah hatiku dari kesalahan-kesalahan sebagaimana Engkau menyucikan pakaian putih dari kotoran."
      },
      "sw": {
        "meaning": "Ee Allah, usafishe moyo wangu kutokana na dhambi kama ulivyosafisha nguo nyeupe kutokana na uchafu."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমার হৃদয়কে পাপ থেকে এমনভাবে পবিত্র করুন যেমন আপনি সাদা কাপড়কে ময়লা থেকে পবিত্র করেছেন।"
      }
    }
  },
  {
    "id": "seeker_12",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "رَبِّ زِدْنِي عِلْمًا",
    "transliteration": "Rabbi zidnī ʿilmā",
    "source": "Taha 20:114 (Asking for increase in knowledge)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "My Lord, increase me in knowledge."
      },
      "ar": {
        "meaning": "رب زدني علما"
      },
      "id": {
        "meaning": "Ya Tuhanku, tambahkanlah aku ilmu."
      },
      "ur": {
        "meaning": "اے میرے رب، میرے علم میں اضافہ فرما۔"
      },
      "tr": {
        "meaning": "Rabbim, ilmimi artır."
      },
      "fr": {
        "meaning": "Ô mon Seigneur, augmente-moi en science."
      },
      "ru": {
        "meaning": "Господи, приумножь мои знания."
      },
      "fa": {
        "meaning": "پروردگارا، بر علم من بیفزا."
      },
      "hi": {
        "meaning": "ऐ मेरे रब, मेरे इल्म में इज़ाफ़ा फ़रमा।"
      },
      "ms": {
        "meaning": "Ya Tuhanku, tambahkanlah aku ilmu."
      },
      "sw": {
        "meaning": "Mola wangu, niongezee elimu."
      },
      "bn": {
        "meaning": "হে আমার রব, আমার জ্ঞান বৃদ্ধি করুন।"
      }
    }
  },
  {
    "id": "seeker_13",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَغْرَمِ وَالْمَأْثَمِ",
    "transliteration": "Allāhumma innī aʿūdhu bika minal-kasali wal-haram, wal-maghrami wal-maʾtham",
    "source": "Bukhari 6369 (Seeking refuge from laziness and moral/financial burdens, aids steadfastness)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in You from laziness, and from extreme old age, and from debt, and from sin."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ بك من الكسل والهرم والمغرم والمأثم"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kemalasan, dari pikun (umur tua yang sangat), dari hutang, dan dari dosa."
      },
      "ur": {
        "meaning": "اے اللہ، میں تیری پناہ چاہتا ہوں سستی سے، اور بڑھاپے سے، اور قرض سے، اور گناہ سے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Tembellikten, ihtiyarlıktan (kötü yaşlılıktan), borçtan ve günahtan Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Toi contre la paresse, la vieillesse (extrême), les dettes et le péché."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прибегаю к Тебе от лени, и от дряхлости, и от долгов, и от греха."
      },
      "fa": {
        "meaning": "بارالها، من به تو پناه می‌برم از تنبلی و پیری و بدهکاری و گناه."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तेरी पनाह चाहता हूँ सुस्ती से, और बुढ़ापे से, और क़र्ज़ से, और गुनाह से।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kemalasan, dan dari nyanyuk (usia tua yang sangat), dari hutang, dan dari dosa."
      },
      "sw": {
        "meaning": "Ee Allah, hakika najikinga Kwako kutokana na uvivu, na uzee uliokithiri, na deni, na dhambi."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই অলসতা থেকে, বার্ধক্য থেকে, ঋণ থেকে এবং পাপ থেকে।"
      }
    }
  },
  {
    "id": "seeker_14",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ وَالْعَزِيمَةَ عَلَى الرُّشْدِ",
    "transliteration": "Allāhumma innī asʾalukath-thabāta fil-amri wal-ʿazīmata ʿalar-rushd",
    "source": "Tirmidhi 3233 (Seeking steadfastness and determination on righteousness)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for steadfastness in the matter (of faith) and determination upon the right path."
      },
      "ar": {
        "meaning": "اللهم إني أسألك الثبات في الأمر والعزيمة على الرشد"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu keteguhan dalam urusan (agama) dan keteguhan dalam kebenaran."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے معاملے میں ثابت قدمی اور ہدایت پر پختہ ارادے کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden işte sebat etmeyi, doğru yolda azimli olmayı dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande la constance dans l'affaire (de la foi) et la détermination sur la bonne voie."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя стойкости в деле (веры) и решимости в следовании прямому пути."
      },
      "fa": {
        "meaning": "بارالها، از تو ثبات در دین و عزم بر هدایت را مسئلت دارم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे मामले (दीन) में साबित क़दमी और हिदायत पर पक्का इरादा मांगता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu keteguhan dalam urusan (agama) dan keteguhan dalam kebenaran."
      },
      "sw": {
        "meaning": "Ee Allah, nakuomba uthabiti katika jambo (la imani) na azma juu ya njia iliyonyooka."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে দ্বীনের উপর দৃঢ়তা এবং সঠিক পথের উপর দৃঢ় সংকল্প চাই।"
      }
    }
  },
  {
    "id": "seeker_15",
    "category_id": "special_pathways",
    "subcategory_id": "seekers_path",
    "tag": "spiritual_growth_seeker",
    "arabic": "اللَّهُمَّ اجْعَلْ فِينَا نُورًا وَفِي قُلُوبِنَا نُورًا وَفِي سَمْعِنَا نُورًا وَفِي بَصَرِنَا نُورًا",
    "transliteration": "Allāhummajʿal fīnā nūrā, wa fī qulūbinā nūrā, wa fī samʿinā nūrā, wa fī baṣarinā nūrā",
    "source": "Bukhari 6316, Muslim 763 (Seeking light in all aspects of life and spiritual journey)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, place light within us, and in our hearts light, and in our hearing light, and in our sight light."
      },
      "ar": {
        "meaning": "اللهم اجعل فينا نورا وفي قلوبنا نورا وفي سمعنا نورا وفي بصرنا نورا"
      },
      "id": {
        "meaning": "Ya Allah, jadikanlah di dalam diri kami cahaya, dan di dalam hati kami cahaya, dan di dalam pendengaran kami cahaya, dan di dalam penglihatan kami cahaya."
      },
      "ur": {
        "meaning": "اے اللہ، ہمارے اندر نور پیدا کر، اور ہمارے دلوں میں نور، اور ہمارے سننے میں نور، اور ہمارے دیکھنے میں نور پیدا کر۔"
      },
      "tr": {
        "meaning": "Allah'ım! Bize nur ver, kalplerimize nur ver, kulağımıza nur ver, gözümüze nur ver."
      },
      "fr": {
        "meaning": "Ô Allah, place en nous une lumière, et dans nos cœurs une lumière, et dans notre ouïe une lumière, et dans notre vue une lumière."
      },
      "ru": {
        "meaning": "О Аллах, помести в нас свет, и в сердцах наших свет, и в слухе нашем свет, и в зрении нашем свет."
      },
      "fa": {
        "meaning": "بارالها، در ما نوری قرار ده، و در دل‌های ما نوری، و در شنوایی ما نوری، و در بینایی ما نوری."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, हमारे अंदर नूर पैदा कर, और हमारे दिलों में नूर, और हमारे सुनने में नूर, और हमारे देखने में नूर पैदा कर।"
      },
      "ms": {
        "meaning": "Ya Allah, jadikanlah di dalam diri kami cahaya, dan di dalam hati kami cahaya, dan di dalam pendengaran kami cahaya, dan di dalam penglihatan kami cahaya."
      },
      "sw": {
        "meaning": "Ee Allah, tia nuru ndani yetu, na katika nyoyo zetu nuru, na katika usikivu wetu nuru, na katika macho yetu nuru."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমাদের মধ্যে নূর দিন, এবং আমাদের অন্তরে নূর দিন, এবং আমাদের শ্রবণে নূর দিন, এবং আমাদের দৃষ্টিতে নূর দিন।"
      }
    }
  }
]