[
  {
    "id": "ruku_sujood_1",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
    "transliteration": "Subḥāna Rabbiyal-ʿAẓīm",
    "source": "Muslim 772",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "Glory be to my Lord, the Most Magnificent."
      },
      "ar": {
        "meaning": "سبحان ربي العظيم"
      },
      "id": {
        "meaning": "Maha Suci Tuhanku Yang Maha Agung."
      },
      "ur": {
        "meaning": "میرا رب، جو بہت عظمت والا ہے، پاک ہے۔"
      },
      "tr": {
        "meaning": "Rabbim olan Yüce Allah'ı tesbih ederim."
      },
      "fr": {
        "meaning": "Gloire à mon Seigneur, le Très Magnifique."
      },
      "ru": {
        "meaning": "Пречист мой Господь, Величайший."
      },
      "fa": {
        "meaning": "پاک است پروردگار بزرگ من."
      },
      "hi": {
        "meaning": "मेरा रब, जो बहुत अज़मत वाला है, पाक है।"
      },
      "ms": {
        "meaning": "Maha Suci Tuhanku Yang Maha Agung."
      },
      "sw": {
        "meaning": "Ametakasika Mola wangu, Aliye Mkubwa."
      },
      "bn": {
        "meaning": "আমার মহান প্রতিপালক পবিত্র।"
      }
    }
  },
  {
    "id": "ruku_sujood_2",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
    "transliteration": "Subḥānakallāhumma Rabbanā wa biḥamdika Allāhummaghfir lī",
    "source": "Bukhari 794",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "Glory be to You, O Allah, our Lord, and praise be to You. O Allah, forgive me."
      },
      "ar": {
        "meaning": "سبحانك اللهم ربنا وبحمدك اللهم اغفر لي"
      },
      "id": {
        "meaning": "Maha Suci Engkau ya Allah, Tuhan kami, dan dengan memuji-Mu. Ya Allah, ampunilah aku."
      },
      "ur": {
        "meaning": "پاک ہے تو اے اللہ، ہمارے رب، اور تیری ہی تعریف کے ساتھ۔ اے اللہ، مجھے بخش دے۔"
      },
      "tr": {
        "meaning": "Allah'ım, Rabbimiz! Seni hamdinle tesbih ederim. Allah'ım, beni affet."
      },
      "fr": {
        "meaning": "Gloire à Toi, ô Allah, notre Seigneur, et louange à Toi. Ô Allah, pardonne-moi."
      },
      "ru": {
        "meaning": "Пречист Ты, о Аллах, Господь наш, и хвала Тебе. О Аллах, прости меня."
      },
      "fa": {
        "meaning": "پاکا پروردگارا و به ستایش تو، ای الله، مرا ببخش."
      },
      "hi": {
        "meaning": "पाक है तू ऐ अल्लाह, हमारे रब, और तेरी ही तारीफ़ के साथ। ऐ अल्लाह, मुझे बख़्श दे।"
      },
      "ms": {
        "meaning": "Maha Suci Engkau ya Allah, Tuhan kami, dan dengan memuji-Mu. Ya Allah, ampunilah aku."
      },
      "sw": {
        "meaning": "Ametakasika Wewe, Ewe Allah, Mola wetu, na sifa ni Zako. Ewe Allah, nisamehe."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমাদের প্রতিপালক, আপনার পবিত্রতা বর্ণনা করছি এবং আপনার প্রশংসা করছি। হে আল্লাহ, আমাকে ক্ষমা করুন।"
      }
    }
  },
  {
    "id": "ruku_sujood_3",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ",
    "transliteration": "Subbūḥun Quddūsun Rabbul-Malāʾikati war-Rūḥ",
    "source": "Muslim 487",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "All-Glorious, All-Holy, Lord of the angels and the Spirit (Jibreel)."
      },
      "ar": {
        "meaning": "سبوح قدوس رب الملائكة والروح"
      },
      "id": {
        "meaning": "Maha Suci, Maha Kudus, Tuhan para malaikat dan Jibril."
      },
      "ur": {
        "meaning": "پاک ہے، پاکیزہ ہے، فرشتوں اور روح کا رب۔"
      },
      "tr": {
        "meaning": "Noksanlardan münezzeh, her türlü kusurdan arınmış, meleklerin ve Rûh'un Rabbi."
      },
      "fr": {
        "meaning": "Le Glorifié, le Saint, Seigneur des anges et de l'Esprit (Jibril)."
      },
      "ru": {
        "meaning": "Всеславный, Святейший, Господь ангелов и Духа (Джибриля)."
      },
      "fa": {
        "meaning": "پاک و بسیار مقدس است، پروردگار فرشتگان و روح (جبرئیل)."
      },
      "hi": {
        "meaning": "पाक है, पाक है, फ़रिश्तों और रूह (जिबरील) का रब।"
      },
      "ms": {
        "meaning": "Maha Suci, Maha Kudus, Tuhan para malaikat dan Jibril."
      },
      "sw": {
        "meaning": "Utakasifu na Utakatifu, Mola wa malaika na Roho (Jibril)."
      },
      "bn": {
        "meaning": "সর্বাধিক পবিত্র, সর্বাধিক মহিমান্বিত, ফেরেশতাগণ ও রূহের (জিবরাঈল আঃ) প্রতিপালক।"
      }
    }
  },
  {
    "id": "ruku_sujood_4",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ",
    "transliteration": "Subḥāna Dhil-Jabarūti wal-Malakūti wal-Kibriyāʾi wal-ʿAẓamati",
    "source": "Abu Dawud 873",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "Glory be to the Possessor of immense power, of sovereignty, of magnificence, and of grandeur."
      },
      "ar": {
        "meaning": "سبحان ذي الجبروت والملكوت والكبرياء والعظمة"
      },
      "id": {
        "meaning": "Maha Suci Pemilik kekuasaan, kerajaan, keagungan, dan kebesaran."
      },
      "ur": {
        "meaning": "پاک ہے وہ جو جبروت، ملکوت، کبریائی اور عظمت کا مالک ہے۔"
      },
      "tr": {
        "meaning": "Kudret, hükümranlık, azamet ve yücelik sahibi olan Allah'ı tesbih ederim."
      },
      "fr": {
        "meaning": "Gloire à Celui qui possède la puissance immense, la souveraineté, la magnificence et la grandeur."
      },
      "ru": {
        "meaning": "Пречист Обладатель могущества, царства, величия и славы."
      },
      "fa": {
        "meaning": "پاک است صاحب جبروت و ملکوت و کبریا و عظمت."
      },
      "hi": {
        "meaning": "पाक है वह जो ज़बरदस्त कुव्वत, बादशाही, अज़मत और बुज़ुर्गी का मालिक है।"
      },
      "ms": {
        "meaning": "Maha Suci Pemilik kekuasaan, kerajaan, keagungan, dan kebesaran."
      },
      "sw": {
        "meaning": "Ametakasika Mwenye nguvu nyingi, wa ufalme, wa utukufu, na wa ukuu."
      },
      "bn": {
        "meaning": "পবিত্র সেই সত্তা যিনি ক্ষমতা, রাজত্ব, অহংকার এবং মহত্ত্বের অধিকারী।"
      }
    }
  },
  {
    "id": "ruku_sujood_5",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي وَمُخِّي وَعَظْمِي وَعَصَبِي",
    "transliteration": "Allāhumma laka rakaʿtu, wa bika āmantu, wa laka aslamtu, khashaʿa laka samʿī wa baṣarī wa mukhkhī wa ʿaẓmī wa ʿaṣabī",
    "source": "Muslim 771",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, to You I have bowed, and in You I have believed, and to You I have submitted. My hearing, my sight, my brain, my bones, and my nerves are humbled before You."
      },
      "ar": {
        "meaning": "اللهم لك ركعت، وبك آمنت، ولك أسلمت، خشع لك سمعي وبصري ومخي وعظمي وعصبي"
      },
      "id": {
        "meaning": "Ya Allah, kepada-Mu aku rukuk, dan kepada-Mu aku beriman, dan kepada-Mu aku berserah diri. Telingaku, penglihatanku, otakku, tulangku, dan sarafku tunduk kepada-Mu."
      },
      "ur": {
        "meaning": "اے اللہ! میں نے تیرے لیے رکوع کیا، اور تجھ پر ایمان لایا، اور تیری فرمانبرداری کی۔ میرے کان، میری آنکھ، میرا دماغ، میری ہڈیاں اور میری رگیں تیرے سامنے عاجزی کر رہی ہیں۔"
      },
      "tr": {
        "meaning": "Allah'ım, Sana rükû ettim, Sana iman ettim ve Sana teslim oldum. Kulağım, gözüm, beynim, kemiğim ve sinirim Sana huşu içinde boyun eğdi."
      },
      "fr": {
        "meaning": "Ô Allah, pour Toi je me suis incliné, et en Toi j'ai cru, et à Toi je me suis soumis. Mon ouïe, ma vue, mon cerveau, mes os et mes nerfs se sont humblement soumis à Toi."
      },
      "ru": {
        "meaning": "О Аллах, Тебе я склонился в поясном поклоне, и в Тебя я уверовал, и Тебе я предался. Мой слух, мое зрение, мой мозг, мои кости и мои нервы смирились пред Тобой."
      },
      "fa": {
        "meaning": "ای الله، برای تو رکوع کردم، و به تو ایمان آوردم، و تسلیم تو شدم. گوشم و چشمم و مغزم و استخوانم و عصبم برای تو خاشع شدند."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैंने तेरे लिए रुकू किया, और तुझ पर ईमान लाया, और तेरी फ़रमाबरदारी की। मेरे कान, मेरी आँख, मेरा दिमाग़, मेरी हड्डियाँ और मेरी रग़ें तेरे सामने आजिज़ हैं।"
      },
      "ms": {
        "meaning": "Ya Allah, kepada-Mu aku rukuk, dan kepada-Mu aku beriman, dan kepada-Mu aku berserah diri. Telingaku, penglihatanku, otakku, tulangku, dan sarafku tunduk kepada-Mu."
      },
      "sw": {
        "meaning": "Ewe Allah, Kwako nimeinama, na Kwako nimeamini, na Kwako nimejisalimisha. Usikivu wangu, uoni wangu, ubongo wangu, mifupa yangu, na mishipa yangu yamenyenyekea Kwako."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার জন্য রুকু করেছি, আপনার প্রতি ঈমান এনেছি, এবং আপনার কাছে আত্মসমর্পণ করেছি। আমার কান, আমার চোখ, আমার মস্তিষ্ক, আমার হাড় এবং আমার স্নায়ু আপনার সামনে বিনম্র।"
      }
    }
  },
  {
    "id": "ruku_sujood_6",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "سُبْحَانَ رَبِّيَ الأَعْلَى",
    "transliteration": "Subḥāna Rabbiyal-Aʿlā",
    "source": "Muslim 772",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "Glory be to my Lord, the Most High."
      },
      "ar": {
        "meaning": "سبحان ربي الأعلى"
      },
      "id": {
        "meaning": "Maha Suci Tuhanku Yang Maha Tinggi."
      },
      "ur": {
        "meaning": "میرا رب، جو سب سے بلند ہے، پاک ہے۔"
      },
      "tr": {
        "meaning": "Rabbim olan en yüce Allah'ı tesbih ederim."
      },
      "fr": {
        "meaning": "Gloire à mon Seigneur, le Très Haut."
      },
      "ru": {
        "meaning": "Пречист мой Господь, Всевышний."
      },
      "fa": {
        "meaning": "پاک است پروردگار بلند مرتبه من."
      },
      "hi": {
        "meaning": "मेरा रब, जो सबसे बुलंद है, पाक है।"
      },
      "ms": {
        "meaning": "Maha Suci Tuhanku Yang Maha Tinggi."
      },
      "sw": {
        "meaning": "Ametakasika Mola wangu, Aliye Juu kabisa."
      },
      "bn": {
        "meaning": "আমার মহান প্রতিপালক পবিত্র।"
      }
    }
  },
  {
    "id": "ruku_sujood_7",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
    "transliteration": "Subḥānakallāhumma Rabbanā wa biḥamdika Allāhummaghfir lī",
    "source": "Bukhari 794",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "Glory be to You, O Allah, our Lord, and praise be to You. O Allah, forgive me."
      },
      "ar": {
        "meaning": "سبحانك اللهم ربنا وبحمدك اللهم اغفر لي"
      },
      "id": {
        "meaning": "Maha Suci Engkau ya Allah, Tuhan kami, dan dengan memuji-Mu. Ya Allah, ampunilah aku."
      },
      "ur": {
        "meaning": "پاک ہے تو اے اللہ، ہمارے رب، اور تیری ہی تعریف کے ساتھ۔ اے اللہ، مجھے بخش دے۔"
      },
      "tr": {
        "meaning": "Allah'ım, Rabbimiz! Seni hamdinle tesbih ederim. Allah'ım, beni affet."
      },
      "fr": {
        "meaning": "Gloire à Toi, ô Allah, notre Seigneur, et louange à Toi. Ô Allah, pardonne-moi."
      },
      "ru": {
        "meaning": "Пречист Ты, о Аллах, Господь наш, и хвала Тебе. О Аллах, прости меня."
      },
      "fa": {
        "meaning": "پاکا پروردگارا و به ستایش تو، ای الله، مرا ببخش."
      },
      "hi": {
        "meaning": "पाक है तू ऐ अल्लाह, हमारे रब, और तेरी ही तारीफ़ के साथ। ऐ अल्लाह, मुझे बख़्श दे।"
      },
      "ms": {
        "meaning": "Maha Suci Engkau ya Allah, Tuhan kami, dan dengan memuji-Mu. Ya Allah, ampunilah aku."
      },
      "sw": {
        "meaning": "Ametakasika Wewe, Ewe Allah, Mola wetu, na sifa ni Zako. Ewe Allah, nisamehe."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমাদের প্রতিপালক, আপনার পবিত্রতা বর্ণনা করছি এবং আপনার প্রশংসা করছি। হে আল্লাহ, আমাকে ক্ষমা করুন।"
      }
    }
  },
  {
    "id": "ruku_sujood_8",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ",
    "transliteration": "Allāhumma ghfir lī dhanbī kullahu, diqqahu wa jillahu, wa awwalahu wa ākhirahu, wa ʿalāniyatahu wa sirrahu",
    "source": "Muslim 483",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, forgive me all my sins, the minor and the major, the first and the last, the apparent and the hidden."
      },
      "ar": {
        "meaning": "اللهم اغفر لي ذنبي كله، دقه وجله، وأوله وآخره، وعلانيته وسره"
      },
      "id": {
        "meaning": "Ya Allah, ampunilah semua dosaku, yang kecil maupun yang besar, yang awal maupun yang akhir, yang terang-terangan maupun yang tersembunyi."
      },
      "ur": {
        "meaning": "اے اللہ! میرے تمام گناہ بخش دے، چھوٹے اور بڑے، پہلے اور آخری، ظاہر اور پوشیدہ۔"
      },
      "tr": {
        "meaning": "Allah'ım, günahımın hepsini, küçüğünü ve büyüğünü, ilkini ve sonuncusunu, açığını ve gizlisini bana bağışla."
      },
      "fr": {
        "meaning": "Ô Allah, pardonne-moi tous mes péchés, les petits et les grands, les premiers et les derniers, les apparents et les cachés."
      },
      "ru": {
        "meaning": "О Аллах, прости мне все мои грехи, малые и большие, первые и последние, явные и скрытые."
      },
      "fa": {
        "meaning": "ای الله، همه گناهانم را بیامرز، کوچک و بزرگ، اول و آخر، آشکار و پنهانش را."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मेरे तमाम गुनाह बख़्श दे, छोटे और बड़े, पहले और आख़िरी, ज़ाहिर और पोशीदा।"
      },
      "ms": {
        "meaning": "Ya Allah, ampunilah semua dosaku, yang kecil maupun yang besar, yang awal maupun yang akhir, yang terang-terangan maupun yang tersembunyi."
      },
      "sw": {
        "meaning": "Ewe Allah, nisamehe dhambi zangu zote, ndogo na kubwa, za mwanzo na za mwisho, za wazi na za siri."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমার সমস্ত গুনাহ ক্ষমা করুন, ছোট ও বড়, প্রথম ও শেষ, প্রকাশ্য ও গোপন।"
      }
    }
  },
  {
    "id": "ruku_sujood_9",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ",
    "transliteration": "Allāhumma laka sajadtu, wa bika āmantu, wa laka aslamtu, sajada wajhiya lilladhī khalaqahu wa ṣawwarahu wa shaqqa samʿahu wa baṣarahu, tabārakallāhu aḥsanul-khāliqīn",
    "source": "Muslim 771",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, to You I have prostrated, and in You I have believed, and to You I have submitted. My face has prostrated to the One Who created it, fashioned it, and gave it its hearing and sight. Blessed is Allah, the Best of creators."
      },
      "ar": {
        "meaning": "اللهم لك سجدت، وبك آمنت، ولك أسلمت، سجد وجهي للذي خلقه وصوره وشق سمعه وبصره، تبارك الله أحسن الخالقين"
      },
      "id": {
        "meaning": "Ya Allah, kepada-Mu aku bersujud, dan kepada-Mu aku beriman, dan kepada-Mu aku berserah diri. Wajahku bersujud kepada Dzat yang menciptakannya, membentuknya, dan membuka pendengaran serta penglihatannya. Maha Berkah Allah, sebaik-baik Pencipta."
      },
      "ur": {
        "meaning": "اے اللہ! میں نے تیرے لیے سجدہ کیا، اور تجھ پر ایمان لایا، اور تیری فرمانبرداری کی۔ میرے چہرے نے اس ذات کو سجدہ کیا جس نے اسے پیدا کیا، اسے صورت دی اور اس کے کان اور آنکھیں کھولیں۔ بابرکت ہے اللہ، سب سے بہترین پیدا کرنے والا۔"
      },
      "tr": {
        "meaning": "Allah'ım, Sana secde ettim, Sana iman ettim ve Sana teslim oldum. Yüzüm; onu yaratana, ona şekil verene, işitmesini ve görmesini açana secde etti. Yaratanların en güzeli olan Allah mübarek olsun."
      },
      "fr": {
        "meaning": "Ô Allah, pour Toi je me suis prosterné, et en Toi j'ai cru, et à Toi je me suis soumis. Mon visage s'est prosterné devant Celui qui l'a créé, l'a façonné, et lui a donné son ouïe et sa vue. Béni soit Allah, le Meilleur des créateurs."
      },
      "ru": {
        "meaning": "О Аллах, Тебе я совершил земной поклон, и в Тебя я уверовал, и Тебе я предался. Мое лицо совершило земной поклон Тому, Кто сотворил его, придал ему образ и даровал ему слух и зрение. Благословен Аллах, Наилучший из творцов."
      },
      "fa": {
        "meaning": "ای الله، برای تو سجده کردم، و به تو ایمان آوردم، و تسلیم تو شدم. چهره‌ام برای کسی سجده کرد که آن را آفرید و صورت داد و گوش و چشمش را باز کرد. پربرکت است الله، بهترین آفرینندگان."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैंने तेरे लिए सजदा किया, और तुझ पर ईमान लाया, और तेरी फ़रमाबरदारी की। मेरे चेहरे ने उस ज़ात को सजदा किया जिसने उसे पैदा किया, उसे सूरत दी और उसके कान और आँखें खोलीं। बाबरकत है अल्लाह, सबसे बेहतरीन पैदा करने वाला।"
      },
      "ms": {
        "meaning": "Ya Allah, kepada-Mu aku bersujud, dan kepada-Mu aku beriman, dan kepada-Mu aku berserah diri. Wajahku bersujud kepada Zat yang menciptakannya, membentuknya, dan membuka pendengaran serta penglihatannya. Maha Berkat Allah, sebaik-baik Pencipta."
      },
      "sw": {
        "meaning": "Ewe Allah, Kwako nimesujudu, na Kwako nimeamini, na Kwako nimejisalimisha. Uso wangu umemkabili Yule aliyeumba na kupa sura, na kufungua usikivu na uoni wake. Amebarikiwa Allah, Mbora wa waumbaji."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার জন্য সিজদা করেছি, আপনার প্রতি ঈমান এনেছি এবং আপনার কাছে আত্মসমর্পণ করেছি। আমার মুখমণ্ডল সেই সত্তার জন্য সিজদা করেছে যিনি এটিকে সৃষ্টি করেছেন, আকৃতি দিয়েছেন এবং এর শ্রবণশক্তি ও দৃষ্টিশক্তি উন্মোচন করেছেন। বরকতময় আল্লাহ, যিনি সর্বোত্তম সৃষ্টিকর্তা।"
      }
    }
  },
  {
    "id": "ruku_sujood_10",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي، وَارْزُقْنِي",
    "transliteration": "Allāhumma ghfir lī, warḥamnī, wahdinī, wa ʿāfinī, warzuqnī",
    "source": "Muslim 2697",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, forgive me, have mercy on me, guide me, grant me well-being, and provide for me."
      },
      "ar": {
        "meaning": "اللهم اغفر لي، وارحمني، واهدني، وعافني، وارزقني"
      },
      "id": {
        "meaning": "Ya Allah, ampunilah aku, rahmatilah aku, berilah petunjuk kepadaku, berilah kesehatan kepadaku, dan berilah rezeki kepadaku."
      },
      "ur": {
        "meaning": "اے اللہ! مجھے بخش دے، مجھ پر رحم فرما، مجھے ہدایت دے، مجھے عافیت عطا فرما، اور مجھے رزق دے۔"
      },
      "tr": {
        "meaning": "Allah'ım, beni affet, bana merhamet et, bana hidayet ver, bana afiyet ver ve bana rızık ver."
      },
      "fr": {
        "meaning": "Ô Allah, pardonne-moi, fais-moi miséricorde, guide-moi, accorde-moi le bien-être, et pourvois à mes besoins."
      },
      "ru": {
        "meaning": "О Аллах, прости меня, смилуйся надо мной, веди меня прямым путем, даруй мне благополучие и надели меня уделом."
      },
      "fa": {
        "meaning": "ای الله، مرا ببخش، به من رحم کن، هدایتم کن، عافیتم ده، و روزی‌ام ده."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मुझे माफ़ कर दे, मुझ पर रहम फ़रमा, मुझे हिदायत दे, मुझे आफ़ियत अता फ़रमा, और मुझे रिज़्क़ दे।"
      },
      "ms": {
        "meaning": "Ya Allah, ampunilah aku, rahmatilah aku, berilah petunjuk kepadaku, berilah kesihatan kepadaku, dan berilah rezeki kepadaku."
      },
      "sw": {
        "meaning": "Ewe Allah, nisamehe, nirehemu, niongoze, nipatie afya, na uniruzuku."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমাকে ক্ষমা করুন, আমার প্রতি রহম করুন, আমাকে হেদায়েত দিন, আমাকে সুস্থতা দিন এবং আমাকে রিযিক দিন।"
      }
    }
  },
  {
    "id": "ruku_sujood_11",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
    "transliteration": "Allāhumma innī aʿūdhu biriḍāka min sakhaṭika, wa bimuʿāfātika min ʿuqūbatika, wa aʿūdhu bika minka, lā uḥṣī thanāʾan ʿalayka, Anta kamā athnayta ʿalā nafsika",
    "source": "Muslim 486",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in Your pleasure from Your wrath, and in Your forgiveness from Your punishment, and I seek refuge in You from You. I cannot enumerate Your praises; You are as You have praised Yourself."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ برضاك من سخطك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصي ثناء عليك، أنت كما أثنيت على نفسك"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung dengan keridaan-Mu dari kemurkaan-Mu, dan dengan ampunan-Mu dari hukuman-Mu, dan aku berlindung kepada-Mu dari (azab)Mu. Aku tidak mampu menghitung pujian atas-Mu. Engkau adalah sebagaimana Engkau memuji diri-Mu sendiri."
      },
      "ur": {
        "meaning": "اے اللہ! میں تیری رضا کے ساتھ تیری ناراضی سے پناہ مانگتا ہوں، اور تیری بخشش کے ساتھ تیری سزا سے پناہ مانگتا ہوں، اور میں تجھ سے ہی تیری (ناراضی) سے پناہ مانگتا ہوں۔ میں تیری تعریف کا شمار نہیں کر سکتا، تو ایسا ہی ہے جیسا تو نے خود اپنی تعریف کی ہے۔"
      },
      "tr": {
        "meaning": "Allah'ım, gazabından rızana, cezandan affına sığınırım. Senden yine Sana sığınırım. Sana layık olduğu gibi hamd edemem. Sen kendini övdüğün gibisin."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Ton agrément contre Ta colère, et auprès de Ton pardon contre Ton châtiment, et je cherche refuge auprès de Toi contre Toi. Je ne saurais énumérer Tes louanges; Tu es tel que Tu T'es loué Toi-même."
      },
      "ru": {
        "meaning": "О Аллах, я прибегаю к Твоему довольству от Твоего гнева, и к Твоему прощению от Твоего наказания, и я прибегаю к Тебе от Тебя. Я не могу перечислить все Твои похвалы; Ты такой, каким Ты Сам Себя похвалил."
      },
      "fa": {
        "meaning": "ای الله، من به رضایت تو از خشمت پناه می‌برم، و به عافیتت از مجازاتت، و به تو از خودت پناه می‌برم. نمی‌توانم ثنای تو را شمارش کنم، تو آنچنان هستی که خودت را ثنا گفته‌ای."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तेरी रज़ा के साथ तेरी नाराज़गी से पनाह मांगता हूँ, और तेरी बख़्शिश के साथ तेरी सज़ा से पनाह मांगता हूँ, और मैं तुझसे ही तेरी (नाराज़गी) से पनाह मांगता हूँ। मैं तेरी तारीफ़ का शुमार नहीं कर सकता, तू ऐसा ही है जैसा तूने ख़ुद अपनी तारीफ़ की है।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung dengan keredhaan-Mu dari kemurkaan-Mu, dan dengan keampunan-Mu dari hukuman-Mu, dan aku berlindung kepada-Mu dari (azab)Mu. Aku tidak mampu menghitung pujian atas-Mu. Engkau adalah sebagaimana Engkau memuji diri-Mu sendiri."
      },
      "sw": {
        "meaning": "Ewe Allah, hakika mimi najikinga kwa radhi zako kutokana na ghadhabu zako, na kwa msamaha wako kutokana na adhabu yako, na najikinga Kwako kutokana na Wewe. Siwezi kukuhesabia sifa; Wewe ni kama Ulivyojisifu mwenyewe."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার সন্তুষ্টির মাধ্যমে আপনার ক্রোধ থেকে আশ্রয় চাই, এবং আপনার ক্ষমার মাধ্যমে আপনার শাস্তি থেকে আশ্রয় চাই, আর আমি আপনার থেকে আপনার (শাস্তি) থেকে আশ্রয় চাই। আমি আপনার প্রশংসা গণনা করতে সক্ষম নই; আপনি তেমনই যেমন আপনি নিজের প্রশংসা করেছেন।"
      }
    }
  },
  {
    "id": "ruku_sujood_12",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءُ السَّمَاوَاتِ وَمِلْءُ الأَرْضِ وَمِلْءُ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ",
    "transliteration": "Allāhumma Rabbanā lakal-ḥamdu milʾus-samāwāti wa milʾul-arḍi wa milʾu mā shiʾta min shayʾin baʿdu",
    "source": "Muslim 476",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, our Lord, to You be all praise, filling the heavens, and filling the earth, and filling whatever else You wish."
      },
      "ar": {
        "meaning": "اللهم ربنا لك الحمد ملء السماوات وملء الأرض وملء ما شئت من شيء بعد"
      },
      "id": {
        "meaning": "Ya Allah, Tuhan kami, bagi-Mu segala puji sepenuh langit, dan sepenuh bumi, dan sepenuh apa pun yang Engkau kehendaki setelah itu."
      },
      "ur": {
        "meaning": "اے اللہ، ہمارے رب، تیرے ہی لیے تمام تعریفیں ہیں جو آسمانوں اور زمین کو بھر دیں، اور اس کے بعد جو تو چاہے اس کو بھی بھر دیں۔"
      },
      "tr": {
        "meaning": "Allah'ım, Rabbimiz! Bütün hamd, gökler dolusu, yer dolusu ve bundan sonra dilediğin her şey dolusu yalnızca Sana mahsustur."
      },
      "fr": {
        "meaning": "Ô Allah, notre Seigneur, à Toi toute louange, remplissant les cieux, et remplissant la terre, et remplissant tout ce que Tu veux après cela."
      },
      "ru": {
        "meaning": "О Аллах, Господь наш, Тебе хвала, наполняющая небеса, и наполняющая землю, и наполняющая все, что Ты пожелаешь после этого."
      },
      "fa": {
        "meaning": "ای الله، پروردگار ما، سپاس و ستایش از آن توست به اندازه پر بودن آسمان‌ها و زمین و به اندازه هر آنچه پس از آن بخواهی."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, हमारे रब, तेरे ही लिए तमाम तारीफ़ें हैं जो आसमानों और ज़मीन को भर दें, और इसके बाद जो तू चाहे उसको भी भर दें।"
      },
      "ms": {
        "meaning": "Ya Allah, Tuhan kami, bagi-Mu segala puji sepenuh langit, dan sepenuh bumi, dan sepenuh apa pun yang Engkau kehendaki setelah itu."
      },
      "sw": {
        "meaning": "Ewe Allah, Mola wetu, sifa zote njema ni Zako, zikijaza mbingu, na zikijaza ardhi, na zikijaza chochote unachokitaka baada ya hapo."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমাদের প্রতিপালক, আপনার জন্যই সমস্ত প্রশংসা আকাশসমূহ পূর্ণ করে, পৃথিবী পূর্ণ করে এবং এরপর আপনি যা চান তা পূর্ণ করে।"
      }
    }
  },
  {
    "id": "ruku_sujood_13",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، لاَ إِلَهَ إِلاَّ أَنْتَ",
    "transliteration": "Allāhumma ghfir lī mā qaddamtu wa mā akhkhartu wa mā asrartu wa mā aʿlantu wa mā asraftu wa mā Anta aʿlamu bihi minnī, Antal-Muqaddimu wa Antal-Muʾakhkhiru, lā ilāha illā Anta",
    "source": "Muslim 771",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, forgive me for what I have sent forth and what I have held back, what I have concealed and what I have done openly, what I have exceeded in and what You are more knowledgeable of than me. You are the Advancer and You are the Delayer. There is no deity worthy of worship except You."
      },
      "ar": {
        "meaning": "اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني، أنت المقدم وأنت المؤخر، لا إله إلا أنت"
      },
      "id": {
        "meaning": "Ya Allah, ampunilah dosaku yang telah lalu dan yang akan datang, yang tersembunyi dan yang terang-terangan, yang aku lakukan secara berlebihan, dan apa yang Engkau lebih mengetahui daripadaku. Engkaulah Yang Maha Mendahulukan dan Engkaulah Yang Maha Mengakhirkan. Tiada ilah yang berhak disembah kecuali Engkau."
      },
      "ur": {
        "meaning": "اے اللہ! میری مغفرت فرما ان گناہوں کی جو میں نے پہلے کیے اور جو میں نے بعد میں کیے، جو میں نے چھپ کر کیے اور جو میں نے ظاہر ہو کر کیے، اور جو میں نے اسراف کیے اور جو تجھ کو مجھ سے زیادہ معلوم ہیں۔ تو ہی آگے کرنے والا ہے اور تو ہی پیچھے کرنے والا ہے، تیرے سوا کوئی معبود نہیں۔"
      },
      "tr": {
        "meaning": "Allah'ım, geçmiş ve gelecek, gizli ve açık, aşırıya gittiğim ve Senin benden daha iyi bildiğin günahlarımı bağışla. Sen öne geçirensin, Sen geriye bırakansın. Senden başka ilah yoktur."
      },
      "fr": {
        "meaning": "Ô Allah, pardonne-moi ce que j'ai fait avant et ce que j'ai fait après, ce que j'ai caché et ce que j'ai fait ouvertement, ce que j'ai exagéré et ce que Tu connais mieux que moi. Tu es Celui qui avance et Tu es Celui qui retarde. Il n'y a de divinité digne d'adoration que Toi."
      },
      "ru": {
        "meaning": "О Аллах, прости мне то, что я совершил ранее и что отложил, что скрыл и что сделал явно, что превысил меру и о чем Ты знаешь лучше меня. Ты — Продвигающий и Ты — Откладывающий. Нет божества, кроме Тебя."
      },
      "fa": {
        "meaning": "ای الله، مرا ببخش آنچه پیش فرستادم و آنچه به تأخیر انداختم، آنچه پنهان کردم و آنچه آشکار ساختم، آنچه اسراف کردم و آنچه تو از من داناتری. تو پیش‌برنده و تو پس‌اندازنده هستی، هیچ معبودی جز تو نیست."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मेरी माफ़िरत फ़रमा उन गुनाहों की जो मैंने पहले किए और जो मैंने बाद में किए, जो मैंने छुप कर किए और जो मैंने ज़ाहिर हो कर किए, और जो मैंने इस्राफ़ किए और जो तुझको मुझसे ज़्यादा मालूम हैं। तू ही आगे करने वाला है और तू ही पीछे करने वाला है, तेरे सिवा कोई माबूद नहीं।"
      },
      "ms": {
        "meaning": "Ya Allah, ampunilah dosaku yang telah lalu dan yang akan datang, yang tersembunyi dan yang terang-terangan, yang aku lakukan secara berlebihan, dan apa yang Engkau lebih mengetahui daripadaku. Engkaulah Yang Maha Mendahulukan dan Engkaulah Yang Maha Mengakhirkan. Tiada Tuhan yang berhak disembah melainkan Engkau."
      },
      "sw": {
        "meaning": "Ewe Allah, nisamehe yale niliyoyafanya kabla na yale niliyoyaacha, yale niliyoyaficha na yale niliyoyadhihirisha, na yale niliyoyapitiliza na yale unayoyajua zaidi kuliko mimi. Wewe ndiye Ulitanguliza na Wewe ndiye Uliyechelewesha. Hapana mola ila Wewe."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আপনি আমাকে ক্ষমা করুন আমার পূর্বেকার ও পরের, গোপন ও প্রকাশ্য সকল গুনাহ, আর যা আমি অন্যায় করেছি এবং যা আপনি আমার চেয়ে বেশি জানেন। আপনিই অগ্রবর্তীকারী ও আপনিই বিলম্বকারী। আপনি ছাড়া কোন উপাস্য নেই।"
      }
    }
  },
  {
    "id": "ruku_sujood_14",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ",
    "transliteration": "Allāhumma Rabbanā wa lakal-ḥamdu ḥamdan kathīran ṭayyiban mubārakan fīh",
    "source": "Bukhari 799",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, our Lord, and to You be much good, blessed praise."
      },
      "ar": {
        "meaning": "اللهم ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه"
      },
      "id": {
        "meaning": "Ya Allah, Tuhan kami, bagi-Mu segala puji, pujian yang banyak, baik, lagi diberkahi di dalamnya."
      },
      "ur": {
        "meaning": "اے اللہ، ہمارے رب، اور تیرے ہی لیے حمد ہے، بہت زیادہ، پاکیزہ، بابرکت حمد۔"
      },
      "tr": {
        "meaning": "Allah'ım, Rabbimiz! Sana çok, tertemiz ve mübarek hamd olsun."
      },
      "fr": {
        "meaning": "Ô Allah, notre Seigneur, et à Toi la louange, une louange abondante, pure et bénie."
      },
      "ru": {
        "meaning": "О Аллах, наш Господь, и Тебе хвала, хвала обильная, благая, благословенная."
      },
      "fa": {
        "meaning": "ای الله، پروردگار ما، و ستایش فراوان، پاک و مبارک در آن برای توست."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, हमारे रब, और तेरे ही लिए हम्द है, बहुत ज़्यादा, पाकीज़ा, बाबरकत हम्द।"
      },
      "ms": {
        "meaning": "Ya Allah, Tuhan kami, dan bagi-Mu segala puji, pujian yang banyak, baik, lagi diberkati di dalamnya."
      },
      "sw": {
        "meaning": "Ewe Allah, Mola wetu, na Kwako sifa ni nyingi, nzuri, zenye baraka ndani yake."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমাদের প্রতিপালক, আপনার জন্যই সমস্ত প্রশংসা, অনেক, পবিত্র এবং বরকতময় প্রশংসা।"
      }
    }
  },
  {
    "id": "ruku_sujood_15",
    "category_id": "prayer_connected",
    "subcategory_id": "sujood_rukoo",
    "tag": "bowing_prostration",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَمِنْ عَذَابِ جَهَنَّمَ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
    "transliteration": "Allāhumma innī aʿūdhu bika min ʿadhābil-qabri wa min ʿadhābi Jahannam wa min fitnatil-maḥyā wal-mamāt wa min sharri fitnatil-masīḥid-dajjāl",
    "source": "Muslim 588",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in You from the punishment of the grave, and from the punishment of Hell, and from the trials of life and death, and from the evil of the trial of the False Messiah (Dajjal)."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ بك من عذاب القبر ومن عذاب جهنم ومن فتنة المحيا والممات ومن شر فتنة المسيح الدجال"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari azab kubur, dan dari azab Jahannam, dan dari fitnah kehidupan dan kematian, serta dari kejahatan fitnah Al-Masih Ad-Dajjal."
      },
      "ur": {
        "meaning": "اے اللہ! میں تیری پناہ چاہتا ہوں قبر کے عذاب سے، اور جہنم کے عذاب سے، اور زندگی و موت کے فتنے سے، اور مسیح الدجال کے فتنے کے شر سے۔"
      },
      "tr": {
        "meaning": "Allah'ım, kabir azabından, Cehennem azabından, hayatın ve ölümün fitnesinden ve Mesih Deccal'in fitnesinin şerrinden Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Toi contre le châtiment de la tombe, et contre le châtiment de l'Enfer, et contre l'épreuve de la vie et de la mort, et contre le mal de l'épreuve du Faux Messie (Dajjal)."
      },
      "ru": {
        "meaning": "О Аллах, я прибегаю к Тебе от наказания могилы, и от наказания Ада, и от искушений жизни и смерти, и от зла искушения Антихриста (Даджаля)."
      },
      "fa": {
        "meaning": "ای الله، من به تو پناه می‌برم از عذاب قبر و از عذاب جهنم و از فتنه زندگی و مرگ و از شر فتنه مسیح دجال."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तेरी पनाह चाहता हूँ क़ब्र के अज़ाब से, और जहन्नम के अज़ाब से, और ज़िंदगी और मौत के फ़ित्नों से, और मसीह दज्जाल के फ़ित्ने के शर से।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari azab kubur, dan dari azab Jahannam, dan dari fitnah kehidupan dan kematian, serta dari kejahatan fitnah Al-Masih Ad-Dajjal."
      },
      "sw": {
        "meaning": "Ewe Allah, hakika mimi najikinga Kwako kutokana na adhabu ya kaburi, na kutokana na adhabu ya Jahannam, na kutokana na fitina ya uhai na mauti, na kutokana na shari ya fitina ya Masihi Dajjal."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে কবরের আযাব থেকে, জাহান্নামের আযাব থেকে, জীবন ও মৃত্যুর ফেতনা থেকে এবং দাজ্জালের ফেতনার অনিষ্ট থেকে আশ্রয় চাই।"
      }
    }
  }
]