[
  {
    "id": "twilight_1",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
    "transliteration": "Allāhumma bika aṣbaḥnā wa bika amsaynā wa bika naḥyā wa bika namūtu wa ilaykan-nushūr",
    "source": "Tirmidhi 3391",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, by You we enter the morning and by You we enter the evening, by You we live and by You we die, and to You is the resurrection."
      },
      "ar": {
        "meaning": "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور"
      },
      "id": {
        "meaning": "Ya Allah, dengan (kekuasaan)-Mu kami memasuki waktu pagi dan dengan-Mu kami memasuki waktu petang. Dengan-Mu kami hidup dan dengan-Mu kami mati, dan kepada-Mu (kami) kembali (dibangkitkan)."
      },
      "ur": {
        "meaning": "اے اللہ! تیرے ہی نام سے ہم نے صبح کی اور تیرے ہی نام سے شام کی، تیرے ہی نام سے ہم جیتے ہیں اور تیرے ہی نام سے مرتے ہیں، اور تیری ہی طرف اٹھنا ہے۔"
      },
      "tr": {
        "meaning": "Allah'ım, Seninle sabahladık, Seninle akşamladık, Seninle yaşar, Seninle ölürüz ve dönüş Sanadır."
      },
      "fr": {
        "meaning": "Ô Allah, par Toi nous entrons dans le matin et par Toi nous entrons dans le soir, par Toi nous vivons et par Toi nous mourons, et c'est vers Toi le rassemblement."
      },
      "ru": {
        "meaning": "О Аллах, благодаря Тебе мы достигаем утра и благодаря Тебе достигаем вечера, благодаря Тебе мы живем и благодаря Тебе умираем, и к Тебе воскрешение."
      },
      "fa": {
        "meaning": "ای الله، به وسیله تو صبح کردیم و به وسیله تو شام کردیم و به وسیله تو زندگی می‌کنیم و به وسیله تو می‌میریم و به سوی توست بازگشت."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! तेरे ही नाम से हमने सुबह की और तेरे ही नाम से शाम की, तेरे ही नाम से हम जीते हैं और तेरे ही नाम से मरते हैं, और तेरी ही तरफ उठना है।"
      },
      "ms": {
        "meaning": "Ya Allah, dengan (kekuasaan)-Mu kami memasuki waktu pagi dan dengan-Mu kami memasuki waktu petang. Dengan-Mu kami hidup dan dengan-Mu kami mati, dan kepada-Mu (kami) kembali (dibangkitkan)."
      },
      "sw": {
        "meaning": "Ewe Allah, kwa ajili Yako tumefikia asubuhi, na kwa ajili Yako tumefikia jioni, na kwa ajili Yako tunaishi, na kwa ajili Yako tunakufa, na Kwako ni kufufuliwa."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আপনার দ্বারাই আমরা সকালে প্রবেশ করি এবং আপনার দ্বারাই সন্ধ্যায় প্রবেশ করি, আপনার দ্বারাই আমরা জীবন ধারণ করি এবং আপনার দ্বারাই আমরা মৃত্যুবরণ করি, আর আপনার দিকেই পুনরুত্থান।"
      }
    }
  },
  {
    "id": "twilight_2",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلا أَنْتَ",
    "transliteration": "Allāhumma Anta Rabbī Lā ilāha illā Anta, khalaqtanī wa anā ʿabduka, wa anā ʿalā ʿahdika wa waʿdika mastataʿtu, aʿūdhu bika min sharri mā ṣanaʿtu, abūʾu laka bi niʿmatika ʿalayya, wa abūʾu bi dhanbī faghfir lī faʾinnahu lā yaghfirudh-dhunūba illā Anta",
    "source": "Bukhari 6306",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, You are my Lord, there is none worthy of worship except You. You created me and I am Your slave, and I am abiding by Your covenant and promise as much as I can. I seek refuge in You from the evil of what I have committed. I acknowledge Your favors upon me and I acknowledge my sins, so forgive me, for none forgives sins except You."
      },
      "ar": {
        "meaning": "اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت"
      },
      "id": {
        "meaning": "Ya Allah, Engkau adalah Tuhanku, tiada ilah yang berhak disembah kecuali Engkau. Engkau telah menciptakan aku dan aku adalah hamba-Mu, dan aku berada di atas perjanjian dan janji-Mu semampuku. Aku berlindung kepada-Mu dari keburukan apa yang telah aku lakukan. Aku mengakui nikmat-Mu atasku, dan aku mengakui dosa-dosaku, maka ampunilah aku, karena sesungguhnya tidak ada yang mengampuni dosa-dosa kecuali Engkau."
      },
      "ur": {
        "meaning": "اے اللہ! تو میرا رب ہے، تیرے سوا کوئی معبود نہیں، تو نے مجھے پیدا کیا اور میں تیرا بندہ ہوں، اور میں تیرے عہد اور وعدے پر ہوں جب تک میری طاقت ہے۔ میں پناہ چاہتا ہوں تجھ سے اس شر سے جو میں نے کیا، میں اقرار کرتا ہوں تیری نعمت کا جو مجھ پر ہے، اور میں اپنے گناہوں کا اقرار کرتا ہوں، پس مجھے بخش دے، کیونکہ تیرے سوا کوئی گناہوں کو نہیں بخشتا۔"
      },
      "tr": {
        "meaning": "Allah'ım! Sen benim Rabbimsin, Senden başka ilah yoktur. Beni Sen yarattın ve ben Senin kulunum. Gücüm yettiğince Senin ahdine ve vaadine bağlıyım. Yaptıklarımın şerrinden Sana sığınırım. Bana verdiğin nimetlerini ve günahlarımı itiraf ederim. Beni bağışla, çünkü günahları Senden başka bağışlayacak yoktur."
      },
      "fr": {
        "meaning": "Ô Allah, Tu es mon Seigneur, il n'y a de divinité digne d'adoration que Toi. Tu m'as créé et je suis Ton serviteur, et je suis fidèle à Ton alliance et à Ta promesse autant que je peux. Je cherche refuge auprès de Toi contre le mal de ce que j'ai commis. Je reconnais Tes bienfaits sur moi, et je reconnais mes péchés, alors pardonne-moi, car nul ne pardonne les péchés sauf Toi."
      },
      "ru": {
        "meaning": "О Аллах, Ты мой Господь, нет божества, кроме Тебя. Ты создал меня, и я Твой раб, и я на Твоем завете и обещании по мере своих сил. Я прибегаю к Тебе от зла того, что я совершил. Я признаю Твои милости ко мне и признаю свои грехи, так прости же меня, ибо никто не прощает грехов, кроме Тебя."
      },
      "fa": {
        "meaning": "ای الله، تو پروردگار منی، هیچ معبودی جز تو نیست. مرا آفریدی و من بنده تو هستم، و تا جایی که توان دارم بر عهد و پیمان تو هستم. از شر آنچه انجام داده‌ام به تو پناه می‌برم. به نعمتت بر من اقرار می‌کنم و به گناهانم اقرار می‌کنم، پس مرا ببخش، زیرا هیچ‌کس گناهان را جز تو نمی‌بخشد."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! तू मेरा रब है, तेरे सिवा कोई माबूद नहीं, तूने मुझे पैदा किया और मैं तेरा बंदा हूँ, और मैं तेरे अहद और वादे पर हूँ जब तक मेरी ताक़त है। मैं पनाह चाहता हूँ तुझसे उस शर से जो मैंने किया, मैं इक़रार करता हूँ तेरी नेमत का जो मुझ पर है, और मैं अपने गुनाहों का इक़रार करता हूँ, पस मुझे बख़्श दे, क्योंकि तेरे सिवा कोई गुनाहों को नहीं बख़्शता।"
      },
      "ms": {
        "meaning": "Ya Allah, Engkau adalah Tuhanku, tiada Tuhan yang berhak disembah melainkan Engkau. Engkau telah menciptakan aku dan aku adalah hamba-Mu, dan aku berada di atas perjanjian dan janji-Mu sedaya upayaku. Aku berlindung kepada-Mu dari keburukan apa yang telah aku lakukan. Aku mengakui nikmat-Mu ke atasku, dan aku mengakui dosa-dosaku, maka ampunilah aku, kerana sesungguhnya tidak ada yang mengampuni dosa-dosa melainkan Engkau."
      },
      "sw": {
        "meaning": "Ewe Allah, Wewe ndiye Mola wangu, hapana mola isipokuwa Wewe. Umeniumba na mimi ni mja Wako, na mimi niko juu ya ahadi Yako na agano Lako kwa kadiri ya uwezo wangu. Najikinga Kwako kutokana na shari ya yale niliyoyafanya. Nakiri neema zako juu yangu, na nakiri dhambi zangu, basi nisamehe, kwani hakuna anayesamehe dhambi isipokuwa Wewe."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আপনি আমার প্রতিপালক, আপনি ছাড়া কোন উপাস্য নেই। আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার বান্দা, আর আমি আপনার অঙ্গীকার ও প্রতিশ্রুতির উপর আছি যতক্ষণ আমার সাধ্য আছে। আমি আপনার কাছে আশ্রয় চাই আমার কৃতকর্মের অনিষ্ট থেকে। আমি আপনার প্রতি আমার নেয়ামত স্বীকার করি এবং আমার গুনাহ স্বীকার করি, অতএব আমাকে ক্ষমা করুন, কেননা আপনি ছাড়া কেউ গুনাহ ক্ষমা করতে পারে না।"
      }
    }
  },
  {
    "id": "twilight_3",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "transliteration": "Bismillāhilla dhī lā yaḍurru maʿa ismihi shayʾun fil-arḍi wa lā fis-samāʾi wa Huwas-Samīʿul-ʿAlīm",
    "source": "Abu Dawud 5088",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "In the Name of Allah, with Whose Name nothing on earth or in the heavens can cause harm, and He is the All-Hearing, the All-Knowing."
      },
      "ar": {
        "meaning": "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم"
      },
      "id": {
        "meaning": "Dengan nama Allah, yang dengan nama-Nya tidak ada sesuatu pun di bumi maupun di langit yang dapat membahayakan, dan Dia Maha Mendengar lagi Maha Mengetahui."
      },
      "ur": {
        "meaning": "اللہ کے نام کے ساتھ جس کے نام کے ساتھ زمین و آسمان میں کوئی چیز نقصان نہیں دیتی اور وہ سننے والا، جاننے والا ہے۔"
      },
      "tr": {
        "meaning": "Adıyla yerde ve gökte hiçbir şeyin zarar veremeyeceği Allah'ın adıyla. O, Semi'dir (her şeyi işiten), Alîm'dir (her şeyi bilendir)."
      },
      "fr": {
        "meaning": "Au Nom d'Allah, par le Nom duquel rien sur terre ou dans les cieux ne peut nuire, et Il est l'Audient, l'Omniscient."
      },
      "ru": {
        "meaning": "Во имя Аллаха, с именем Которого ничто на земле и на небесах не причинит вреда, и Он — Всеслышащий, Всезнающий."
      },
      "fa": {
        "meaning": "به نام الله که با نام او هیچ چیز در زمین و آسمان ضرر نمی‌رساند و او شنوای داناست."
      },
      "hi": {
        "meaning": "अल्लाह के नाम के साथ जिसके नाम के साथ ज़मीन व आसमान में कोई चीज़ नुक़सान नहीं देती और वह सुनने वाला, जानने वाला है।"
      },
      "ms": {
        "meaning": "Dengan nama Allah, yang dengan nama-Nya tidak ada sesuatu pun di bumi mahupun di langit yang dapat membahayakan, dan Dia Maha Mendengar lagi Maha Mengetahui."
      },
      "sw": {
        "meaning": "Kwa Jina la Allah, ambaye kwa jina Lake hakuna kitu kinachoweza kudhuru duniani wala mbinguni, na Yeye Ndiye Mwenye Kusikia, Mwenye Kujua."
      },
      "bn": {
        "meaning": "আল্লাহর নামে, যার নামের সাথে আকাশ ও পৃথিবীর কোন কিছুই ক্ষতি করতে পারে না, এবং তিনিই সর্বশ্রোতা, সর্বজ্ঞ।"
      }
    }
  },
  {
    "id": "twilight_4",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا",
    "transliteration": "Raḍītu billāhi Rabban wa bil-Islāmi dīnan wa bi-Muḥammadin Nabiyyan",
    "source": "Abu Dawud 5072",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "I am pleased with Allah as my Lord, and with Islam as my religion, and with Muhammad as my Prophet."
      },
      "ar": {
        "meaning": "رضيت بالله ربا وبالإسلام دينا وبمحمد نبيا"
      },
      "id": {
        "meaning": "Aku rela Allah sebagai Tuhanku, dan Islam sebagai agamaku, dan Muhammad sebagai Nabiku."
      },
      "ur": {
        "meaning": "میں اللہ کے رب ہونے پر، اسلام کے دین ہونے پر اور محمد کے نبی ہونے پر راضی ہوا۔"
      },
      "tr": {
        "meaning": "Allah'ı Rabb olarak, İslam'ı din olarak, Muhammed'i de Peygamber olarak kabul ettim ve razı oldum."
      },
      "fr": {
        "meaning": "Je suis satisfait d'Allah comme Seigneur, et de l'Islam comme religion, et de Muhammad comme Prophète."
      },
      "ru": {
        "meaning": "Я доволен Аллахом как Господом, Исламом как религией и Мухаммадом как Пророком."
      },
      "fa": {
        "meaning": "به این راضی شدم که الله پروردگارم باشد، و اسلام دینم، و محمد پیامبرم."
      },
      "hi": {
        "meaning": "मैं अल्लाह के रब होने पर, इस्लाम के दीन होने पर और मुहम्मद के नबी होने पर राज़ी हुआ।"
      },
      "ms": {
        "meaning": "Aku rela Allah sebagai Tuhanku, dan Islam sebagai agamaku, dan Muhammad sebagai Nabiku."
      },
      "sw": {
        "meaning": "Nimeridhika na Allah kama Mola wangu, na Uislamu kama dini yangu, na Muhammad kama Mtume wangu."
      },
      "bn": {
        "meaning": "আমি আল্লাহকে রব হিসেবে, ইসলামকে দ্বীন হিসেবে এবং মুহাম্মদকে নবী হিসেবে গ্রহণ করে সন্তুষ্ট।"
      }
    }
  },
  {
    "id": "twilight_5",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
    "transliteration": "Yā Ḥayyu yā Qayyūmu bi-raḥmatika astaghīthu aṣliḥ lī shaʾnī kullahū wa lā takilnī ilā nafsī ṭarfata ʿayn",
    "source": "Hisnul Muslim #68",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Ever-Living, O Sustainer, by Your mercy I seek assistance; correct for me all my affairs and do not entrust me to my soul for the blink of an eye."
      },
      "ar": {
        "meaning": "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين"
      },
      "id": {
        "meaning": "Wahai Yang Maha Hidup, wahai Yang Maha Berdiri Sendiri (mengurus segala sesuatu), dengan rahmat-Mu aku memohon pertolongan; perbaikilah untukku segala urusanku dan janganlah Engkau serahkan diriku kepada diriku sendiri sekejap mata pun."
      },
      "ur": {
        "meaning": "اے زندہ، اے قائم رکھنے والے! تیری رحمت کے ذریعے میں مدد طلب کرتا ہوں، میرے تمام معاملات درست کر دے اور مجھے ایک لمحہ کے لیے بھی میرے نفس کے حوالے نہ کر۔"
      },
      "tr": {
        "meaning": "Ey Hayy (diri olan), Ey Kayyum (kâinatı ayakta tutan)! Rahmetinle yardım dilerim; bütün işlerimi benim için düzelt ve beni bir göz açıp kapayıncaya kadar bile nefsime bırakma."
      },
      "fr": {
        "meaning": "Ô le Vivant, ô Celui qui subsiste par Lui-même, par Ta miséricorde je demande Ton secours; arrange pour moi toutes mes affaires et ne me laisse pas à moi-même ne serait-ce qu'un clin d'œil."
      },
      "ru": {
        "meaning": "О Живой, о Поддерживающий (существование всего)! Твоей милостью я обращаюсь за помощью; исправь для меня все мои дела и не вверяй меня моей душе ни на мгновение ока."
      },
      "fa": {
        "meaning": "ای زنده، ای پاینده، با رحمت تو یاری می‌طلبم؛ تمام امورم را برایم اصلاح فرما و مرا حتی به اندازه یک چشم بر هم زدن به خودم وامگذار."
      },
      "hi": {
        "meaning": "ऐ ज़िंदा, ऐ क़ायम रखने वाले! तेरी रहमत के ज़रिए मैं मदद चाहता हूँ, मेरे सारे काम दुरुस्त कर दे और मुझे पलक झपकने की भी देर के लिए मेरे नफ़्स के हवाले न कर।"
      },
      "ms": {
        "meaning": "Wahai Yang Maha Hidup, wahai Yang Maha Berdiri Sendiri (mengurus segala sesuatu), dengan rahmat-Mu aku memohon pertolongan; perbaikilah untukku segala urusanku dan janganlah Engkau serahkan diriku kepada diriku sendiri walau sekelip mata pun."
      },
      "sw": {
        "meaning": "Ewe Mwenye Hai, Ewe Msimamizi wa viumbe! Kwa rehema zako ninaomba msaada; nirekebishie mambo yangu yote na usiniachie nafsi yangu hata kwa kufumba na kufumbua jicho."
      },
      "bn": {
        "meaning": "হে চিরঞ্জীব, হে সর্বসত্তার ধারক, আপনার রহমতের মাধ্যমে আমি সাহায্য প্রার্থনা করি; আমার সমস্ত কাজ আমার জন্য সংশোধন করে দিন এবং এক মুহূর্তের জন্যও আমাকে আমার নিজের উপর ছেড়ে দেবেন না।"
      }
    }
  },
  {
    "id": "twilight_6",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "transliteration": "Subḥānallāhi wa biḥamdihi",
    "source": "Bukhari 6405",
    "repeat": 100,
    "translations": {
      "en": {
        "meaning": "Glory be to Allah and with His praise."
      },
      "ar": {
        "meaning": "سبحان الله وبحمده"
      },
      "id": {
        "meaning": "Maha Suci Allah dan dengan segala puji bagi-Nya."
      },
      "ur": {
        "meaning": "اللہ پاک ہے اور اسی کی تعریف ہے۔"
      },
      "tr": {
        "meaning": "Allah'ı hamdiyle tesbih ederim."
      },
      "fr": {
        "meaning": "Gloire à Allah et louange à Lui."
      },
      "ru": {
        "meaning": "Пречист Аллах и хвала Ему."
      },
      "fa": {
        "meaning": "الله پاک است و ستایش از آن اوست."
      },
      "hi": {
        "meaning": "अल्लाह पाक है और उसी की तारीफ़ है।"
      },
      "ms": {
        "meaning": "Maha Suci Allah dan dengan segala puji bagi-Nya."
      },
      "sw": {
        "meaning": "Ametakasika Allah na sifa zote njema ni Zake."
      },
      "bn": {
        "meaning": "আল্লাহ পবিত্র এবং সমস্ত প্রশংসা তাঁরই জন্য।"
      }
    }
  },
  {
    "id": "twilight_7",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "transliteration": "Lā ilāha illallāhu waḥdahu lā sharīka lahu, lahul-mulku wa lahul-ḥamdu, wa Huwa ʿalā kulli shayʾin Qadīr",
    "source": "Bukhari 6479",
    "repeat": 100,
    "translations": {
      "en": {
        "meaning": "There is no deity worthy of worship except Allah, alone without any partner. To Him belongs the dominion, and to Him belongs all praise, and He is over all things competent."
      },
      "ar": {
        "meaning": "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير"
      },
      "id": {
        "meaning": "Tiada ilah yang berhak disembah kecuali Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kekuasaan dan bagi-Nya segala puji, dan Dia Mahakuasa atas segala sesuatu."
      },
      "ur": {
        "meaning": "اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے اور اسی کے لیے تمام تعریفیں ہیں، اور وہ ہر چیز پر قادر ہے۔"
      },
      "tr": {
        "meaning": "Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'nadır. Ve O, her şeye Kadirdir."
      },
      "fr": {
        "meaning": "Il n'y a de divinité digne d'adoration qu'Allah, seul sans associé. À Lui appartient la royauté et à Lui appartient la louange, et Il est Omnipotent sur toute chose."
      },
      "ru": {
        "meaning": "Нет божества, достойного поклонения, кроме Аллаха, Единственного, у Которого нет сотоварищей. Ему принадлежит власть, и Ему принадлежит вся хвала, и Он над всякой вещью Всемогущ."
      },
      "fa": {
        "meaning": "هیچ معبودی جز الله نیست، یکتاست و شریکی ندارد. پادشاهی و ستایش از آن اوست، و او بر هر چیزی تواناست."
      },
      "hi": {
        "meaning": "अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई शरीक नहीं, उसी के लिए बादशाहत है और उसी के लिए तमाम तारीफ़ें हैं, और वह हर चीज़ पर क़ादिर है।"
      },
      "ms": {
        "meaning": "Tiada Tuhan yang berhak disembah melainkan Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kekuasaan dan bagi-Nya segala puji, dan Dia Maha Berkuasa atas segala sesuatu."
      },
      "sw": {
        "meaning": "Hapana mola ila Allah, Peke Yake, Hana mshirika. Ufalme ni Wake, na sifa zote ni Zake, Naye juu ya kila kitu ni Muweza."
      },
      "bn": {
        "meaning": "আল্লাহ ছাড়া কোন উপাস্য নেই, তিনি এক, তাঁর কোন শরীক নেই। রাজত্ব তাঁরই এবং সমস্ত প্রশংসা তাঁরই জন্য, এবং তিনি সবকিছুর উপর ক্ষমতাবান।"
      }
    }
  },
  {
    "id": "twilight_8",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي",
    "transliteration": "Allāhumma innī asʾalukal-ʿāfiyata fid-dunyā wal-ākhirah, Allāhumma innī asʾalukal-ʿafwa wal-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī",
    "source": "Hisnul Muslim #98",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for well-being in this world and the Hereafter. O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family, and my wealth."
      },
      "ar": {
        "meaning": "اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu keselamatan di dunia dan di akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu ampunan dan keselamatan dalam agamaku, duniaku, keluargaku, dan hartaku."
      },
      "ur": {
        "meaning": "اے اللہ! میں تجھ سے دنیا اور آخرت میں عافیت کا سوال کرتا ہوں۔ اے اللہ! میں تجھ سے اپنے دین، دنیا، اہل و عیال اور مال میں معافی اور عافیت کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım, Senden dünya ve ahirette afiyet dilerim. Allah'ım, Senden dinimde, dünyamda, ailemde ve malımda af ve afiyet dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande le bien-être dans ce monde et dans l'au-delà. Ô Allah, je Te demande le pardon et le bien-être dans ma religion, ma vie d'ici-bas, ma famille et mes biens."
      },
      "ru": {
        "meaning": "О Аллах, я прошу Тебя о благополучии в этом мире и в мире вечном. О Аллах, я прошу Тебя о прощении и благополучии в моей религии, в моей мирской жизни, в моей семье и в моем имуществе."
      },
      "fa": {
        "meaning": "ای الله، من از تو عافیت در دنیا و آخرت را مسئلت می‌نمایم. ای الله، من از تو عفو و عافیت در دینم و دنیایم و خانواده‌ام و مالم را مسئلت می‌نمایم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तुझसे दुनिया और आख़िरत में आफ़ियत का सवाल करता हूँ। ऐ अल्लाह! मैं तुझसे अपने दीन, दुनिया, अहल-ओ-अय्याल और माल में माफ़ी और आफ़ियत का सवाल करता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu kesejahteraan di dunia dan di akhirat. Ya Allah, sesungguhnya aku memohon kepada-Mu keampunan dan kesejahteraan dalam agamaku, duniaku, keluargaku, dan hartaku."
      },
      "sw": {
        "meaning": "Ewe Allah, hakika mimi nakuomba afya njema duniani na Akhera. Ewe Allah, hakika mimi nakuomba msamaha na afya njema katika dini yangu, na dunia yangu, na familia yangu, na mali yangu."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে দুনিয়া ও আখিরাতে নিরাপত্তা চাই। হে আল্লাহ, আমি আপনার কাছে আমার দ্বীন, দুনিয়া, পরিবার ও সম্পদে ক্ষমা ও নিরাপত্তা চাই।"
      }
    }
  },
  {
    "id": "twilight_9",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ",
    "transliteration": "Allāhumma innī aʿūdhu bika minal-hammi wal-ḥazan, wa aʿūdhu bika minal-ʿajzi wal-kasal, wa aʿūdhu bika minal-jubni wal-bukhl, wa aʿūdhu bika min ghalabatid-dayni wa qahrir-rijāl",
    "source": "Bukhari 6369",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in You from anxiety and sorrow, and I seek refuge in You from inability and laziness, and I seek refuge in You from cowardice and stinginess, and I seek refuge in You from the burden of debt and from being overpowered by men."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين وقهر الرجال"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kegelisahan dan kesedihan, dan aku berlindung kepada-Mu dari kelemahan dan kemalasan, dan aku berlindung kepada-Mu dari sifat pengecut dan kikir, dan aku berlindung kepada-Mu dari beban hutang dan penindasan orang lain."
      },
      "ur": {
        "meaning": "اے اللہ! میں تیری پناہ چاہتا ہوں غم اور پریشانی سے، اور میں تیری پناہ چاہتا ہوں عاجزی اور سستی سے، اور میں تیری پناہ چاہتا ہوں بزدلی اور بخل سے، اور میں تیری پناہ چاہتا ہوں قرض کے غلبے سے اور لوگوں کے دباؤ سے۔"
      },
      "tr": {
        "meaning": "Allah'ım, kederden ve hüzünden Sana sığınırım. Acizlikten ve tembellikten Sana sığınırım. Korkaklıktan ve cimrilikten Sana sığınırım. Borcun ağırlığından ve insanların kahrından Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Toi contre l'anxiété et la tristesse, et je cherche refuge auprès de Toi contre l'incapacité et la paresse, et je cherche refuge auprès de Toi contre la lâcheté et l'avarice, et je cherche refuge auprès de Toi contre le poids de la dette et l'oppression des hommes."
      },
      "ru": {
        "meaning": "О Аллах, я прибегаю к Тебе от беспокойства и печали, и я прибегаю к Тебе от бессилия и лени, и я прибегаю к Тебе от трусости и скупости, и я прибегаю к Тебе от бремени долга и от притеснения людей."
      },
      "fa": {
        "meaning": "ای الله، من به تو پناه می‌برم از غم و اندوه، و به تو پناه می‌برم از ناتوانی و کسالت، و به تو پناه می‌برم از بزدلی و بخل، و به تو پناه می‌برم از غلبه بدهی و ستم مردان."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तेरी पनाह चाहता हूँ चिंता और दुःख से, और मैं तेरी पनाह चाहता हूँ अक्षमता और आलस्य से, और मैं तेरी पनाह चाहता हूँ कायरता और कंजूसी से, और मैं तेरी पनाह चाहता हूँ क़र्ज़ के बोझ से और लोगों के अत्याचार से।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kegelisahan dan kesedihan, dan aku berlindung kepada-Mu dari kelemahan dan kemalasan, dan aku berlindung kepada-Mu dari sifat penakut dan kedekut, dan aku berlindung kepada-Mu dari beban hutang dan penindasan orang lain."
      },
      "sw": {
        "meaning": "Ewe Allah, hakika mimi najikinga Kwako kutokana na wasiwasi na huzuni, na najikinga Kwako kutokana na udhaifu na uvivu, na najikinga Kwako kutokana na woga na ubakhili, na najikinga Kwako kutokana na kuzidiwa na deni na dhulma ya watu."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই দুশ্চিন্তা ও মন খারাপ থেকে, এবং আপনার কাছে আশ্রয় চাই অক্ষমতা ও অলসতা থেকে, এবং আপনার কাছে আশ্রয় চাই ভীরুতা ও কৃপণতা থেকে, এবং আপনার কাছে আশ্রয় চাই ঋণের বোঝা এবং মানুষের জুলুম থেকে।"
      }
    }
  },
  {
    "id": "twilight_10",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
    "transliteration": "Allāhumma ʿĀlimal-Ghaybi wash-shahādati Fāṭiras-samāwāti wal-arḍi Rabba kulli shayʾin wa Malīkahu ashhadu an lā ilāha illā Anta aʿūdhu bika min sharri nafsī wa min sharrish-shayṭāni wa shirkihi wa an aqtarifa ʿalā nafsī sūʾan aw ajurrahū ilā muslim",
    "source": "Tirmidhi 3529",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of everything, I bear witness that there is none worthy of worship except You. I seek refuge in You from the evil of my soul and from the evil of Satan and his polytheism, and from committing evil against myself or bringing it upon a Muslim."
      },
      "ar": {
        "meaning": "اللهم عالم الغيب والشهادة فاطر السماوات والأرض رب كل شيء ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن أقترف على نفسي سوءا أو أجره إلى مسلم"
      },
      "id": {
        "meaning": "Ya Allah, Yang Maha Mengetahui yang gaib dan yang tampak, Pencipta langit dan bumi, Tuhan dan Penguasa segala sesuatu, aku bersaksi bahwa tiada ilah yang berhak disembah kecuali Engkau. Aku berlindung kepada-Mu dari kejahatan diriku, dan dari kejahatan setan dan syiriknya, dan dari melakukan keburukan terhadap diriku atau menyeretnya kepada seorang Muslim."
      },
      "ur": {
        "meaning": "اے اللہ، غیب و شہادت کے جاننے والے، آسمانوں اور زمین کے پیدا کرنے والے، ہر چیز کے رب اور بادشاہ، میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں۔ میں تیری پناہ چاہتا ہوں اپنے نفس کے شر سے اور شیطان کے شر اور اس کے شرک سے، اور اس سے کہ میں اپنے اوپر کوئی برائی کروں یا اسے کسی مسلمان تک پہنچاؤں۔"
      },
      "tr": {
        "meaning": "Allah'ım, gaybı ve görüneni bilen, gökleri ve yeri yaratan, her şeyin Rabbi ve Sahibi! Şehadet ederim ki Senden başka ilah yoktur. Nefsimin şerrinden, şeytanın şerrinden ve şirkinden, kendi nefsime kötülük etmekten veya onu bir Müslümana ulaştırmaktan Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, Connaisseur de l'invisible et du visible, Créateur des cieux et de la terre, Seigneur et Souverain de toute chose, j'atteste qu'il n'y a de divinité digne d'adoration que Toi. Je cherche refuge auprès de Toi contre le mal de mon âme et contre le mal de Satan et de son polythéisme, et contre le fait de commettre le mal contre moi-même ou de le causer à un musulman."
      },
      "ru": {
        "meaning": "О Аллах, Знающий сокровенное и явное, Создатель небес и земли, Господь и Властелин всего, я свидетельствую, что нет божества, кроме Тебя. Я прибегаю к Тебе от зла своей души и от зла сатаны и его многобожия, и от того, чтобы совершить зло против себя или причинить его мусульманину."
      },
      "fa": {
        "meaning": "ای الله، دانای غیب و آشکار، آفریننده آسمان‌ها و زمین، پروردگار و پادشاه هر چیز، شهادت می‌دهم که هیچ معبودی جز تو نیست. از شر نفس خود و از شر شیطان و شرکش و از اینکه به خود بدی کنم یا آن را به مسلمانی برسانم به تو پناه می‌برم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, ग़ैब और हाज़िर को जानने वाले, आसमानों और ज़मीन के पैदा करने वाले, हर चीज़ के रब और मालिक, मैं गवाही देता हूँ कि तेरे सिवा कोई माबूद नहीं। मैं तेरी पनाह चाहता हूँ अपने नफ़्स के शर से और शैतान के शर और उसके शिर्क से, और इस से कि मैं अपने ऊपर कोई बुराई करूँ या उसे किसी मुसलमान तक पहुँचाऊँ।"
      },
      "ms": {
        "meaning": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata, Pencipta langit dan bumi, Tuhan dan Raja segala sesuatu, aku bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Engkau. Aku berlindung kepada-Mu dari kejahatan diriku, dan dari kejahatan syaitan dan syiriknya, dan dari melakukan keburukan terhadap diriku atau menyeretnya kepada seorang Muslim."
      },
      "sw": {
        "meaning": "Ewe Allah, Mjuzi wa yaliyofichwa na yaliyo wazi, Muumba wa mbingu na ardhi, Mola na Mfalme wa kila kitu, ninashuhudia kwamba hapana mola ila Wewe. Najikinga Kwako kutokana na shari ya nafsi yangu na kutokana na shari ya shetani na shirki yake, na kutokana na kujidhulumu nafsi yangu au kumdhuru Muislamu."
      },
      "bn": {
        "meaning": "হে আল্লাহ, হে অদৃশ্য ও দৃশ্যমান জগতের পরিজ্ঞাতা, আকাশমন্ডলী ও পৃথিবীর সৃষ্টিকর্তা, প্রতিটি বস্তুর প্রতিপালক ও অধিপতি, আমি সাক্ষ্য দিচ্ছি যে আপনি ব্যতীত কোন উপাস্য নেই। আমি আপনার কাছে আশ্রয় চাই আমার আত্মার অনিষ্ট থেকে এবং শয়তানের অনিষ্ট ও তার শিরক থেকে, আর আমার নিজের উপর কোন মন্দ কাজ করা থেকে অথবা কোন মুসলিমের উপর তা চাপিয়ে দেওয়া থেকে।"
      }
    }
  },
  {
    "id": "twilight_11",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا. رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
    "transliteration": "Amsaynā wa amsal-mulku lillāhi wal-ḥamdu lillāh, lā ilāha illallāhu waḥdahu lā sharīka lahu, lahul-mulku wa lahul-ḥamdu wa huwa ʿalā kulli shayʾin qadīr. Rabbi asʾaluka khayra mā fī hādhihil-laylati wa khayra mā baʿdahā, wa aʿūdhu bika min sharri mā fī hādhihil-laylati wa sharri mā baʿdahā. Rabbi aʿūdhu bika minal-kasali wa sūʾil-kibar, Rabbi aʿūdhu bika min ʿadhābin fin-nāri wa ʿadhābin fil-qabr",
    "source": "Muslim 2723",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "We have entered the evening, and the dominion belongs to Allah, and all praise is due to Allah. There is no deity worthy of worship except Allah, alone without any partner. To Him belongs the dominion, and to Him belongs all praise, and He is over all things competent. My Lord, I ask You for the good of this night and the good that comes after it, and I seek refuge in You from the evil of this night and the evil that comes after it. My Lord, I seek refuge in You from laziness and the evils of old age. My Lord, I seek refuge in You from punishment in the Fire and punishment in the grave."
      },
      "ar": {
        "meaning": "أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. رب أسألك خير ما في هذه الليلة وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها. رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر"
      },
      "id": {
        "meaning": "Kami telah memasuki waktu petang, dan kekuasaan adalah milik Allah, dan segala puji bagi Allah. Tiada ilah yang berhak disembah kecuali Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kekuasaan dan bagi-Nya segala puji, dan Dia Mahakuasa atas segala sesuatu. Ya Tuhanku, aku memohon kepada-Mu kebaikan malam ini dan kebaikan setelahnya, dan aku berlindung kepada-Mu dari keburukan malam ini dan keburukan setelahnya. Ya Tuhanku, aku berlindung kepada-Mu dari kemalasan dan keburukan masa tua. Ya Tuhanku, aku berlindung kepada-Mu dari azab neraka dan azab kubur."
      },
      "ur": {
        "meaning": "ہم نے شام کی اور اللہ ہی کے لیے بادشاہی ہے اور تمام تعریفیں اللہ ہی کے لیے ہیں۔ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اسی کے لیے بادشاہت ہے اور اسی کے لیے تمام تعریفیں ہیں اور وہ ہر چیز پر قادر ہے۔ اے میرے رب! میں تجھ سے اس رات کی بھلائی اور اس کے بعد کی بھلائی کا سوال کرتا ہوں، اور میں تیری پناہ چاہتا ہوں اس رات کی برائی اور اس کے بعد کی برائی سے۔ اے میرے رب! میں تیری پناہ چاہتا ہوں سستی اور بڑھاپے کی برائی سے۔ اے میرے رب! میں تیری پناہ چاہتا ہوں آگ کے عذاب سے اور قبر کے عذاب سے۔"
      },
      "tr": {
        "meaning": "Akşama ulaştık, mülk Allah'ındır, hamd Allah'adır. Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'nadır ve O, her şeye Kadirdir. Rabbim, bu gecenin hayrını ve ondan sonrasının hayrını Senden dilerim. Bu gecenin şerrinden ve ondan sonrasının şerrinden Sana sığınırım. Rabbim, tembellikten ve yaşlılığın kötü hallerinden Sana sığınırım. Rabbim, cehennem azabından ve kabir azabından Sana sığınırım."
      },
      "fr": {
        "meaning": "Nous sommes entrés dans le soir, et la royauté appartient à Allah, et toute louange est à Allah. Il n'y a de divinité digne d'adoration qu'Allah, seul sans associé. À Lui appartient la royauté et à Lui appartient la louange, et Il est Omnipotent sur toute chose. Ô mon Seigneur, je Te demande le bien de cette nuit et le bien qui vient après elle, et je cherche refuge auprès de Toi contre le mal de cette nuit et le mal qui vient après elle. Ô mon Seigneur, je cherche refuge auprès de Toi contre la paresse et les maux de la vieillesse. Ô mon Seigneur, je cherche refuge auprès de Toi contre le châtiment dans le Feu et le châtiment dans la tombe."
      },
      "ru": {
        "meaning": "Мы достигли вечера, и царство принадлежит Аллаху, и вся хвала Аллаху. Нет божества, кроме Аллаха, Одного, у Которого нет сотоварищей. Ему принадлежит власть, и Ему принадлежит вся хвала, и Он над всякой вещью Всемогущ. Господи, я прошу Тебя о добре этой ночи и о добре того, что последует за ней, и прибегаю к Тебе от зла этой ночи и от зла того, что последует за ней. Господи, я прибегаю к Тебе от лени и от скверной старости. Господи, я прибегаю к Тебе от наказания в Огне и от наказания в могиле."
      },
      "fa": {
        "meaning": "شامگاهان شدیم و پادشاهی از آن الله است و ستایش از آن الله است. هیچ معبودی جز الله نیست، یکتاست و شریکی ندارد. پادشاهی از آن اوست و ستایش از آن اوست و او بر هر چیزی تواناست. پروردگارا، از تو خیر این شب و خیر آنچه پس از آن است را می‌خواهم، و به تو پناه می‌برم از شر این شب و شر آنچه پس از آن است. پروردگارا، از سستی و بدی پیری به تو پناه می‌برم. پروردگارا، از عذاب در آتش و عذاب در قبر به تو پناه می‌برم."
      },
      "hi": {
        "meaning": "हमने शाम की और अल्लाह ही के लिए बादशाहत है और तमाम तारीफ़ें अल्लाह ही के लिए हैं। अल्लाह के सिवा कोई माबूद नहीं, वह अकेला है, उसका कोई शरीक नहीं। उसी के लिए बादशाहत है और उसी के लिए तमाम तारीफ़ें हैं और वह हर चीज़ पर क़ादिर है। ऐ मेरे रब! मैं तुझसे इस रात की भलाई और इस के बाद की भलाई का सवाल करता हूँ, और मैं तेरी पनाह चाहता हूँ इस रात की बुराई और इस के बाद की बुराई से। ऐ मेरे रब! मैं तेरी पनाह चाहता हूँ सुस्ती और बुढ़ापे की बुराई से। ऐ मेरे रब! मैं तेरी पनाह चाहता हूँ आग के अज़ाब से और क़ब्र के अज़ाब से।"
      },
      "ms": {
        "meaning": "Kami telah memasuki waktu petang, dan kekuasaan adalah milik Allah, dan segala puji bagi Allah. Tiada Tuhan yang berhak disembah melainkan Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kekuasaan dan bagi-Nya segala puji, dan Dia Maha Berkuasa atas segala sesuatu. Ya Tuhanku, aku memohon kepada-Mu kebaikan malam ini dan kebaikan selepasnya, dan aku berlindung kepada-Mu dari keburukan malam ini dan keburukan selepasnya. Ya Tuhanku, aku berlindung kepada-Mu dari kemalasan dan keburukan usia tua. Ya Tuhanku, aku berlindung kepada-Mu dari azab neraka dan azab kubur."
      },
      "sw": {
        "meaning": "Tumefikia jioni, na ufalme ni wa Allah, na sifa zote njema ni za Allah. Hapana mola ila Allah, Peke Yake, Hana mshirika. Ufalme ni Wake, na sifa zote ni Zake, Naye juu ya kila kitu ni Muweza. Mola wangu, nakuomba kheri ya usiku huu na kheri iliyo baada yake, na najikinga Kwako kutokana na shari ya usiku huu na shari iliyo baada yake. Mola wangu, najikinga Kwako kutokana na uvivu na ubaya wa uzee, Mola wangu, najikinga Kwako kutokana na adhabu ya Moto na adhabu ya kaburini."
      },
      "bn": {
        "meaning": "আমরা সন্ধ্যায় প্রবেশ করেছি, এবং রাজত্ব আল্লাহরই, আর সমস্ত প্রশংসা আল্লাহরই জন্য। আল্লাহ ছাড়া কোন উপাস্য নেই, তিনি এক, তাঁর কোন শরীক নেই। রাজত্ব তাঁরই এবং সমস্ত প্রশংসা তাঁরই জন্য, এবং তিনি সবকিছুর উপর ক্ষমতাবান। হে আমার প্রতিপালক, আমি আপনার কাছে এই রাতের কল্যাণ এবং এর পরের কল্যাণ চাই, এবং আপনার কাছে আশ্রয় চাই এই রাতের অনিষ্ট থেকে এবং এর পরের অনিষ্ট থেকে। হে আমার প্রতিপালক, আমি আপনার কাছে আশ্রয় চাই অলসতা ও বার্ধক্যের খারাপ অবস্থা থেকে। হে আমার প্রতিপালক, আমি আপনার কাছে আশ্রয় চাই জাহান্নামের শাস্তি থেকে এবং কবরের শাস্তি থেকে।"
      }
    }
  },
  {
    "id": "twilight_12",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
    "transliteration": "Allāhumma innī asʾalukal-jannata wa aʿūdhu bika minan-nār",
    "source": "Abu Dawud 793",
    "repeat": 3,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for Paradise and I seek refuge in You from the Fire."
      },
      "ar": {
        "meaning": "اللهم إني أسألك الجنة وأعوذ بك من النار"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu surga dan aku berlindung kepada-Mu dari neraka."
      },
      "ur": {
        "meaning": "اے اللہ! میں تجھ سے جنت کا سوال کرتا ہوں اور جہنم سے تیری پناہ چاہتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım, Senden Cenneti isterim ve Cehennemden Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande le Paradis et je cherche refuge auprès de Toi contre l'Enfer."
      },
      "ru": {
        "meaning": "О Аллах, я прошу Тебя о Рае и прибегаю к Тебе от Ада."
      },
      "fa": {
        "meaning": "ای الله، من از تو بهشت را می‌خواهم و از آتش به تو پناه می‌برم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तुझसे जन्नत का सवाल करता हूँ और जहन्नम से तेरी पनाह चाहता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu syurga dan aku berlindung kepada-Mu dari neraka."
      },
      "sw": {
        "meaning": "Ewe Allah, hakika mimi nakuomba Pepo na najikinga Kwako kutokana na Moto."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে জান্নাত চাই এবং জাহান্নাম থেকে আপনার কাছে আশ্রয় চাই।"
      }
    }
  },
  {
    "id": "twilight_13",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
    "transliteration": "Subḥānallāhi wal-ḥamdulillāhi wa lā ilāha illallāhu wallāhu Akbar",
    "source": "Muslim 2695",
    "repeat": 100,
    "translations": {
      "en": {
        "meaning": "Glory be to Allah, and all praise is for Allah, and there is no deity worthy of worship except Allah, and Allah is the Greatest."
      },
      "ar": {
        "meaning": "سبحان الله والحمد لله ولا إله إلا الله والله أكبر"
      },
      "id": {
        "meaning": "Maha Suci Allah, dan segala puji bagi Allah, dan tiada ilah yang berhak disembah kecuali Allah, dan Allah Maha Besar."
      },
      "ur": {
        "meaning": "اللہ پاک ہے، اور تمام تعریفیں اللہ کے لیے ہیں، اور اللہ کے سوا کوئی معبود نہیں، اور اللہ سب سے بڑا ہے۔"
      },
      "tr": {
        "meaning": "Allah'ı tesbih ederim, hamd Allah'adır, Allah'tan başka ilah yoktur ve Allah en büyüktür."
      },
      "fr": {
        "meaning": "Gloire à Allah, et louange à Allah, et il n'y a de divinité digne d'adoration qu'Allah, et Allah est le Plus Grand."
      },
      "ru": {
        "meaning": "Пречист Аллах, и хвала Аллаху, и нет божества, кроме Аллаха, и Аллах Велик."
      },
      "fa": {
        "meaning": "الله پاک است و ستایش از آن الله است و هیچ معبودی جز الله نیست و الله بزرگ‌تر است."
      },
      "hi": {
        "meaning": "अल्लाह पाक है, और तमाम तारीफ़ें अल्लाह के लिए हैं, और अल्लाह के सिवा कोई माबूद नहीं, और अल्लाह सबसे बड़ा है।"
      },
      "ms": {
        "meaning": "Maha Suci Allah, dan segala puji bagi Allah, dan tiada Tuhan yang berhak disembah melainkan Allah, dan Allah Maha Besar."
      },
      "sw": {
        "meaning": "Ametakasika Allah, na sifa zote njema ni za Allah, na hapana mola ila Allah, na Allah ni Mkubwa zaidi."
      },
      "bn": {
        "meaning": "আল্লাহ পবিত্র, এবং সমস্ত প্রশংসা আল্লাহর জন্য, এবং আল্লাহ ছাড়া কোন উপাস্য নেই, আর আল্লাহ সর্বশ্রেষ্ঠ।"
      }
    }
  },
  {
    "id": "twilight_14",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
    "transliteration": "Allāhumma innī asʾalukal-hudā wat-tuqā wal-ʿafāfa wal-ghinā",
    "source": "Muslim 2721",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for guidance, piety, abstinence (from unlawful things), and self-sufficiency."
      },
      "ar": {
        "meaning": "اللهم إني أسألك الهدى والتقى والعفاف والغنى"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, sifat iffah (menjaga diri dari yang haram), dan kekayaan."
      },
      "ur": {
        "meaning": "اے اللہ! میں تجھ سے ہدایت، تقویٰ، پاکدامنی اور غنا (خود کفائی) کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım, Senden hidayet, takva, iffet ve zenginlik dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande la guidée, la piété, la chasteté et la suffisance."
      },
      "ru": {
        "meaning": "О Аллах, я прошу Тебя о руководстве, богобоязненности, целомудрии и самодостаточности."
      },
      "fa": {
        "meaning": "ای الله، من از تو هدایت، تقوا، عفت و بی‌نیازی را مسئلت می‌نمایم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तुझसे हिदायत, तक़वा, अफ़ाफ़ (पाकदामनी) और गिना (आत्मनिर्भरता) का सवाल करता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, sifat iffah (menjaga diri dari yang haram), dan kekayaan."
      },
      "sw": {
        "meaning": "Ewe Allah, hakika mimi nakuomba uongofu, uchamungu, kujitakasa (kutoka haramu), na utoshelevu."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে হেদায়েত, তাকওয়া, পবিত্রতা এবং সচ্ছলতা চাই।"
      }
    }
  },
  {
    "id": "twilight_15",
    "category_id": "daily_essentials",
    "subcategory_id": "twilight_sunrise",
    "tag": "liminal_times",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ",
    "transliteration": "Allāhumma innī aʿūdhu bika min sharri mā ʿamiltu wa min sharri mā lam aʿmal",
    "source": "Muslim 2716",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in You from the evil of what I have done and from the evil of what I have not done."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kejahatan apa yang telah aku lakukan dan dari kejahatan apa yang belum aku lakukan."
      },
      "ur": {
        "meaning": "اے اللہ! میں تیری پناہ چاہتا ہوں اس چیز کے شر سے جو میں نے کیا اور اس چیز کے شر سے جو میں نے نہیں کیا۔"
      },
      "tr": {
        "meaning": "Allah'ım, yaptığım şeyin şerrinden ve yapmadığım şeyin şerrinden Sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Toi contre le mal de ce que j'ai fait et contre le mal de ce que je n'ai pas fait."
      },
      "ru": {
        "meaning": "О Аллах, я прибегаю к Тебе от зла того, что я совершил, и от зла того, чего я не совершил."
      },
      "fa": {
        "meaning": "ای الله، من به تو پناه می‌برم از شر آنچه انجام داده‌ام و از شر آنچه انجام نداده‌ام."
      },
      "hi": {
        "meaning": "ऐ अल्लाह! मैं तेरी पनाह चाहता हूँ उस चीज़ के शर से जो मैंने किया और उस चीज़ के शर से जो मैंने नहीं किया।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kejahatan apa yang telah aku lakukan dan dari kejahatan apa yang belum aku lakukan."
      },
      "sw": {
        "meaning": "Ewe Allah, hakika mimi najikinga Kwako kutokana na shari ya yale niliyoyafanya na kutokana na shari ya yale ambayo sikuyatenda."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে আমার কৃতকর্মের অনিষ্ট থেকে এবং আমার অকৃতকর্মের অনিষ্ট থেকে আশ্রয় চাই।"
      }
    }
  }
]