[
  {
    "id": "special_1",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "اللَّهُمَّ صَيِّبًا نَافِعًا",
    "transliteration": "Allāhumma ṣayyiban nāfiʿā",
    "source": "Bukhari 1032 (Upon seeing rain)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, (make it) a beneficial rain."
      },
      "ar": {
        "meaning": "اللهم صيبا نافعا"
      },
      "id": {
        "meaning": "Ya Allah, jadikanlah hujan ini bermanfaat."
      },
      "ur": {
        "meaning": "اے اللہ، اسے نفع بخش بارش بنا۔"
      },
      "tr": {
        "meaning": "Allah'ım! Faydalı bir yağmur kıl."
      },
      "fr": {
        "meaning": "Ô Allah, (fais que ce soit) une pluie bénéfique."
      },
      "ru": {
        "meaning": "О Аллах, (сделай ее) дождем благотворным."
      },
      "fa": {
        "meaning": "بارالها، بارانی سودمند (قرار ده)."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, इसे नफा देने वाली बारिश बना दे।"
      },
      "ms": {
        "meaning": "Ya Allah, (jadikanlah) hujan ini bermanfaat."
      },
      "sw": {
        "meaning": "Ee Allah, (fanya iwe) mvua yenye manufaa."
      },
      "bn": {
        "meaning": "হে আল্লাহ, (এটি) উপকারী বৃষ্টি করুন।"
      }
    }
  },
  {
    "id": "special_2",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ",
    "transliteration": "Muṭirnā bi faḍlillāhi wa raḥmatih",
    "source": "Bukhari 846, Muslim 71 (After rain, attributing it to Allah's favor)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "We have been given rain by the grace and mercy of Allah."
      },
      "ar": {
        "meaning": "مطرنا بفضل الله ورحمته"
      },
      "id": {
        "meaning": "Kami diberi hujan dengan karunia dan rahmat Allah."
      },
      "ur": {
        "meaning": "ہم پر اللہ کے فضل اور اس کی رحمت سے بارش ہوئی ہے۔"
      },
      "tr": {
        "meaning": "Allah'ın lütfu ve rahmetiyle yağmur yağdırıldık."
      },
      "fr": {
        "meaning": "La pluie nous a été accordée par la grâce et la miséricorde d'Allah."
      },
      "ru": {
        "meaning": "Нам был дан дождь по милости и милосердию Аллаха."
      },
      "fa": {
        "meaning": "با فضل و رحمت خدا بر ما باران بارید."
      },
      "hi": {
        "meaning": "हमें अल्लाह के फ़ज़ल और उसकी रहमत से बारिश मिली है।"
      },
      "ms": {
        "meaning": "Kami diberi hujan dengan kurnia dan rahmat Allah."
      },
      "sw": {
        "meaning": "Tumepata mvua kwa fadhila na rehema za Allah."
      },
      "bn": {
        "meaning": "আমাদের উপর আল্লাহর অনুগ্রহ ও রহমতে বৃষ্টি বর্ষিত হয়েছে।"
      }
    }
  },
  {
    "id": "special_3",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلاَمَةِ وَالإِسْلاَمِ، وَالتَّوْفِيقِ لِمَا تُحِبُّ وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ",
    "transliteration": "Allāhu Akbar, Allāhumma ahillahu ʿalaynā bil-amni wal-īmān, was-salāmati wal-islām, wat-tawfīqi limā tuḥibbu wa tarḍā, Rabbunā wa Rabbukallāh",
    "source": "Tirmidhi 3451 (Upon seeing the new moon (Hilal))",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "Allah is the greatest. O Allah, make this new moon appear to us with security and faith, with safety and Islam, and with success for that which You love and are pleased with. Our Lord and your Lord is Allah."
      },
      "ar": {
        "meaning": "الله أكبر، اللهم أهله علينا بالأمن والإيمان، والسلامة والإسلام، والتوفيق لما تحب وترضى، ربنا وربك الله"
      },
      "id": {
        "meaning": "Allah Maha Besar. Ya Allah, terbitkanlah bulan ini kepada kami dengan keamanan dan keimanan, dengan keselamatan dan Islam, dan dengan taufik untuk apa yang Engkau cintai dan ridhai. Tuhan kami dan Tuhanmu adalah Allah."
      },
      "ur": {
        "meaning": "اللہ سب سے بڑا ہے۔ اے اللہ، اس چاند کو ہم پر امن اور ایمان کے ساتھ، سلامتی اور اسلام کے ساتھ، اور اس چیز کی توفیق کے ساتھ طلوع کر جس کو تو پسند کرتا اور راضی ہوتا ہے۔ ہمارا رب اور تیرا رب اللہ ہے۔"
      },
      "tr": {
        "meaning": "Allah en büyüktür. Allah'ım! Bu ayı bize güven, iman, selamet ve İslam ile sevdiğin ve razı olduğun şeylere muvaffakiyetle doğur. Rabbimiz ve senin Rabbin Allah'tır."
      },
      "fr": {
        "meaning": "Allah est le plus grand. Ô Allah, fais apparaître ce croissant lunaire sur nous avec la sécurité et la foi, la paix et l'Islam, et le succès pour ce que Tu aimes et agrées. Notre Seigneur et ton Seigneur est Allah."
      },
      "ru": {
        "meaning": "Аллах Велик. О Аллах, дай этому новому месяцу взойти над нами с безопасностью и верой, с благополучием и Исламом, и с успехом в том, что Ты любишь и чем доволен. Наш Господь и твой Господь — Аллах."
      },
      "fa": {
        "meaning": "خدا بزرگ‌تر است. بارالها، این ماه نو را بر ما با امنیت و ایمان، و با سلامتی و اسلام، و با توفیق برای آنچه دوست داری و می‌پسندی، طلوع ده. پروردگار ما و پروردگار تو، خداست."
      },
      "hi": {
        "meaning": "अल्लाह सबसे बड़ा है। ऐ अल्लाह, इस चाँद को हम पर अमन और ईमान के साथ, सलामती और इस्लाम के साथ, और उस चीज़ की तौफीक के साथ तुलूअ कर जिसे तू पसंद करता और राज़ी होता है। हमारा रब और तेरा रब अल्लाह है।"
      },
      "ms": {
        "meaning": "Allah Maha Besar. Ya Allah, terbitkanlah bulan ini kepada kami dengan keamanan dan keimanan, dengan keselamatan dan Islam, dan dengan taufik untuk apa yang Engkau cintai dan redhai. Tuhan kami dan Tuhanmu adalah Allah."
      },
      "sw": {
        "meaning": "Allah Mkubwa. Ee Allah, uufanye mwezi huu uonekane kwetu kwa amani na imani, na kwa salama na Uislamu, na kwa taufiki ya yale unayoyapenda na kuyaridhia. Mola wetu na Mola wako ni Allah."
      },
      "bn": {
        "meaning": "আল্লাহু আকবার। হে আল্লাহ, এই নতুন চাঁদকে আমাদের উপর নিরাপত্তা ও ঈমানের সাথে, শান্তি ও ইসলামের সাথে, এবং আপনার পছন্দ ও সন্তুষ্টির সাথে উদিত করুন। আমাদের রব এবং আপনার রব আল্লাহ।"
      }
    }
  },
  {
    "id": "special_4",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ، أَسْأَلُ اللَّهَ لَنَا وَلَكُمْ الْعَافِيَةَ",
    "transliteration": "Assalāmu ʿalaykum ahlad-diyāri minal-muʾminīna wal-muslimīn, wa innā in shāʾallāhu bikum lāḥiqūn, asʾalullāha lanā wa lakumul-ʿāfiyah",
    "source": "Muslim 974 (Upon visiting graves)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "Peace be upon you, inhabitants of these abodes, from among the believers and Muslims. And verily, Allah willing, we shall join you. I ask Allah for well-being for us and for you."
      },
      "ar": {
        "meaning": "السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون، أسأل الله لنا ولكم العافية"
      },
      "id": {
        "meaning": "Keselamatan atasmu wahai penduduk kuburan dari kalangan orang-orang mukmin dan muslim. Dan sesungguhnya kami, insya Allah, akan menyusul kalian. Aku memohon kepada Allah bagi kami dan bagi kalian keselamatan."
      },
      "ur": {
        "meaning": "تم پر سلام ہو، اے مومنوں اور مسلمانوں میں سے ان گھروں کے باسیو۔ اور بے شک ہم، اگر اللہ نے چاہا، تم سے ملنے والے ہیں۔ میں اللہ سے اپنے اور تمہارے لیے عافیت کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Ey müminler ve Müslümanlar diyarının sakinleri! Selam üzerinize olsun. İnşaallah biz de size katılacağız. Allah'tan bize ve size afiyet dilerim."
      },
      "fr": {
        "meaning": "Que la paix soit sur vous, habitants de ces demeures, parmi les croyants et les musulmans. Et certes, si Allah le veut, nous vous rejoindrons. Je demande à Allah le bien-être pour nous et pour vous."
      },
      "ru": {
        "meaning": "Мир вам, обитатели этих жилищ, из числа верующих и мусульман. И поистине, если пожелает Аллах, мы присоединимся к вам. Я прошу у Аллаха благополучия для нас и для вас."
      },
      "fa": {
        "meaning": "سلام بر شما ای اهل دیار از مؤمنین و مسلمانان. و ما نیز اگر خدا بخواهد به شما ملحق خواهیم شد. از خدا برای خودمان و شما عافیت می‌طلبم."
      },
      "hi": {
        "meaning": "तुम पर सलाम हो, ऐ मोमिनों और मुसलमानों में से इन घरों के बासियो। और बेशक हम, अगर अल्लाह ने चाहा, तुमसे मिलने वाले हैं। मैं अल्लाह से अपने और तुम्हारे लिए आफ़ियत का सवाल करता हूँ।"
      },
      "ms": {
        "meaning": "Keselamatan atasmu wahai penduduk kuburan dari kalangan orang-orang mukmin dan muslim. Dan sesungguhnya kami, insya-Allah, akan menyusul kalian. Aku memohon kepada Allah bagi kami dan bagi kalian keselamatan."
      },
      "sw": {
        "meaning": "Amani iwe juu yenu, wakazi wa makazi haya, miongoni mwa Waumini na Waislamu. Na hakika sisi, In Shaa Allah, tutakuungeni mkono. Namuomba Allah afya njema kwa ajili yetu na kwa ajili yenu."
      },
      "bn": {
        "meaning": "তোমাদের উপর শান্তি বর্ষিত হোক, হে মুমিন ও মুসলিমদের মধ্য থেকে এই আবাসস্থলসমূহের বাসিন্দারা। আর নিশ্চয়ই আমরা, ইনশাআল্লাহ, তোমাদের সাথে মিলিত হব। আমি আল্লাহ্র কাছে আমাদের ও তোমাদের জন্য সুস্থতা কামনা করি।"
      }
    }
  },
  {
    "id": "special_5",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أَجِرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
    "transliteration": "Innā lillāhi wa innā ilayhi rājiʿūn, Allāhumma ajirnī fī muṣībatī wa akhlif lī khayran minhā",
    "source": "Muslim 918 (Upon hearing news of a death or calamity)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "Indeed we belong to Allah, and indeed to Him we will return. O Allah, reward me in my calamity and compensate me with something better than it."
      },
      "ar": {
        "meaning": "إنا لله وإنا إليه راجعون، اللهم أجرني في مصيبتي وأخلف لي خيرا منها"
      },
      "id": {
        "meaning": "Sesungguhnya kami milik Allah, dan sesungguhnya kepada-Nya kami akan kembali. Ya Allah, berilah aku pahala dalam musibahku ini dan gantikanlah bagiku yang lebih baik daripadanya."
      },
      "ur": {
        "meaning": "بے شک ہم اللہ ہی کے ہیں اور بے شک ہمیں اسی کی طرف لوٹنا ہے۔ اے اللہ، مجھے میری مصیبت میں اجر عطا فرما اور اس سے بہتر بدلہ دے۔"
      },
      "tr": {
        "meaning": "Şüphesiz biz Allah'a aidiz ve şüphesiz O'na döneceğiz. Allah'ım! Başıma gelen musibette bana ecir ver ve bana ondan daha hayırlısını nasip et."
      },
      "fr": {
        "meaning": "Certes nous appartenons à Allah, et certes c'est à Lui que nous retournerons. Ô Allah, récompense-moi dans mon malheur et remplace-le par quelque chose de meilleur."
      },
      "ru": {
        "meaning": "Поистине, мы принадлежим Аллаху, и поистине, к Нему мы вернемся. О Аллах, вознагради меня в моей беде и возмести мне лучшим, чем это."
      },
      "fa": {
        "meaning": "ما از خداییم و به سوی او بازمی‌گردیم. بارالها، مرا در مصیبتم پاداش ده و بهتر از آن را برایم جایگزین کن."
      },
      "hi": {
        "meaning": "बेशक हम अल्लाह ही के हैं और बेशक हमें उसी की तरफ़ लौटना है। ऐ अल्लाह, मुझे मेरी मुसीबत में अज्र अता फ़रमा और इससे बेहतर बदला दे।"
      },
      "ms": {
        "meaning": "Sesungguhnya kami milik Allah, dan sesungguhnya kepada-Nya kami akan kembali. Ya Allah, berilah aku pahala dalam musibahku ini dan gantikanlah bagiku yang lebih baik daripadanya."
      },
      "sw": {
        "meaning": "Hakika sisi ni wa Allah, na hakika Kwake tutarejea. Ee Allah, unilipie katika msiba wangu na unipe badala yake kilicho bora zaidi."
      },
      "bn": {
        "meaning": "নিশ্চয়ই আমরা আল্লাহরই এবং নিশ্চয়ই আমরা তাঁরই দিকে প্রত্যাবর্তনকারী। হে আল্লাহ, আমার এই বিপদে আমাকে প্রতিদান দিন এবং আমাকে এর চেয়ে উত্তম কিছু প্রতিদান দিন।"
      }
    }
  },
  {
    "id": "special_6",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "اللَّهُمَّ بَارِكْ لَنَا فِيهَا وَزِدْنَا مِنْهَا",
    "transliteration": "Allāhumma bārik lanā fīhā wa zidnā minhā",
    "source": "Tirmidhi 3455 (Upon seeing the first fruits of a season, applicable for new beginnings)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, bless us in it and increase us from it."
      },
      "ar": {
        "meaning": "اللهم بارك لنا فيها وزدنا منها"
      },
      "id": {
        "meaning": "Ya Allah, berkahilah kami di dalamnya dan tambahkanlah kepada kami darinya."
      },
      "ur": {
        "meaning": "اے اللہ، ہمیں اس میں برکت دے اور اس میں ہمارے لیے اضافہ کر دے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Bize bunda bereket ver ve ondan bize artır."
      },
      "fr": {
        "meaning": "Ô Allah, bénis-nous en cela et augmente-nous en cela."
      },
      "ru": {
        "meaning": "О Аллах, благослови нас в этом и приумножь нам из этого."
      },
      "fa": {
        "meaning": "بارالها، در آن برای ما برکت قرار ده و از آن بر ما بیفزا."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, हमें इसमें बरकत दे और इसमें हमारे लिए इज़ाफ़ा कर दे।"
      },
      "ms": {
        "meaning": "Ya Allah, berkatilah kami di dalamnya dan tambahkanlah kepada kami darinya."
      },
      "sw": {
        "meaning": "Ee Allah, tubariki ndani yake na utuzidishie kutokana nayo."
      },
      "bn": {
        "meaning": "হে আল্লাহ, এতে আমাদের বরকত দিন এবং তা থেকে আমাদের বাড়িয়ে দিন।"
      }
    }
  },
  {
    "id": "special_7",
    "category_id": "special_pathways",
    "subcategory_id": "unique_calendar_moments",
    "tag": "new_moon",
    "arabic": "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأَمْنِ وَالإِيمَانِ، وَالسَّلَامَةِ وَالإِسْلَامِ، رَبِّي وَرَبُّكَ اللَّهُ",
    "transliteration": "Allāhumma ahlil-hu ʿalaynā bil-amni wal-īmān, was-salāmati wal-islām, rabbī wa rabbuka Allāh.",
    "source": "Jāmiʿ at-Tirmidhī 3451 (ḥasan)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, bring this crescent upon us with security and faith, peace and Islam; my Lord and your Lord is Allah."
      },
      "ar": {
        "meaning": "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا ... رَبِّي وَرَبُّكَ اللَّهُ"
      },
      "id": {
        "meaning": "Ya Allah, tampakkan hilal ini kepada kami dengan keamanan dan iman, keselamatan dan Islam; Tuhanku dan Tuhanmu adalah Allah."
      },
      "ur": {
        "meaning": "اے اللہ! اس ہلال کو ہم پر امن و ایمان اور سلامتی و اسلام کے ساتھ طلوع فرما؛ میرا اور تمہارا رب اللہ ہے۔"
      },
      "tr": {
        "meaning": "Allah’ım, bu hilali üzerimize güven ve iman, selamet ve İslam ile getir; benim de Rabbim, senin de Rabbin Allah’tır."
      },
      "fr": {
        "meaning": "Ô Allah, fais paraître ce croissant sur nous avec sécurité et foi, paix et Islam ; mon Seigneur et le tien est Allah."
      },
      "ru": {
        "meaning": "О Аллах, яви нам этот месяц с безопасностью, верой, благополучием и исламом; мой Господь и твой Господь — Аллах."
      },
      "fa": {
        "meaning": "خدایا، این هلال را با امنیت و ایمان، سلامتی و اسلام بر ما ظاهر فرما؛ پروردگار من و تو الله است."
      },
      "hi": {
        "meaning": "हे अल्लाह! इस चंद्रमा को हमारे लिए सुरक्षा और ईमान, सलामती और इस्लाम के साथ उदय कर; मेरा और तुम्हारा रब अल्लाह है।"
      },
      "ms": {
        "meaning": "Ya Allah, tampakkan anak bulan ini kepada kami dengan keamanan dan iman, keselamatan dan Islam; Tuhanku dan Tuhanmu ialah Allah."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, tuoneshe hilali hii kwa amani na imani, salama na Uislamu; Mola wangu na wako ni Allah."
      },
      "bn": {
        "meaning": "হে আল্লাহ! এই চাঁদকে আমাদের জন্য নিরাপত্তা ও ঈমান, শান্তি ও ইসলাম নিয়ে উদয় করুন; আমার ও তোমার রব আল্লাহ।"
      }
    }
  },
  {
    "id": "special_8",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ",
    "transliteration": "Bārakallāhu laka fī ahlika wa mālik",
    "source": "Bukhari 2842 (Upon congratulating someone, applicable when meeting after a long time)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "May Allah bless you in your family and your wealth."
      },
      "ar": {
        "meaning": "بارك الله لك في أهلك ومالك"
      },
      "id": {
        "meaning": "Semoga Allah memberkahimu pada keluargamu dan hartamu."
      },
      "ur": {
        "meaning": "اللہ تمہارے اہل و عیال اور مال میں برکت دے۔"
      },
      "tr": {
        "meaning": "Allah ailenizi ve malınızı size mübarek kılsın."
      },
      "fr": {
        "meaning": "Qu'Allah te bénisse dans ta famille et tes biens."
      },
      "ru": {
        "meaning": "Да благословит тебя Аллах в твоей семье и твоем имуществе."
      },
      "fa": {
        "meaning": "خداوند در خانواده و مالت به تو برکت دهد."
      },
      "hi": {
        "meaning": "अल्लाह तुम्हारे अह्ल व अयाल और माल में बरकत दे।"
      },
      "ms": {
        "meaning": "Semoga Allah memberkatimu pada keluargamu dan hartamu."
      },
      "sw": {
        "meaning": "Allah akubariki katika familia yako na mali yako."
      },
      "bn": {
        "meaning": "আল্লাহ আপনার পরিবার ও সম্পদে বরকত দান করুন।"
      }
    }
  },
  {
    "id": "special_9",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أُرْسِلَتْ بِهِ",
    "transliteration": "Allāhumma innī asʾaluka khayrahā wa khayra mā fīhā wa khayra mā ursilat bih, wa aʿūdhu bika min sharrihā wa sharri mā fīhā wa sharri mā ursilat bih",
    "source": "Muslim 899 (Upon seeing strong winds or divine signs of nature)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for its good, and the good of what is in it, and the good of what it has been sent with, and I seek refuge in You from its evil, and the evil of what is in it, and the evil of what it has been sent with."
      },
      "ar": {
        "meaning": "اللهم إني أسألك خيرها وخير ما فيها وخير ما أرسلت به، وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikannya, dan kebaikan apa yang ada padanya, dan kebaikan apa yang dengannya ia diutus, dan aku berlindung kepada-Mu dari keburukannya, dan keburukan apa yang ada padanya, dan keburukan apa yang dengannya ia diutus."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے اس کی بھلائی کا سوال کرتا ہوں، اور اس کی بھلائی کا جو اس میں ہے، اور اس کی بھلائی کا جس کے ساتھ اسے بھیجا گیا ہے، اور میں تیری پناہ چاہتا ہوں اس کی برائی سے، اور اس کی برائی سے جو اس میں ہے، اور اس کی برائی سے جس کے ساتھ اسے بھیجا گیا ہے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden bunun hayrını, içinde olanların hayrını ve kendisiyle gönderilenin hayrını isterim. Onun şerrinden, içinde olanların şerrinden ve kendisiyle gönderilenin şerrinden sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande son bien, et le bien de ce qu'il contient, et le bien de ce avec quoi il a été envoyé. Et je cherche refuge auprès de Toi contre son mal, et le mal de ce qu'il contient, et le mal de ce avec quoi il a été envoyé."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя ее блага, и блага того, что в ней, и блага того, с чем она была послана, и прибегаю к Тебе от ее зла, и зла того, что в ней, и зла того, с чем она была послана."
      },
      "fa": {
        "meaning": "بارالها، من از تو خیر آن را می‌خواهم و خیر آنچه در آن است و خیر آنچه با آن فرستاده شده است، و از شر آن و شر آنچه در آن است و شر آنچه با آن فرستاده شده است به تو پناه می‌برم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे उसकी भलाई का सवाल करता हूँ, और उसकी भलाई का जो उसमें है, और उसकी भलाई का जिसके साथ उसे भेजा गया है, और मैं तेरी पनाह चाहता हूँ उसकी बुराई से, और उसकी बुराई से जो उसमें है, और उसकी बुराई से जिसके साथ उसे भेजा गया है।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikannya, dan kebaikan apa yang ada padanya, dan kebaikan apa yang dengannya ia diutus, dan aku berlindung kepada-Mu dari keburukannya, dan keburukan apa yang ada padanya, dan keburukan apa yang dengannya ia diutus."
      },
      "sw": {
        "meaning": "Ee Allah, nakuomba wema wake, na wema wa yale yaliyomo ndani yake, na wema wa yale aliyotumwa nayo, na najikinga Kwako kutokana na shari yake, na shari ya yale yaliyomo ndani yake, na shari ya yale aliyotumwa nayo."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে এর কল্যাণ চাই, এবং এর মধ্যে যা আছে তার কল্যাণ চাই, এবং যা দ্বারা এটি পাঠানো হয়েছে তার কল্যাণ চাই। আর আমি আপনার কাছে এর অমঙ্গল থেকে আশ্রয় চাই, এবং এর মধ্যে যা আছে তার অমঙ্গল থেকে, এবং যা দ্বারা এটি পাঠানো হয়েছে তার অমঙ্গল থেকে।"
      }
    }
  },
  {
    "id": "special_10",
    "category_id": "special_pathways",
    "subcategory_id": "unique_calendar_moments",
    "tag": "completion",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
    "transliteration": "Al-ḥamdu li-llāhi lladhī bi-niʿmatihi tatimmu ṣ-ṣāliḥāt.",
    "source": "Musnad Aḥmad 23120 (ḥasan)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "All praise is for Allah by whose grace good deeds are completed."
      },
      "ar": {
        "meaning": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ"
      },
      "id": {
        "meaning": "Segala puji bagi Allah yang dengan nikmat-Nya kebaikan disempurnakan."
      },
      "ur": {
        "meaning": "تمام تعریف اللہ کے لیے ہے جس کی نعمت سے نیکیاں مکمل ہوتی ہیں۔"
      },
      "tr": {
        "meaning": "Hamd, O Allah’a mahsustur ki, O’nun nimetiyle hayırlar tamamlanır."
      },
      "fr": {
        "meaning": "Louange à Allah par Sa grâce les bonnes œuvres s’achèvent."
      },
      "ru": {
        "meaning": "Хвала Аллаху, по милости Которого завершаются благие дела."
      },
      "fa": {
        "meaning": "سپاس خدایی را که با نعمت او کارهای شایسته کامل می‌شود."
      },
      "hi": {
        "meaning": "सारी प्रशंसा उस अल्लाह के लिए है जिसकी नेमत से नेक काम पूरे होते हैं।"
      },
      "ms": {
        "meaning": "Segala puji bagi Allah yang dengan nikmat-Nya amal yang baik disempurnakan."
      },
      "sw": {
        "meaning": "Sifa zote ni za Allah ambaye kwa neema Yake mema hukamilika."
      },
      "bn": {
        "meaning": "সকল প্রশংসা সেই আল্লাহর যাঁর অনুগ্রহে কল্যাণকর কাজ সমাপ্ত হয়।"
      }
    }
  },
  {
    "id": "special_11",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "اللَّهُمَّ إِني أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
    "transliteration": "Allāhumma innī aʿūdhu bika min ʿadhābi jahannam, wa min ʿadhābil-qabr, wa min fitnatil-maḥyā wal-mamāt, wa min sharri fitnatil-masīḥid-dajjāl",
    "source": "Muslim 588 (For protection from grave, life and death trials, and Dajjal's trial - general protection, good for all times including times of change)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I seek refuge in You from the torment of Hellfire, and from the torment of the grave, and from the trials of life and death, and from the evil of the trial of the False Messiah (Dajjal)."
      },
      "ar": {
        "meaning": "اللهم إني أعوذ بك من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شر فتنة المسيح الدجال"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari azab Jahannam, dan dari azab kubur, dan dari fitnah kehidupan dan kematian, serta dari kejahatan fitnah Al-Masih Ad-Dajjal."
      },
      "ur": {
        "meaning": "اے اللہ، میں تیری پناہ چاہتا ہوں جہنم کے عذاب سے، اور قبر کے عذاب سے، اور زندگی و موت کے فتنے سے، اور مسیح دجال کے فتنے کے شر سے۔"
      },
      "tr": {
        "meaning": "Allah'ım! Cehennem azabından, kabir azabından, hayatın ve ölümün fitnesinden ve Mesih Deccal'in fitnesinin şerrinden sana sığınırım."
      },
      "fr": {
        "meaning": "Ô Allah, je cherche refuge auprès de Toi contre le châtiment de l'Enfer, et contre le châtiment de la tombe, et contre l'épreuve de la vie et de la mort, et contre le mal de l'épreuve de l'Antéchrist (Dajjal)."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прибегаю к Тебе от мучений Ада, и от мучений могилы, и от испытаний жизни и смерти, и от зла испытания Антихриста (Даджаля)."
      },
      "fa": {
        "meaning": "بارالها، من به تو پناه می‌برم از عذاب جهنم، و از عذاب قبر، و از فتنه زندگی و مرگ، و از شر فتنه مسیح دجال."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तेरी पनाह चाहता हूँ जहन्नम के अज़ाब से, और क़ब्र के अज़ाब से, और ज़िंदगी व मौत के फ़ितने से, और मसीह दज्जाल के फ़ितने के शर से।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari azab Jahannam, dan dari azab kubur, dan dari fitnah kehidupan dan kematian, serta dari kejahatan fitnah Al-Masih Ad-Dajjal."
      },
      "sw": {
        "meaning": "Ee Allah, hakika najikinga Kwako kutokana na adhabu ya Jahannam, na kutokana na adhabu ya kaburi, na kutokana na fitna ya uhai na mauti, na kutokana na shari ya fitna ya Masihi Dajjal."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই জাহান্নামের আযাব থেকে, এবং কবরের আযাব থেকে, এবং জীবন ও মৃত্যুর ফিতনা থেকে, এবং দাজ্জালের ফিতনার অনিষ্ট থেকে।"
      }
    }
  },
  {
    "id": "special_12",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
    "transliteration": "Allāhumma innī asʾalukal-ʿāfiyata fid-dunyā wal-ākhirah",
    "source": "Tirmidhi 3514 (General well-being, applicable for any blessed occasion or reunion)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, I ask You for well-being in this world and the Hereafter."
      },
      "ar": {
        "meaning": "اللهم إني أسألك العافية في الدنيا والآخرة"
      },
      "id": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu keselamatan di dunia dan akhirat."
      },
      "ur": {
        "meaning": "اے اللہ، میں تجھ سے دنیا اور آخرت میں عافیت کا سوال کرتا ہوں۔"
      },
      "tr": {
        "meaning": "Allah'ım! Senden dünyada ve ahirette afiyet dilerim."
      },
      "fr": {
        "meaning": "Ô Allah, je Te demande le bien-être dans ce monde et dans l'au-delà."
      },
      "ru": {
        "meaning": "О Аллах, поистине, я прошу у Тебя благополучия в этом мире и в Последней жизни."
      },
      "fa": {
        "meaning": "بارالها، از تو عافیت در دنیا و آخرت را مسئلت دارم."
      },
      "hi": {
        "meaning": "ऐ अल्लाह, मैं तुझसे दुनिया और आखिरत में आफ़ियत का सवाल करता हूँ।"
      },
      "ms": {
        "meaning": "Ya Allah, sesungguhnya aku memohon kepada-Mu keselamatan di dunia dan akhirat."
      },
      "sw": {
        "meaning": "Ee Allah, nakuomba afya njema katika dunia na Akhera."
      },
      "bn": {
        "meaning": "হে আল্লাহ, আমি আপনার কাছে দুনিয়া ও আখিরাতে সুস্থতা কামনা করি।"
      }
    }
  },
  {
    "id": "special_13",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
    "transliteration": "Subḥānallāhi wal-ḥamdulillāh walā ilāha illallāh wallāhu Akbar",
    "source": "Muslim 2695 (Glorification, praising, declaring oneness of Allah, and His greatness - general remembrance for any occasion)",
    "repeat": 33,
    "translations": {
      "en": {
        "meaning": "Glory be to Allah, and praise be to Allah, and there is no god but Allah, and Allah is the greatest."
      },
      "ar": {
        "meaning": "سبحان الله والحمد لله ولا إله إلا الله والله أكبر"
      },
      "id": {
        "meaning": "Maha Suci Allah, dan segala puji bagi Allah, dan tiada tuhan selain Allah, dan Allah Maha Besar."
      },
      "ur": {
        "meaning": "اللہ پاک ہے، اور تمام تعریفیں اللہ کے لیے ہیں، اور اللہ کے سوا کوئی معبود نہیں، اور اللہ سب سے بڑا ہے۔"
      },
      "tr": {
        "meaning": "Allah Sübhan'dır, hamd Allah'a mahsustur, Allah'tan başka ilah yoktur ve Allah en büyüktür."
      },
      "fr": {
        "meaning": "Gloire à Allah, louange à Allah, et il n'y a de dieu qu'Allah, et Allah est le Plus Grand."
      },
      "ru": {
        "meaning": "Пречист Аллах, и хвала Аллаху, и нет божества, кроме Аллаха, и Аллах Велик."
      },
      "fa": {
        "meaning": "منزه است خدا و سپاس از آن خداست و هیچ معبودی جز خدا نیست و خدا بزرگ‌تر است."
      },
      "hi": {
        "meaning": "अल्लाह पाक है, और तमाम तारीफें अल्लाह के लिए हैं, और अल्लाह के सिवा कोई माबूद नहीं, और अल्लाह सबसे बड़ा है।"
      },
      "ms": {
        "meaning": "Maha Suci Allah, dan segala puji bagi Allah, dan tiada tuhan selain Allah, dan Allah Maha Besar."
      },
      "sw": {
        "meaning": "Utukufu ni wa Allah, na sifa zote ni za Allah, na hapana Mola ila Allah, na Allah Mkubwa."
      },
      "bn": {
        "meaning": "আল্লাহ পবিত্র, এবং সকল প্রশংসা আল্লাহর জন্য, এবং আল্লাহ ব্যতীত কোন ইলাহ নেই, এবং আল্লাহ মহান।"
      }
    }
  },
  {
    "id": "special_14",
    "category_id": "special_pathways",
    "subcategory_id": "special_occasions",
    "tag": "unique_calendar_moments",
    "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "transliteration": "Lā ḥawla wa lā quwwata illā billāh",
    "source": "Bukhari 6384, Muslim 2704 (There is no power and no strength except with Allah - for reliance and seeking aid in difficult or significant moments)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "There is no might nor power except with Allah."
      },
      "ar": {
        "meaning": "لا حول ولا قوة إلا بالله"
      },
      "id": {
        "meaning": "Tiada daya dan tiada kekuatan kecuali dengan pertolongan Allah."
      },
      "ur": {
        "meaning": "کوئی طاقت و قوت نہیں مگر اللہ کی مدد سے۔"
      },
      "tr": {
        "meaning": "Güç ve kuvvet ancak Allah iledir."
      },
      "fr": {
        "meaning": "Il n'y a de force ni de puissance qu'en Allah."
      },
      "ru": {
        "meaning": "Нет мощи и силы, кроме как от Аллаха."
      },
      "fa": {
        "meaning": "هیچ حول و قوه‌ای نیست مگر به یاری خدا."
      },
      "hi": {
        "meaning": "कोई ताक़त व क़ुव्वत नहीं मगर अल्लाह की मदद से।"
      },
      "ms": {
        "meaning": "Tiada daya dan tiada kekuatan kecuali dengan pertolongan Allah."
      },
      "sw": {
        "meaning": "Hapana uwezo wala nguvu isipokuwa kwa Allah."
      },
      "bn": {
        "meaning": "আল্লাহ ব্যতীত কোনো ক্ষমতা ও শক্তি নেই।"
      }
    }
  },
  {
    "id": "special_15",
    "category_id": "special_pathways",
    "subcategory_id": "unique_calendar_moments",
    "tag": "new_moon_repeat",
    "arabic": "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأَمْنِ وَالإِيمَانِ، وَالسَّلَامَةِ وَالإِسْلَامِ، رَبِّي وَرَبُّكَ اللَّهُ",
    "transliteration": "Allāhumma ahlil-hu ʿalaynā bil-amni wal-īmān, was-salāmati wal-islām, rabbī wa rabbuka Allāh.",
    "source": "Jāmiʿ at-Tirmidhī 3451 (ḥasan)",
    "repeat": 1,
    "translations": {
      "en": {
        "meaning": "O Allah, bring this crescent upon us with security and faith, peace and Islam; my Lord and your Lord is Allah."
      },
      "ar": {
        "meaning": "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا ... رَبِّي وَرَبُّكَ اللَّهُ"
      },
      "id": {
        "meaning": "Ya Allah, tampakkan hilal ini kepada kami dengan keamanan dan iman, keselamatan dan Islam; Tuhanku dan Tuhanmu adalah Allah."
      },
      "ur": {
        "meaning": "اے اللہ! اس ہلال کو ہم پر امن و ایمان اور سلامتی و اسلام کے ساتھ طلوع فرما؛ میرا اور تمہارا رب اللہ ہے۔"
      },
      "tr": {
        "meaning": "Allah’ım, bu hilali üzerimize güven ve iman, selamet ve İslam ile getir; benim de Rabbim, senin də Rabbin Allah’tır."
      },
      "fr": {
        "meaning": "Ô Allah, fais paraître ce croissant sur nous avec sécurité et foi, paix et Islam ; mon Seigneur et le tien est Allah."
      },
      "ru": {
        "meaning": "О Аллах, яви нам этот месяц с безопасностью, верой, благополучием и исламом; мой Господь и твой Господь — Аллах."
      },
      "fa": {
        "meaning": "خدایا، این هلال را با امنیت و ایمان، سلامتی و اسلام بر ما ظاهر فرما؛ پروردگار من و تو الله است."
      },
      "hi": {
        "meaning": "हे अल्लाह! इस चंद्रमा को हमारे लिए सुरक्षा और ईमान, सलामती और इस्लाम के साथ उदय कर; मेरा और तुम्हारा रब अल्लाह है।"
      },
      "ms": {
        "meaning": "Ya Allah, tampakkan anak bulan ini kepada kami dengan keamanan dan iman, keselamatan dan Islam; Tuhanku dan Tuhanmu ialah Allah."
      },
      "sw": {
        "meaning": "Ee Mwenyezi Mungu, tuoneshe hilali hii kwa amani na imani, salama na Uislamu; Mola wangu na wako ni Allah."
      },
      "bn": {
        "meaning": "হে আল্লাহ! এই চাঁদকে আমাদের জন্য নিরাপত্তা ও ঈমান, শান্তি ও ইসলাম নিয়ে উদয় করুন; আমার ও তোমার রব আল্লাহ।"
      }
    }
  }
]